[
  {
    "bug_id": "R04-100",
    "severity": "HIGH",
    "category": "Taxonomy Issue",
    "component": "ReadabilityCategoryChart",
    "file_line": "src/components/readability/ReadabilityCategoryChart.jsx:16",
    "description": "Taxonomy key inconsistency between ReadabilityCategoryAccordion and ReadabilityCategoryChart. The accordion uses 'technicalAccessibility' as the category key while the chart uses 'technicalAccess'. This mismatch means the same category is keyed differently across sibling components, causing potential data lookup failures and confusing the IA model.",
    "steps": "1. Navigate to the Readability results page\n2. Compare category keys in the category chart vs the category accordion\n3. Observe 'technicalAccess' in ReadabilityCategoryChart line 16 vs 'technicalAccessibility' in ReadabilityCategoryAccordion line 37",
    "expected": "Both components should use the same taxonomy key for the Technical Accessibility category (e.g., 'technicalAccessibility' consistently)",
    "actual": "ReadabilityCategoryChart uses 'technicalAccess' while ReadabilityCategoryAccordion uses 'technicalAccessibility', creating a taxonomy split",
    "impact": "Category scores may fail to match between chart and accordion views; users may see data in one component but not the other for the same category, undermining trust in the scoring system"
  },
  {
    "bug_id": "R04-101",
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "component": "ReadabilityBenchmarkWidget",
    "file_line": "src/components/readability/ReadabilityBenchmarkWidget.jsx:97",
    "description": "The benchmark widget displays 'Avg Score' as a label, which is an abbreviation. Alongside it, 'Trend' and 'Percentile' are spelled out fully. The inconsistent use of abbreviation vs full-word labels in the same data group harms scannability and creates a labeling inconsistency.",
    "steps": "1. Navigate to the Readability input screen after 5+ analyses\n2. View the 'Your Benchmarks' widget\n3. Observe the three metric labels: 'Avg Score', 'Trend', 'Percentile'",
    "expected": "All three labels should follow the same naming convention, either all abbreviated or all spelled out (e.g., 'Average Score', 'Trend', 'Percentile')",
    "actual": "'Avg Score' uses an abbreviation while 'Trend' and 'Percentile' are fully spelled out",
    "impact": "Inconsistent labeling reduces scannability and can confuse users about whether 'Avg' is a different concept than 'Average'"
  },
  {
    "bug_id": "R04-102",
    "severity": "MEDIUM",
    "category": "Progressive Disclosure",
    "component": "ReadabilityCategoryAccordion",
    "file_line": "src/components/readability/ReadabilityCategoryAccordion.jsx:148",
    "description": "Category descriptions are hidden on mobile with 'hidden sm:block' but remain visible on desktop. This creates a progressive disclosure gap: mobile users lose context about what each category measures, with no alternative way to access this information.",
    "steps": "1. Navigate to the Readability score details tab on a mobile viewport (<640px)\n2. Observe the category accordion headers\n3. Note that category descriptions like 'Heading hierarchy, semantic HTML, content organization' are hidden",
    "expected": "Category descriptions should either be accessible via a tooltip, expandable detail, or shown in a condensed form on mobile",
    "actual": "Descriptions are completely hidden on mobile with no alternative access method",
    "impact": "Mobile users cannot understand what each scoring category evaluates, reducing their ability to interpret and act on scores"
  },
  {
    "bug_id": "R04-103",
    "severity": "MEDIUM",
    "category": "Cognitive Overload",
    "component": "ReadabilityCheckItem",
    "file_line": "src/components/readability/ReadabilityCheckItem.jsx:99",
    "description": "Check items with status 'pass' are not expandable even if they contain details, descriptions, or recommendations. Only 'fail' and 'warn' statuses allow expansion. This limits progressive disclosure by preventing users from understanding why a check passed, increasing cognitive load when troubleshooting borderline passes.",
    "steps": "1. Navigate to Readability score details\n2. Expand a category accordion\n3. Observe that passing checks have no expand/collapse chevron, even when check.description or check.recommendation data exists",
    "expected": "All check items with available detail data should be expandable regardless of status, allowing users to optionally drill into passing checks",
    "actual": "Only checks with status 'fail' or 'warn' are expandable (line 99: isExpandable requires check.status === 'fail' || check.status === 'warn')",
    "impact": "Users cannot investigate passing checks to understand scoring logic or verify borderline results, reducing transparency"
  },
  {
    "bug_id": "R04-104",
    "severity": "LOW",
    "category": "Labeling Issue",
    "component": "ReadabilityCoverageTable",
    "file_line": "src/components/readability/ReadabilityCoverageTable.jsx:35",
    "description": "Column headers in the coverage table use inconsistent label formats: 'Content %', 'Headings %', 'Entities %' use suffix-percent notation, while 'Usefulness' and 'Time' have no unit indicator. The 'AI Model' column uses a different domain term than the row data key 'llm'. These labeling inconsistencies reduce scannability.",
    "steps": "1. Navigate to the LLM coverage comparison table\n2. Review the column headers\n3. Note 'Content %', 'Headings %', 'Entities %' use percent suffix, but 'Usefulness' shows as X/10 in cells with no hint in the header, and 'Time' shows seconds with no header unit",
    "expected": "Headers should consistently indicate units (e.g., 'Usefulness (1-10)', 'Time (s)') or use a uniform labeling pattern",
    "actual": "Three headers use '% ' suffix, two headers omit unit information entirely, creating inconsistent label conventions",
    "impact": "Users must inspect cell data to understand the scale and units of the last two columns, adding unnecessary cognitive effort"
  },
  {
    "bug_id": "R04-105",
    "severity": "HIGH",
    "category": "IA Problem",
    "component": "ReadabilityCrossToolLinks",
    "file_line": "src/components/readability/ReadabilityCrossToolLinks.jsx:67",
    "description": "ReadabilityCrossToolLinks accepts 'analysis' as its prop but the parent ReadabilityDashboard passes 'sourceUrl' and 'checkResults' as separate props (line 511-513). The component expects analysis.sourceUrl and analysis.checkResults from a single analysis object, but receives different prop names, breaking the cross-tool navigation entirely.",
    "steps": "1. Complete a readability analysis on a URL\n2. Scroll to the 'Related Tools' section at the bottom of the dashboard\n3. Observe the cross-tool links do not appear because currentUrl is undefined",
    "expected": "Cross-tool links should render with the analyzed URL pre-populated in each link",
    "actual": "Component receives sourceUrl/checkResults props instead of analysis prop, so analysis?.sourceUrl is undefined and the component renders nothing or the fallback message",
    "impact": "Users cannot navigate from readability results to related tools (audit, schema, content planner, keyword research), breaking a key cross-tool IA workflow"
  },
  {
    "bug_id": "R04-106",
    "severity": "MEDIUM",
    "category": "Content Grouping",
    "component": "ReadabilityDashboard",
    "file_line": "src/components/readability/ReadabilityDashboard.jsx:407",
    "description": "Tab labels are truncated on mobile to show only the first word (line 408: tab.label.split(' ')[0]). This results in 'Score', 'How', 'Recommendations', and 'Issues'. The 'How' label (from 'How AI Sees Your Content') is meaningless in isolation, providing no information scent for mobile users.",
    "steps": "1. Open the Readability dashboard on a mobile viewport (<640px)\n2. Observe the tab bar labels\n3. Note the second tab reads 'How' instead of a meaningful short label",
    "expected": "Each tab should have a designated short label that retains meaning (e.g., 'AI View' instead of truncating to 'How')",
    "actual": "The tab label is split on space and only the first word is shown, resulting in 'How' which provides zero navigation information scent",
    "impact": "Mobile users cannot determine what the second tab contains without tapping it, degrading navigation efficiency and increasing cognitive load"
  },
  {
    "bug_id": "R04-107",
    "severity": "MEDIUM",
    "category": "Cognitive Overload",
    "component": "ReadabilityDashboard",
    "file_line": "src/components/readability/ReadabilityDashboard.jsx:300",
    "description": "The dashboard presents the AI summary, executive summary, category chart, quick wins section, tab bar, and tab content all on one scroll. There is no visual hierarchy separation between the 'above the fold' summary zone and the 'deep dive' detail zone. Users face 5+ distinct content blocks before reaching actionable tab panels.",
    "steps": "1. Complete a readability analysis\n2. View the results dashboard\n3. Count the number of distinct content blocks visible before the tab panels: action bar, score card, AI summary block, category chart, quick wins, then tabs",
    "expected": "Content should be grouped into clear zones with visual hierarchy: a summary zone (score + key insight) and a detail zone (tabs), with progressive disclosure gating the detail content",
    "actual": "Six content blocks are stacked linearly with equal visual weight before the user reaches the tab navigation at line 377",
    "impact": "Users experience cognitive overload from information density; key actions (like viewing recommendations) require excessive scrolling past blocks that compete for attention"
  },
  {
    "bug_id": "R04-108",
    "severity": "MEDIUM",
    "category": "Taxonomy Issue",
    "component": "ReadabilityIssuesTable",
    "file_line": "src/components/readability/ReadabilityIssuesTable.jsx:37",
    "description": "The CATEGORY_LABELS map in ReadabilityIssuesTable abbreviates 'Technical Accessibility' to 'Technical Access.' (with a trailing period), while the same category is labeled 'Technical Accessibility' in ReadabilityCategoryAccordion and 'Technical Accessibility' in ReadabilityCategoryChart. This creates a third variant label for the same taxonomy item.",
    "steps": "1. Navigate to the Issues tab on the Readability dashboard\n2. Filter or sort by category\n3. Observe the category column shows 'Technical Access.' with an abbreviation period\n4. Compare to the accordion which shows 'Technical Accessibility' and the chart which shows the same",
    "expected": "The category label should be identical across all views: 'Technical Accessibility'",
    "actual": "ReadabilityIssuesTable line 37 displays 'Technical Access.' -- an abbreviation with trailing period -- while sibling components use the full name",
    "impact": "Users see different names for the same category across views, undermining confidence in the taxonomy and making it harder to correlate issues with category scores"
  },
  {
    "bug_id": "R04-109",
    "severity": "LOW",
    "category": "Labeling Issue",
    "component": "ReadabilityIssuesTable",
    "file_line": "src/components/readability/ReadabilityIssuesTable.jsx:39",
    "description": "The CATEGORY_LABELS map in ReadabilityIssuesTable uses 'AI Signals' as the label for the aiSignals category, while ReadabilityCategoryAccordion uses 'AI-Specific Signals'. The shorter label omits the qualifier 'Specific', which changes the scope of the term.",
    "steps": "1. Navigate to the Issues tab and observe the category filter dropdown\n2. Note 'AI Signals' as a category option\n3. Switch to the Score Details tab and observe 'AI-Specific Signals' in the accordion\n4. Compare the two labels",
    "expected": "Both components should use the same label: 'AI-Specific Signals' or 'AI Signals' consistently",
    "actual": "Issues table uses 'AI Signals' while the accordion uses 'AI-Specific Signals'",
    "impact": "Users may perceive these as different categories; the shortened label also loses the important qualifier 'Specific' that distinguishes AI-readability signals from general AI topics"
  },
  {
    "bug_id": "R04-110",
    "severity": "MEDIUM",
    "category": "Navigation Gap",
    "component": "ReadabilityHistory",
    "file_line": "src/components/readability/ReadabilityHistory.jsx:220",
    "description": "The sort toggle button cycles through both sort field AND sort direction simultaneously in one click. The button label shows the current sort field ('Date' or 'Score') but the click handler toggles both field and direction at once, making the sorting behavior unpredictable from the user's perspective.",
    "steps": "1. Navigate to the Analysis History page\n2. Click the sort button showing 'Date'\n3. Observe the label changes to 'Score' AND the direction reverses simultaneously\n4. Click again and both field and direction change again",
    "expected": "Sort field and sort direction should be controlled independently, or at minimum the button should clearly indicate both the current field and direction",
    "actual": "Single button toggles both sort field and sort direction simultaneously (line 221-225: field toggles date/score while direction toggles asc/desc in the same click)",
    "impact": "Users cannot predictably control sorting; they cannot sort by date descending then switch to date ascending without going through an intermediate 'score' sort state"
  },
  {
    "bug_id": "R04-111",
    "severity": "HIGH",
    "category": "Navigation Gap",
    "component": "Breadcrumb",
    "file_line": "src/components/shared/Breadcrumb.jsx:5",
    "description": "The Breadcrumb ROUTE_CONFIG is missing the '/readability' route entirely. It maps '/audit', '/accessibility', '/image-alt', '/meta-generator', '/schema-generator' but omits '/readability'. This means the AI Readability Checker, one of seven active tools, has no breadcrumb navigation.",
    "steps": "1. Navigate to /app/readability\n2. Observe the breadcrumb area\n3. Note that no breadcrumb trail is rendered because 'readability' is absent from ROUTE_CONFIG",
    "expected": "Breadcrumb should include an entry for '/readability' with label 'AI Readability Checker' and parent '/'",
    "actual": "The ROUTE_CONFIG object at line 5-23 has no entry for '/readability', so buildBreadcrumbTrail returns an empty trail and no breadcrumb renders",
    "impact": "Users on the Readability tool have no breadcrumb wayfinding, cannot navigate back to the home page via breadcrumb, and the IA feels incomplete compared to other tools"
  },
  {
    "bug_id": "R04-112",
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "component": "Navigation",
    "file_line": "src/components/shared/Navigation.jsx:163",
    "description": "The tools dropdown in the main navigation uses tool.features[0] as the description text under each tool name (line 163). This means the first feature string acts as a navigation description, but feature strings are written as capability bullet points (e.g., '321 content checklist items', 'AI readability scoring'), not as navigational descriptions. The information scent is poor.",
    "steps": "1. Click the 'Tools' dropdown in the main navigation\n2. Observe the description under each tool name\n3. Note that 'AI Readability Checker' shows 'AI readability scoring' as its description -- a feature label, not a description of what the tool does",
    "expected": "Tool descriptions in the nav dropdown should be concise action-oriented descriptions (e.g., 'Analyze how AI reads your content') rather than feature bullet points",
    "actual": "Navigation uses tool.features[0] as description, which are capability fragments not designed for navigation context",
    "impact": "Users scanning the tools dropdown cannot effectively distinguish tools or understand what they do, reducing navigation efficiency for the 7-tool IA"
  },
  {
    "bug_id": "R04-113",
    "severity": "MEDIUM",
    "category": "IA Problem",
    "component": "ReadabilityCrossToolLinks",
    "file_line": "src/components/readability/ReadabilityCrossToolLinks.jsx:50",
    "description": "The cross-tool links component defines navigation to '/app/content-planner' and '/app/keyword-research' (lines 50-64), but these paths do not correspond to any registered tools in the tools.js config. The tool registry has no content-planner or keyword-research tool. These are phantom navigation destinations that would lead to 404 or empty routes.",
    "steps": "1. Complete a readability analysis on a URL\n2. View the 'Related Tools' section\n3. Click 'Plan Content Updates' linking to /app/content-planner\n4. Observe a 404 or blank page because no such route exists in the tool registry",
    "expected": "Cross-tool links should only reference routes that are registered and active in the tool configuration",
    "actual": "Two of four cross-tool links (content-planner, keyword-research) reference paths not defined in src/config/tools.js",
    "impact": "Users following cross-tool navigation links end up at non-existent destinations, breaking the information architecture flow and causing confusion"
  }
]
