[
  {
    "bug_id": "R02-200",
    "severity": "HIGH",
    "category": "Dark Mode Bug",
    "component": "GlobalCSS",
    "file_line": "src/index.css:53",
    "description": "Dark mode body background selector '.dark body, body.dark, .dark' is overly broad. The third selector '.dark' applies the background gradient to the .dark class element itself (typically <html>), which conflicts with the :root .dark rule at line 43 that sets a flat background-color. Two competing backgrounds (flat color vs gradient) creates a flash during initial render.",
    "steps": "1. Enable dark mode in the application\n2. Refresh the page\n3. Observe the background during initial paint",
    "expected": "Smooth single background rendering in dark mode with consistent gradient",
    "actual": "Brief flash as the flat background-color from :root .dark (line 43) competes with the gradient background from .dark (line 55-56) during CSS cascade resolution",
    "impact": "All dark mode users see a potential flash/flicker on page load"
  },
  {
    "bug_id": "R02-201",
    "severity": "MEDIUM",
    "category": "Dark Mode Bug",
    "component": "ButtonSecondary",
    "file_line": "src/index.css:135",
    "description": "The .btn-secondary component (line 135-141) uses hardcoded 'bg-white' with no dark: variant. While there is a .dark .btn-secondary override at line 555-556, any component using 'btn-secondary' class alongside Tailwind dark: utility pattern will not pick up the override since it relies on CSS specificity of .dark ancestor selector rather than Tailwind's dark: prefix convention.",
    "steps": "1. Toggle dark mode\n2. Inspect any secondary button\n3. Check if the bg-white is properly overridden everywhere",
    "expected": "Consistent dark mode styling on all secondary buttons regardless of DOM nesting",
    "actual": "Buttons styled with btn-secondary may show white background in dark mode if the .dark class is not on a proper ancestor",
    "impact": "Users with non-standard dark mode toggle implementations see white buttons on dark backgrounds"
  },
  {
    "bug_id": "R02-202",
    "severity": "MEDIUM",
    "category": "Dark Mode Bug",
    "component": "CardGlass",
    "file_line": "src/index.css:198",
    "description": "The .card-glass component uses 'bg-white/70' and 'border-white/20' (line 200-201). The dark override at line 550-551 changes to 'bg-charcoal-800/70' and 'border-charcoal-700/20'. However the dark override omits the backdrop-blur-xl and shadow-glass properties, meaning these carry over. The glass shadow designed for light backgrounds (--glass-shadow with rgba(31,38,135,0.08)) is invisible against dark backgrounds, making the card look flat.",
    "steps": "1. Enable dark mode\n2. View any component using card-glass class\n3. Compare visual depth with light mode",
    "expected": "Card glass should have visible depth/elevation effect in dark mode with appropriate shadow for dark surfaces",
    "actual": "Glass card appears flat with no visible shadow because the light-mode glass-shadow is invisible against dark backgrounds",
    "impact": "All users viewing glass-style cards in dark mode see reduced visual hierarchy"
  },
  {
    "bug_id": "R02-203",
    "severity": "HIGH",
    "category": "Dark Mode Bug",
    "component": "CardGradient",
    "file_line": "src/index.css:205",
    "description": "The .card-gradient class applies 'bg-gradient-to-br from-white to-charcoal-50/50' (line 207) but has no corresponding .dark .card-gradient override anywhere in the dark mode section (lines 540-674). In dark mode, the gradient card will still show a white-to-light gradient background, clashing with the dark theme.",
    "steps": "1. Enable dark mode\n2. View any component using card-gradient class\n3. Observe the card background color",
    "expected": "Card gradient should use dark-appropriate colors like from-charcoal-800 to-charcoal-900/50",
    "actual": "Card shows bright white-to-light gradient on a dark page, creating stark contrast and visual inconsistency",
    "impact": "All users viewing gradient cards in dark mode see jarring light-colored cards"
  },
  {
    "bug_id": "R02-204",
    "severity": "LOW",
    "category": "Dark Mode Bug",
    "component": "AvatarRing",
    "file_line": "src/index.css:403",
    "description": "The .avatar-ring class uses 'ring-white' and 'ring-offset-charcoal-50' which are light mode colors. No dark mode override exists for .dark .avatar-ring. In dark mode, the white ring and light offset will look wrong against dark backgrounds.",
    "steps": "1. Enable dark mode\n2. View user avatars with ring styling\n3. Inspect the ring color",
    "expected": "Avatar ring should adapt to dark theme (e.g., ring-charcoal-800, ring-offset-charcoal-900)",
    "actual": "White ring with light offset color visible against dark background, creating visual inconsistency",
    "impact": "Users in dark mode see avatar rings with incorrect colors"
  },
  {
    "bug_id": "R02-205",
    "severity": "HIGH",
    "category": "Z-Index Conflict",
    "component": "ModalBackdrop_DropdownMenu",
    "file_line": "src/index.css:329",
    "description": "Both .modal-backdrop (line 329) and .dropdown-menu (line 307) use z-50. If a dropdown is opened inside a modal, the dropdown will be at the same z-index as the modal backdrop, potentially causing the dropdown to appear behind the backdrop of a second modal or z-fighting issues.",
    "steps": "1. Open a modal that contains a dropdown\n2. Click the dropdown to expand it\n3. Observe the dropdown stacking",
    "expected": "Dropdown inside a modal should appear above the modal content, with z-index layering properly managed (e.g., dropdown z-60, modal-backdrop z-50)",
    "actual": "Both use z-50, causing potential z-fighting. Dropdown inside modal may not layer correctly if another overlay appears",
    "impact": "Users interacting with dropdowns in modals may see dropdown items hidden behind overlays"
  },
  {
    "bug_id": "R02-206",
    "severity": "MEDIUM",
    "category": "Color Inconsistency",
    "component": "GradeMapper",
    "file_line": "src/lib/readability/utils/gradeMapper.js:9",
    "description": "GRADE_MAP uses 'teal' as the color for grades B+ and B (lines 9-10), but the design system in index.css does not define any .badge-teal or dark mode override for teal badges. The badge system only defines badge-primary, badge-success (emerald), badge-warning (amber), badge-danger (red), badge-info (cyan), badge-purple, and badge-neutral. Using 'teal' will generate Tailwind classes like bg-teal-100 and text-teal-700 which may not have dark mode overrides.",
    "steps": "1. Run a readability analysis with a score between 80-89\n2. View the grade badge rendered from this color mapping\n3. Toggle dark mode",
    "expected": "Grade badge should use a color that has proper dark mode support in the design system, like 'emerald' or 'cyan'",
    "actual": "Teal-colored badges lack corresponding .dark .badge-teal overrides, potentially showing incorrect colors in dark mode",
    "impact": "Users viewing B/B+ grade scores see badges that may not properly adapt to dark mode"
  },
  {
    "bug_id": "R02-207",
    "severity": "MEDIUM",
    "category": "Color Inconsistency",
    "component": "ReadabilityExport_PDF",
    "file_line": "src/hooks/useReadabilityExport.js:60",
    "description": "The getGradeColorRGB function (lines 59-65) uses different score thresholds than the GRADE_MAP in gradeMapper.js (lines 6-15). The PDF export maps >=90 to emerald, >=80 to teal, >=70 to amber, >=60 to orange, and <60 to red. But GRADE_MAP has finer granularity: 95-100=A+/emerald, 90-94=A/emerald, 85-89=B+/teal, 80-84=B/teal, 75-79=C+/amber, 70-74=C/amber, 60-69=D/orange, 0-59=F/red. The score of 85 would be 'teal' in the UI but maps to teal in PDF, which happens to match, but a score of 92 maps to emerald in the GRADE_MAP but the PDF function also returns emerald for >=90. However, the key discrepancy: a score of 75 shows 'amber' in GRADE_MAP (C+) but in the PDF it uses getGradeColorRGB which returns amber for >=70 -- these happen to overlap but the dual mapping system is fragile and will diverge if either is modified independently.",
    "steps": "1. Run a readability analysis\n2. View the score in the UI\n3. Export to PDF\n4. Compare the color coding of grade between UI and PDF",
    "expected": "Single source of truth for score-to-color mapping used by both UI and PDF export",
    "actual": "Two independent color-mapping functions (getGradeColorRGB in useReadabilityExport.js and GRADE_MAP in gradeMapper.js) that could diverge",
    "impact": "Potential mismatch between grade colors shown in the UI and the exported PDF report"
  },
  {
    "bug_id": "R02-208",
    "severity": "MEDIUM",
    "category": "Color Inconsistency",
    "component": "DueDateUrgency",
    "file_line": "src/hooks/useDueDates.js:184",
    "description": "The getDueDateUrgency function returns 'yellow' as a color for items due in 2-3 days (line 184). The design system in index.css defines badges for amber (badge-warning) but not for 'yellow'. Using 'yellow' will produce Tailwind classes like bg-yellow-100/text-yellow-700 which have no dark mode overrides in the design system. Additionally, 'yellow' (line 184) and 'amber' (line 182) are visually very similar, creating a near-indistinguishable distinction between 'today' and 'soon' items.",
    "steps": "1. Create due dates set for today, tomorrow, and 2-3 days from now\n2. View the due date urgency indicators\n3. Toggle dark mode",
    "expected": "Urgency colors should use design system tokens (amber for warning) and have sufficient visual distinction between levels",
    "actual": "'yellow' is not a standard badge color in the design system, lacks dark mode override, and is nearly identical to 'amber' making today vs soon items hard to distinguish",
    "impact": "Users cannot easily distinguish between 'today' and 'soon' urgency levels; dark mode styling may be broken for yellow badges"
  },
  {
    "bug_id": "R02-209",
    "severity": "LOW",
    "category": "Spacing Issue",
    "component": "SkipLink",
    "file_line": "src/index.css:427",
    "description": "The .skip-link class uses 'left-4' for horizontal positioning (line 429) but the focus state uses 'focus:translate-y-4' (line 435). When the skip link becomes visible on focus, it appears at left-4 (16px) which may overlap with a sidebar navigation on wider screens. There is no responsive positioning — on mobile screens where left-4 is a significant portion of the viewport, it may be too close to the edge.",
    "steps": "1. Open the application on a mobile device\n2. Press Tab to focus the skip link\n3. Observe positioning relative to screen edges",
    "expected": "Skip link should be centered or have responsive positioning that works across breakpoints",
    "actual": "Fixed left-4 positioning may collide with sidebar elements on desktop and be too close to the edge on mobile",
    "impact": "Keyboard users on mobile or users with sidebars see mispositioned skip link"
  },
  {
    "bug_id": "R02-210",
    "severity": "MEDIUM",
    "category": "Dark Mode Bug",
    "component": "FormGroup",
    "file_line": "src/index.css:747",
    "description": "The .form-group:focus-within label rule (line 747-749) applies 'text-primary-600' when any input inside the form group has focus. There is no dark mode override (.dark .form-group:focus-within label). In dark mode with a dark background, primary-600 may have insufficient contrast against the charcoal background since it was designed for light backgrounds.",
    "steps": "1. Enable dark mode\n2. Click into a form field that is inside a .form-group container\n3. Observe the label color change",
    "expected": "Label should change to an appropriate dark mode primary color like text-primary-400 for adequate contrast",
    "actual": "Label changes to text-primary-600 which may have poor contrast against dark charcoal backgrounds",
    "impact": "Users filling forms in dark mode may find focused field labels hard to read"
  },
  {
    "bug_id": "R02-211",
    "severity": "MEDIUM",
    "category": "Animation Bug",
    "component": "StaggerChildren",
    "file_line": "src/index.css:498",
    "description": "The .stagger-children animation (lines 498-509) sets 'opacity: 0' on all children and then animates them in with delays. However, if the animation is interrupted or if the JS rendering is slow, children past the 6th element have no animation-delay defined (only nth-child 1-6 are covered). Any child beyond the 6th will remain at opacity: 0 indefinitely because the animation has 'forwards' fill mode but the delay defaults to 0ms which means they animate simultaneously with the first child, breaking the stagger effect.",
    "steps": "1. Navigate to a page using .stagger-children with more than 6 child elements\n2. Observe the animation sequence\n3. Note that children 7+ animate simultaneously with child 1",
    "expected": "All children should stagger sequentially, or a CSS custom property should handle dynamic stagger counts",
    "actual": "Children 7+ all animate at delay 0ms, creating a jarring batch appearance instead of smooth staggering",
    "impact": "Users see a broken stagger animation on lists/grids with more than 6 items"
  },
  {
    "bug_id": "R02-212",
    "severity": "LOW",
    "category": "Visual Hierarchy",
    "component": "PDFGenerator",
    "file_line": "src/lib/pdfGenerator.js:250",
    "description": "In the PDF checklist's didDrawCell callback (lines 246-261), priority text is drawn manually over the auto-table cell content. The code draws the colored priority text at position (data.cell.x + 2, data.cell.y + 5), but the autoTable also renders the same text in default color underneath. This results in double-rendered text — the original black text from autoTable plus the colored overlay, creating a visual muddy/bold appearance for priority values.",
    "steps": "1. Generate a detailed checklist PDF\n2. Zoom into the Priority column\n3. Observe the priority text rendering",
    "expected": "Priority text should be rendered once with the appropriate color",
    "actual": "Priority text is double-rendered (once by autoTable in default color, once by didDrawCell in colored overlay), causing blurry/bold text artifacts",
    "impact": "Users receiving PDF reports see fuzzy priority labels that look unprofessional"
  },
  {
    "bug_id": "R02-213",
    "severity": "LOW",
    "category": "Typography Bug",
    "component": "PDFPreview",
    "file_line": "src/lib/pdfGenerator.js:299",
    "description": "The previewPDF function (lines 299-305) calls URL.revokeObjectURL after only 100ms timeout (line 304). If the browser has not yet finished loading the PDF blob into the new window/tab, the URL will be revoked prematurely, causing a blank or broken preview. Most browsers need more time to load blob URLs in new tabs, especially for multi-page PDFs.",
    "steps": "1. Generate a large checklist PDF with many phases\n2. Click the preview/open in new tab option\n3. Observe if the PDF loads correctly in the new tab",
    "expected": "PDF should fully render in the new tab before the blob URL is revoked",
    "actual": "Blob URL is revoked after 100ms which may be too fast for the browser to load the PDF, resulting in a blank page",
    "impact": "Users previewing PDFs may see a blank tab, especially on slower connections or large reports"
  },
  {
    "bug_id": "R02-214",
    "severity": "MEDIUM",
    "category": "Dark Mode Bug",
    "component": "Scrollbar",
    "file_line": "src/index.css:86",
    "description": "The light mode scrollbar styling (lines 86-98) uses hardcoded colors (#f1f5f9 track, #cbd5e1 thumb) without CSS custom properties. The dark mode scrollbar (lines 101-111) overrides these, but only for elements inside a .dark ancestor. The main scrollbar on <html> or <body> elements may not receive dark mode styling if the .dark class is applied to <html> itself, because ::-webkit-scrollbar is a pseudo-element that may not inherit from the .dark class the same way regular elements do in all browsers.",
    "steps": "1. Enable dark mode\n2. Scroll the main page content\n3. Observe the scrollbar track and thumb colors in Chrome vs Firefox",
    "expected": "Scrollbar should be dark-themed (charcoal track, gray thumb) in dark mode consistently across browsers",
    "actual": "Main page scrollbar may remain light-colored in dark mode depending on where .dark class is applied and browser handling of pseudo-element inheritance",
    "impact": "Dark mode users see a bright scrollbar against a dark page, breaking the immersive dark theme"
  },
  {
    "bug_id": "R02-215",
    "severity": "LOW",
    "category": "Color Inconsistency",
    "component": "ExportHistory_VPAT",
    "file_line": "src/hooks/useExportHistory.js:53",
    "description": "The EXPORT_TYPES configuration (lines 20-63) uses 'rose' as the color for SCHEMA exports (line 53), while the ITEM_TYPE_INFO in useProjectLinkedItems.js (line 51) also uses 'rose' for schema items. However, the badge system in index.css has no .badge-rose class defined. The design system defines badge-primary, badge-success, badge-warning, badge-danger, badge-info, badge-purple, and badge-neutral. Using 'rose' would require manual Tailwind class construction (bg-rose-100 text-rose-700) which has no dark mode override in the CSS component layer.",
    "steps": "1. Navigate to the Export Hub or project linked items\n2. View a Schema/Structured Data item badge\n3. Toggle dark mode",
    "expected": "Schema item badges should use a color defined in the design system with proper dark mode support",
    "actual": "'rose' colored badges have no .dark .badge-rose override in index.css, so they will not adapt to dark mode",
    "impact": "Schema-related badges display with incorrect contrast in dark mode"
  }
]
