[
  {
    "bug_id": "R10-A-001",
    "severity": "CRITICAL",
    "category": "Missing Error State",
    "component": "ProjectCreationWizard",
    "file_line": "src/components/projects/ProjectCreationWizard.jsx:160",
    "description": "Project creation failure silently swallowed with only console.error. When createProject() throws an error (e.g., network failure, permissions error, Firestore write error), the catch block logs to console but provides zero user-facing feedback. The user sees the 'Creating...' button text revert to 'Create Project' with no explanation of what happened. Data they spent time entering across 4 wizard steps appears lost.",
    "steps": "1. Fill out all 4 steps of the Project Creation Wizard with valid data. 2. Disable network connection or simulate a Firestore error. 3. Click 'Create Project' on step 4.",
    "expected": "A clear error message should be displayed to the user (e.g., via toast notification or inline error) explaining the failure and suggesting retry. The form data should be preserved so users do not need to re-enter it.",
    "actual": "The error is only logged to console.error. The loading state resets to false and the button returns to 'Create Project' with no user-visible error feedback. The user has no idea why the project was not created.",
    "impact": "Users who encounter any server-side or network error during project creation will lose their progress without explanation, leading to frustration and potential data re-entry across 4 wizard steps. This is especially damaging for new users during onboarding."
  },
  {
    "bug_id": "R10-A-002",
    "severity": "HIGH",
    "category": "Undo Missing",
    "component": "BulkEditPanel",
    "file_line": "src/components/image-alt-generator/BulkEditPanel.jsx:84",
    "description": "Bulk edit quick actions (capitalize, lowercase, add/remove period, trim, mark decorative) apply immediately to multiple items with no undo capability. The handleBulkAction function directly mutates results via onUpdateResults without preserving previous state. The 'mark_decorative' action is especially destructive because it clears all alt text for selected items (line 132: alt_text = ''). Similarly, the find-and-replace function (handleFindReplace, line 147) has no undo support.",
    "steps": "1. Navigate to Image Alt Text Generator with multiple generated results. 2. Select all items using 'Select All'. 3. Click 'Mark Decorative' or any quick action. 4. Realize the action was applied incorrectly. 5. Attempt to undo.",
    "expected": "Either (a) a confirmation dialog before applying destructive bulk actions, or (b) an undo mechanism (e.g., toast with 'Undo' button) that allows reverting to the previous state within a short time window.",
    "actual": "Changes are applied immediately and permanently. There is no undo option, no confirmation dialog, and no way to revert. The 'Mark Decorative' action silently erases alt text for all selected items with no recovery path.",
    "impact": "Users performing bulk operations on alt text can accidentally destroy work across many items. The 'mark_decorative' action deleting alt text is especially harmful since regenerating alt text requires AI processing and potentially significant time and cost."
  },
  {
    "bug_id": "R10-A-003",
    "severity": "HIGH",
    "category": "Feedback Gap",
    "component": "CommentThread",
    "file_line": "src/components/checklist/CommentThread.jsx:23",
    "description": "When adding a comment fails (onAddComment rejects), the error is only logged to console.error with no user-facing feedback. The catch block at line 23 contains only 'console.error('Error adding comment:', error)'. The user's comment text is NOT cleared (since setNewComment('') is only called in the try block), which is at least consistent, but the user gets no indication that their comment was not posted.",
    "steps": "1. Open a checklist item with the comment thread visible. 2. Type a comment and click 'Post Comment'. 3. Simulate a network failure or Firestore permission error.",
    "expected": "A toast notification or inline error message should inform the user that the comment failed to post, with a suggestion to retry. The comment text should be preserved in the textarea for retry.",
    "actual": "The submitting state resets to false, the button reverts to 'Post Comment', but no error message is shown. The user may think the comment was posted when it was not.",
    "impact": "Comments are a critical collaboration feature. Silent failures can lead to miscommunication between team members who believe they have communicated but their messages were never persisted."
  },
  {
    "bug_id": "R10-A-004",
    "severity": "HIGH",
    "category": "Flow Break",
    "component": "CommentThread",
    "file_line": "src/components/checklist/CommentThread.jsx:141",
    "description": "The Edit and Delete buttons on comments (lines 141-153) are rendered but have no onClick handlers. They are purely visual elements with no functionality connected. When a user clicks 'Edit comment' or 'Delete comment', absolutely nothing happens.",
    "steps": "1. Open a checklist item that has existing comments. 2. Find a comment you authored (comment.userId === currentUser.uid). 3. Click the Edit (pencil) icon button. 4. Click the Delete (trash) icon button.",
    "expected": "Edit should open an inline editor allowing the user to modify the comment text. Delete should show a confirmation dialog and then remove the comment.",
    "actual": "Both buttons are rendered with proper aria-labels and icons but have no onClick handlers. Clicking them does nothing. This is a dead-end interaction that violates user expectations.",
    "impact": "Users see edit/delete controls on their own comments but cannot use them, creating frustration and a broken user experience. Users cannot correct typos, update outdated information, or remove mistaken comments."
  },
  {
    "bug_id": "R10-A-005",
    "severity": "HIGH",
    "category": "Form UX Issue",
    "component": "ProjectCreationWizard",
    "file_line": "src/components/projects/ProjectCreationWizard.jsx:119",
    "description": "The wizard validates step 2 requires targetLaunchDate but does not validate that targetLaunchDate is after startDate. A user can set a target launch date before the start date, which is logically invalid and will cause confusing downstream behavior in timeline displays, progress tracking, and due date calculations throughout the application.",
    "steps": "1. Navigate to Create New Project wizard. 2. Complete Step 1 with valid data. 3. On Step 2, set Start Date to '2026-06-01'. 4. Set Target Launch Date to '2026-01-01' (5 months before start). 5. Click Next.",
    "expected": "Validation should catch that the target launch date precedes the start date and display an error message like 'Target launch date must be after the start date'.",
    "actual": "The form accepts the invalid date combination without any warning or error. The project will be created with an impossible timeline (ending before it starts).",
    "impact": "Projects with inverted timelines will display incorrect progress percentages, confusing Gantt charts, and misleading due date indicators across the dashboard and project views."
  },
  {
    "bug_id": "R10-A-006",
    "severity": "MEDIUM",
    "category": "Missing Error State",
    "component": "AuditLogViewer",
    "file_line": "src/components/admin/AuditLogViewer.jsx:261",
    "description": "The Refresh button at line 261-265 sets loading to true (setLoading(true)) but never triggers a new data fetch. The useEffect that fetches logs at line 93 only depends on [dateRange]. Clicking Refresh sets loading state but since no dateRange change occurs, the fetch is never re-triggered. The loading spinner will display indefinitely unless the user changes the date range filter.",
    "steps": "1. Navigate to the Audit Log Viewer page. 2. Wait for the initial load to complete. 3. Click the 'Refresh' button.",
    "expected": "The Refresh button should re-fetch the audit logs and display updated data, with a loading spinner that resolves once the fetch completes.",
    "actual": "The Refresh button sets loading to true, showing the loading spinner indefinitely. The data fetch is never re-triggered because it only depends on the dateRange state variable. The user is stuck in a permanent loading state.",
    "impact": "Users who click Refresh expecting updated data will see an infinite loading spinner with no way to recover except changing the date range filter or reloading the page. This is a functional dead-end."
  },
  {
    "bug_id": "R10-A-007",
    "severity": "MEDIUM",
    "category": "Feedback Gap",
    "component": "AuditLogViewer",
    "file_line": "src/components/admin/AuditLogViewer.jsx:664",
    "description": "The retention policy 'Save Policy' button at line 664 only shows a toast success message but does not actually persist the retention policy change. The onClick handler calls toast.success() and closes the modal but performs no API call, Firestore update, or localStorage write. The retention period state resets when the component remounts.",
    "steps": "1. Navigate to the Audit Log Viewer. 2. Click the 'Retention' button to open retention settings modal. 3. Select '1 year' retention policy. 4. Click 'Save Policy'. 5. Close and reopen the retention modal.",
    "expected": "The retention policy selection should be persisted (to database or settings store) and reflected when the modal is reopened. The save action should perform an actual write operation.",
    "actual": "A toast says 'Retention policy updated to 1 year' but the change is only stored in local component state. The value resets to '90' (the default) on component remount. The user is deceived by false success feedback.",
    "impact": "Compliance-critical setting appears to be saved but is not. Administrators may believe their organization is compliant with specific retention requirements when the setting was never actually applied."
  },
  {
    "bug_id": "R10-A-008",
    "severity": "MEDIUM",
    "category": "Navigation Dead-End",
    "component": "BatchAuditPanel",
    "file_line": "src/components/audit/BatchAuditPanel.jsx:313",
    "description": "The runBatchAudit function has a race condition at line 314: 'if (!isRunning) break;'. The isRunning check inside the for loop reads the initial value captured in the closure when runBatchAudit was called, not the current state value. This means the pause button (pauseAudit, line 385) sets isRunning to false, but the running loop's 'if (!isRunning) break' check will never see this change because React state updates are asynchronous and the closure captured the stale value. The audit cannot actually be paused.",
    "steps": "1. Open the Batch Audit Panel. 2. Add 10+ URLs. 3. Click 'Start Batch Audit'. 4. While audits are running, click the 'Pause' button.",
    "expected": "The batch audit should pause after the current URL finishes processing, showing remaining URLs as 'Pending'.",
    "actual": "The pause button updates the UI (shows 'Resume' button) and displays a toast, but the audit loop continues processing all URLs to completion because the stale closure value of isRunning is always true.",
    "impact": "Users cannot control long-running batch audits. If they started an audit on too many URLs or need to stop for any reason, the pause feature does not work, wasting processing resources and user time."
  },
  {
    "bug_id": "R10-A-009",
    "severity": "MEDIUM",
    "category": "Missing Empty State",
    "component": "ExportHubPage",
    "file_line": "src/components/export/ExportHubPage.jsx:321",
    "description": "When there are more than 6 projects, the ExportHubPage only shows the first 6 (projects.slice(0, 6) at line 321) but provides no pagination, 'Show More' button, or indication that additional projects exist. Users with many projects cannot access exports for projects beyond the first 6.",
    "steps": "1. Create 10+ projects in the Content Planner. 2. Navigate to the Export Hub page. 3. Look for projects beyond the first 6 in the 'Export Project Checklists' section.",
    "expected": "Either show all projects with pagination/virtualization, or display a 'View all N projects' link/button that allows the user to access all their projects for export.",
    "actual": "Only 6 projects are shown with no indication that more exist. Users with 7+ projects have no way to export checklists for the remaining projects from the Export Hub.",
    "impact": "Users with larger workloads cannot access export functionality for a portion of their projects, forcing them to find workarounds or miss important project data in their exports."
  },
  {
    "bug_id": "R10-A-010",
    "severity": "MEDIUM",
    "category": "Form UX Issue",
    "component": "FeedbackForm",
    "file_line": "src/components/feedback/FeedbackForm.jsx:143",
    "description": "The feedback form resets all fields when isOpen becomes false (useEffect at line 142-160) with a 300ms delay. However, there is no unsaved changes warning when closing the form. If a user has partially filled out a detailed bug report with steps to reproduce, expected/actual behavior, and a screenshot, clicking the backdrop (line 286-288) or pressing Escape (line 165) immediately closes the modal and queues all data for deletion with no confirmation.",
    "steps": "1. Open the feedback form. 2. Select 'Bug Report'. 3. Fill in title, description, steps to reproduce, expected/actual behavior. 4. Attach a screenshot. 5. Accidentally click the backdrop area outside the modal.",
    "expected": "If the user has entered substantial content, a confirmation dialog should appear: 'You have unsaved changes. Discard feedback?' with options to Continue Editing or Discard.",
    "actual": "The modal closes immediately and all entered data is cleared after 300ms. There is no recovery path for accidentally dismissed feedback with extensive content.",
    "impact": "Users who accidentally close the feedback form lose all their carefully composed bug reports, including uploaded screenshots. This discourages users from submitting detailed feedback, reducing the quality of bug reports received."
  },
  {
    "bug_id": "R10-A-011",
    "severity": "MEDIUM",
    "category": "Missing Loading State",
    "component": "ChecklistTemplates",
    "file_line": "src/components/checklist/ChecklistTemplates.jsx:45",
    "description": "The deleteTemplate and duplicateTemplate operations (called at lines 47 and 186 respectively) are async functions from the useChecklistTemplates hook, but there is no loading state during these operations. When deleting, the confirmDelete function awaits deleteTemplate but shows no spinner or disabled state on the 'Delete Template' button. Similarly, duplicateTemplate has no loading indicator. Users can click multiple times triggering duplicate operations.",
    "steps": "1. Open Checklist Templates modal and switch to 'My Templates' tab. 2. Click the duplicate icon on a template. 3. Quickly click it again before the first operation completes. 4. Alternatively, click delete on a template and quickly click 'Delete Template' in the confirmation modal multiple times.",
    "expected": "The duplicate and delete buttons should show a loading state (spinner or disabled state) while the async operation is in progress to prevent double-clicks and provide visual feedback.",
    "actual": "No loading indicator is shown during delete or duplicate operations. The buttons remain clickable, allowing multiple rapid clicks that can trigger duplicate Firestore writes or multiple delete attempts.",
    "impact": "Users may accidentally create multiple duplicates of a template or encounter confusing errors from multiple delete operations on the same resource."
  },
  {
    "bug_id": "R10-A-012",
    "severity": "MEDIUM",
    "category": "Edge Case",
    "component": "AuditLogViewer",
    "file_line": "src/components/admin/AuditLogViewer.jsx:382",
    "description": "When the audit log has data but the active filters (search query, action type, resource type, date range) result in zero matching results, the component shows the 'No Audit Logs Yet' empty state (line 382-389) because it checks 'logs.length === 0' (line 382) instead of checking 'filteredLogs.length === 0'. This means: if logs exist but filters exclude all of them, the user sees the initial onboarding empty state ('Logs will appear here as users interact with the system') instead of a 'No results match your filters' message with a way to clear filters.",
    "steps": "1. Navigate to the Audit Log Viewer with some existing audit logs. 2. Enter a search query that matches no logs (e.g., 'nonexistent-user-xyz'). 3. Observe the displayed state.",
    "expected": "A filtered empty state should appear: 'No logs match your current filters' with a 'Clear Filters' button to reset search and filter criteria.",
    "actual": "The 'No Audit Logs Yet' onboarding empty state is displayed because the check is against logs.length (the raw unfiltered array) which is 0 due to the TODO implementation. When real data exists, the ternary at line 382 checks 'logs.length === 0' not 'filteredLogs.length === 0', so with real data the table would render but show zero rows with no feedback when filters exclude everything.",
    "impact": "Users filtering audit logs will either see misleading onboarding messaging or an empty table with no guidance on how to find the logs they are looking for. This is confusing in a compliance context where users need to locate specific log entries."
  },
  {
    "bug_id": "R10-A-013",
    "severity": "LOW",
    "category": "Onboarding Gap",
    "component": "LoginForm",
    "file_line": "src/components/auth/LoginForm.jsx:21",
    "description": "The LoginForm catches errors from login() and loginWithGoogle() but relies entirely on the AuthContext to show error toasts (comment: 'Error already shown via toast in AuthContext'). There is no inline error display on the form itself. If the AuthContext's toast implementation fails, is delayed, or the user dismisses the toast quickly, there is no persistent error indication on the form. Unlike the RegisterForm which has an inline error div (line 132-135), the LoginForm has zero error state UI.",
    "steps": "1. Navigate to the login page. 2. Enter an invalid email/password combination. 3. Observe error feedback.",
    "expected": "In addition to toast notifications, the login form should display an inline error message near the submit button or at the top of the form, similar to the RegisterForm's error display, providing persistent feedback about what went wrong.",
    "actual": "Error feedback is only delivered via a transient toast notification. The form itself shows no error state. If the user misses the toast (it auto-dismisses), they have no indication of what went wrong.",
    "impact": "Users who fail to log in may not understand why, especially if they miss the brief toast notification. This creates friction at the critical entry point of the application."
  },
  {
    "bug_id": "R10-A-014",
    "severity": "LOW",
    "category": "Form UX Issue",
    "component": "ScheduledAuditsPanel",
    "file_line": "src/components/audit/ScheduledAuditsPanel.jsx:796",
    "description": "The AuditScheduleFormModal has a 3-step wizard but allows skipping directly to any step by clicking the step indicator bars (lines 851-862). The handleSubmit validates required fields (name, url, categories) only on final submission but not on step navigation. A user can skip from Step 1 to Step 3 without entering the required URL or name, then must backtrack when the final validation fails. The step indicators are clickable buttons but there is no per-step validation enforced.",
    "steps": "1. Open 'New Audit Schedule' modal. 2. Without entering any data on Step 1, click the Step 3 indicator bar. 3. Observe you can navigate to the Alerts step. 4. Click 'Create Schedule'.",
    "expected": "Either (a) validate required fields before allowing forward navigation (disable/grey-out future steps until current step validates), or (b) provide clear inline validation errors on each step when the user returns to fix them.",
    "actual": "Users can freely navigate to any step regardless of completion. Validation only fires on final submit via toast.error messages that do not indicate which step needs attention. The user must manually navigate back through steps to find and fix issues.",
    "impact": "The wizard UX is confusing when users skip ahead then face validation errors with no clear indication of which step is incomplete. This increases form completion time and abandonment rate."
  },
  {
    "bug_id": "R10-A-015",
    "severity": "LOW",
    "category": "Feedback Gap",
    "component": "FileUpload",
    "file_line": "src/components/checklist/FileUpload.jsx:28",
    "description": "The FileUpload component's onDrop handler (line 28) calls uploadFile and awaits it, but there is no error handling in onDrop itself. If the uploadFile function from useFileAttachments throws an error (e.g., file too large after server-side check, storage quota exceeded, permission denied), the error propagates unhandled. The component also silently ignores rejected files from react-dropzone (files that exceed maxSize or don't match accepted types) without showing user feedback.",
    "steps": "1. Navigate to a checklist item with the file upload component. 2. Attempt to drag and drop a 15MB file (exceeding MAX_FILE_SIZE). 3. Alternatively, drag a .exe file that doesn't match accepted types.",
    "expected": "The component should display a clear error message when files are rejected by dropzone validation (wrong type, too large) and should handle errors from the uploadFile function with user-facing feedback.",
    "actual": "Rejected files produce no visible feedback. The onDrop function has no error handling. The react-dropzone onDropRejected callback is not implemented, so invalid files are silently ignored.",
    "impact": "Users who attempt to upload unsupported files or files that are too large receive no feedback about why their upload did not work, leading to confusion and repeated failed attempts."
  }
]
