[
  {
    "bug_id": "R11-B-001",
    "severity": "HIGH",
    "category": "Taxonomy Gap",
    "component": "Glossary Data",
    "file_line": "src/data/glossary.js:246",
    "description": "The glossaryCategories array contains only 8 categories ('Fundamentals', 'On-Page SEO', 'Technical SEO', 'Content Strategy', 'Performance', 'Off-Page SEO', 'Metrics', 'International SEO'), but glossary terms reference additional categories that are not listed in the filter options. Specifically, terms use 'Content Quality' (ids 7, 30), 'SERP Features' (id 8), and 'Link Building' (id 16) as categories. These categories appear on term badges but cannot be filtered because they are missing from the glossaryCategories array.",
    "steps": "1. Open the Glossary page at /help/glossary.\n2. Review the category filter dropdown.\n3. Look for 'Content Quality', 'SERP Features', or 'Link Building' in the dropdown.\n4. Note these categories are not available as filter options.\n5. Observe that terms like 'E-E-A-T' (Content Quality) and 'Featured Snippet' (SERP Features) display these category badges but cannot be filtered to.",
    "expected": "All categories used by glossary terms should be included in the glossaryCategories filter array so users can filter terms by any category displayed.",
    "actual": "Three categories ('Content Quality', 'SERP Features', 'Link Building') are used on terms but missing from the glossaryCategories filter array, making those terms unfilterable by their assigned category.",
    "impact": "Users cannot filter glossary terms by 'Content Quality', 'SERP Features', or 'Link Building' categories. This undermines the taxonomy completeness and makes term discovery difficult for users interested in these topic areas."
  },
  {
    "bug_id": "R11-B-002",
    "severity": "MEDIUM",
    "category": "Terminology",
    "component": "SEO Config / Glossary",
    "file_line": "src/config/seo.js:113",
    "description": "The SEO configuration for the glossary page at pageSEO['help/glossary'] claims '100+ Terms Explained Simply' in the title tag, but the glossary data file (src/data/glossary.js) contains only 30 terms. This is a significant discrepancy between the metadata claim and the actual content, constituting misleading terminology/content representation.",
    "steps": "1. Open src/config/seo.js and locate the 'help/glossary' entry (line 113).\n2. Note the title says '100+ Terms Explained Simply'.\n3. Open src/data/glossary.js and count the terms in the glossaryTerms array.\n4. Count yields exactly 30 terms (ids 1-30).",
    "expected": "The SEO title and description should accurately reflect the actual number of glossary terms available (30 terms), or the glossary should be expanded to contain 100+ terms as advertised.",
    "actual": "The page title claims '100+ Terms' but only 30 terms exist in the data, creating a misleading content promise for users and search engines.",
    "impact": "Users arriving from search results expecting 100+ terms will be disappointed to find only 30. This harms trust, increases bounce rate, and could be considered deceptive SEO practice by search engines."
  },
  {
    "bug_id": "R11-B-003",
    "severity": "HIGH",
    "category": "Content Model Issue",
    "component": "Checklist Templates",
    "file_line": "src/hooks/useChecklistTemplates.js:161",
    "description": "The DEFAULT_TEMPLATES array defines template categories using an entirely different taxonomy from what the actual checklistData uses. The templates reference categories like 'technical', 'site-speed', 'indexing', 'content', 'on-page', 'meta-tags', 'local-seo', 'google-business', 'citations', 'product-pages', 'category-pages', 'schema', 'pre-launch', 'post-launch', 'redirects'. However, the checklistData items use a completely different category taxonomy: 'Foundation & Setup', 'Keyword Research', 'Technical SEO', 'Content Strategy', 'On-Page Optimization', etc. These two taxonomy systems do not align, meaning applying a template filter will fail to match any actual checklist items.",
    "steps": "1. Open the Checklist Templates modal.\n2. Select the 'Technical SEO Focus' template which has categories ['technical', 'site-speed', 'indexing'].\n3. Attempt to apply this template to filter checklist items.\n4. Observe that the checklist data uses categories like 'Technical SEO', 'Performance', 'Foundation & Setup' - none of which match the template's category values.",
    "expected": "Template categories should use the same taxonomy as the checklistData category field values so that template filtering correctly identifies matching checklist items.",
    "actual": "Template categories ('technical', 'site-speed', 'indexing') do not match any checklistData category values ('Technical SEO', 'Performance', etc.), making templates non-functional for filtering.",
    "impact": "Templates are a core content reuse feature but are effectively broken because the category taxonomy is misaligned. Users who apply a template expecting filtered items will get no results or incorrect results."
  },
  {
    "bug_id": "R11-B-004",
    "severity": "MEDIUM",
    "category": "Metadata Issue",
    "component": "Checklist Data",
    "file_line": "src/data/checklistData.js:1",
    "description": "The checklistData items lack several metadata fields that are essential for content governance and lifecycle management. Each item has id, phase, priority, item (description), owner, category, projectTypes, effortLevel, riskLevel, and deliverableType. However, there are no fields for: (1) dateAdded/lastUpdated to track content freshness, (2) sourceReference for provenance tracking, (3) applicableIndustry or audience segment for contextual filtering, (4) dependencies between items. This makes it impossible to track when items were last reviewed for accuracy or identify item dependencies.",
    "steps": "1. Open src/data/checklistData.js.\n2. Examine the data structure of any checklist item.\n3. Note the absence of date-related fields (created, updated, reviewed).\n4. Note the absence of dependency or prerequisite fields.\n5. Note the absence of version tracking metadata.",
    "expected": "Each checklist item should include metadata for: lastReviewedDate, versionNumber, prerequisiteIds (dependencies on other items), and sourceUrl/reference for maintaining content governance and lifecycle tracking.",
    "actual": "Checklist items have no temporal metadata (creation/update dates), no dependency tracking, and no provenance information, making content lifecycle management impossible.",
    "impact": "Without lifecycle metadata, there is no way to identify stale checklist items, track when SEO best practices were last validated, or understand item dependencies during project execution."
  },
  {
    "bug_id": "R11-B-005",
    "severity": "CRITICAL",
    "category": "Content Relationship",
    "component": "Cross-Tool Links",
    "file_line": "src/components/readability/ReadabilityCrossToolLinks.jsx:49",
    "description": "The CROSS_TOOL_LINKS array includes links to '/app/content-planner' and '/app/keyword-research' tools that do not exist in the application. The tools registry in src/config/tools.js defines tools with paths like '/app/planner' (not '/app/content-planner') and has no 'keyword-research' tool at all. This means two of the four cross-tool navigation links point to routes that will produce 404 errors or empty pages, breaking the content relationship navigation.",
    "steps": "1. Navigate to the Readability tool and analyze a URL.\n2. Scroll to the 'Related Tools' section rendered by ReadabilityCrossToolLinks.\n3. Click 'Plan Content Updates' which links to '/app/content-planner'.\n4. Observe a 404 or blank page (the correct path is '/app/planner').\n5. Go back and click 'Research Keywords' linking to '/app/keyword-research'.\n6. Observe a 404 or blank page (this tool does not exist).",
    "expected": "Cross-tool links should only reference tools that exist in the application and use correct route paths from the tools registry.",
    "actual": "Two out of four cross-tool links point to non-existent routes ('/app/content-planner' and '/app/keyword-research'), breaking cross-tool content relationships.",
    "impact": "Users following recommended cross-tool workflow paths encounter broken navigation. This undermines the integrated tool experience that is core to the content strategy workflow, causing user frustration and abandoned workflows."
  },
  {
    "bug_id": "R11-B-006",
    "severity": "MEDIUM",
    "category": "Taxonomy Gap",
    "component": "ReadabilityShareView / WeightConfig",
    "file_line": "src/components/readability/ReadabilityShareView.jsx:32",
    "description": "There is an inconsistency in the category taxonomy used for readability analysis across different components. ReadabilityWeightConfig defines categories as 'contentStructure', 'contentClarity', 'technicalAccess', 'metadataSchema', 'aiSignals'. However, ReadabilityShareView's CATEGORY_META uses 'technicalAccessibility' instead of 'technicalAccess'. This key mismatch means the 'Technical Accessibility' category will never display in the share view because the key does not match what the scoring engine produces.",
    "steps": "1. Open ReadabilityWeightConfig.jsx and note the key 'technicalAccess' (line 12).\n2. Open ReadabilityShareView.jsx and note the key 'technicalAccessibility' (line 32).\n3. Generate a readability analysis and share it.\n4. View the shared analysis and check the category breakdown.\n5. The 'Technical Accessibility' category may fall through to the fallback label because the key 'technicalAccess' from the scoring engine won't match 'technicalAccessibility' in CATEGORY_META.",
    "expected": "Category keys should be consistent across all components. Either all components should use 'technicalAccess' or 'technicalAccessibility'.",
    "actual": "ReadabilityWeightConfig uses 'technicalAccess' while ReadabilityShareView uses 'technicalAccessibility', causing a taxonomy key mismatch for the Technical Accessibility category.",
    "impact": "The shared view may display the raw key name instead of the human-readable label for the Technical Accessibility category, confusing external recipients who see the shared report."
  },
  {
    "bug_id": "R11-B-007",
    "severity": "HIGH",
    "category": "Content Reuse",
    "component": "Tool Configuration",
    "file_line": "src/config/tools.js:172",
    "description": "The tool feature counts in src/config/tools.js contradict each other and are duplicated with different values across SEO config. The schema-generator tool in tools.js claims '50+ schema types' (line 172) while the same tool in seo.js softwareSchemas claims '15+ schema types' (line 242). Similarly, the planner tool claims '321 content checklist items' across multiple locations, but the actual checklistData contains only around 200 items. These content claims are hardcoded strings scattered across multiple files rather than being derived from a single source of truth.",
    "steps": "1. Open src/config/tools.js line 172 - schema-generator features say '50+ schema types'.\n2. Open src/config/seo.js line 242 - same tool schema says '15+ schema types'.\n3. Compare the planner '321 content checklist items' claim (tools.js line 58) with the actual count of items in checklistData.js (approximately 200 items).\n4. Note that these content metrics are hardcoded strings in multiple locations.",
    "expected": "Tool feature counts should be derived from a single source of truth (e.g., constants or computed from actual data) and reused consistently across all components and configurations.",
    "actual": "Feature counts are hardcoded as strings in multiple files with contradictory values (50+ vs 15+ schema types). The '321 checklist items' claim appears in at least 3 files but the actual data contains approximately 200 items.",
    "impact": "Contradictory claims across the application damage credibility. Users viewing the features page see '15+ schema types' but the tool page says '50+'. The 321 checklist items claim is misleading when only ~200 exist in the data."
  },
  {
    "bug_id": "R11-B-008",
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "component": "Scheduled Reports",
    "file_line": "src/components/reports/ScheduledReportsPanel.jsx:154",
    "description": "The ScheduledReportsPanel component uses only local React state (useState) to manage all scheduled reports, with a TODO comment on line 154-155 stating 'Load scheduled reports from Firestore / Reports will be populated when users create scheduled reports'. This means all scheduled reports are lost on page refresh or navigation. For a content lifecycle feature that manages recurring report generation, this lack of persistence renders the entire scheduling system non-functional in practice.",
    "steps": "1. Open the Scheduled Reports panel.\n2. Create a new scheduled report with recipients and frequency.\n3. Refresh the browser page.\n4. Observe that all created schedules have been lost.\n5. Inspect the source code and note the TODO on line 154-155.",
    "expected": "Scheduled reports should be persisted to Firestore (or another persistent storage) so they survive page refreshes and can actually trigger automated report generation.",
    "actual": "Scheduled reports exist only in React component state and are lost on every page refresh. The Firestore integration is unimplemented (TODO comment only).",
    "impact": "The entire scheduled reports feature is non-functional for real usage. Users who configure automated reports lose all configurations on page refresh. This completely breaks the content lifecycle automation workflow for recurring report delivery."
  },
  {
    "bug_id": "R11-B-009",
    "severity": "MEDIUM",
    "category": "Governance Gap",
    "component": "Project Tagger",
    "file_line": "src/components/readability/ReadabilityProjectTagger.jsx:20",
    "description": "The ReadabilityProjectTagger component allows completely free-form tagging with no validation, no controlled vocabulary, and no governance constraints. Users can enter any arbitrary string as a tag, project name, or client name. There is no maximum tag count per item, no tag length limit (beyond what the input field width allows visually), no banned/reserved tag names, and no mechanism to enforce organizational tagging standards. The tag suggestions only show recent tags (line 44) rather than approved/governed tags.",
    "steps": "1. Navigate to the Readability tool input screen.\n2. Find the Project & Client Tags section.\n3. Enter an extremely long string as a project name.\n4. Add dozens of tags by clicking Add repeatedly.\n5. Enter tags with special characters, mixed case, or duplicate intent (e.g., 'SEO', 'seo', 'S.E.O').\n6. Observe no validation or governance is applied.",
    "expected": "The tagging system should enforce governance rules: controlled vocabulary or approved tag list, maximum tag count, tag length limits, case normalization, and optionally admin-curated tag sets for organizational consistency.",
    "actual": "Tags are completely uncontrolled free-text with no validation, normalization, length limits, or governed vocabulary. This will inevitably lead to taxonomy fragmentation as different users create inconsistent tags.",
    "impact": "Without tag governance, the tagging taxonomy will fragment over time, making it impossible to reliably filter, search, or report on content by tags. Different team members will create duplicates ('Website Redesign' vs 'website-redesign' vs 'Web Redesign') undermining organizational content strategy."
  },
  {
    "bug_id": "R11-B-010",
    "severity": "MEDIUM",
    "category": "Terminology",
    "component": "Tool Naming",
    "file_line": "src/config/tools.js:164",
    "description": "The schema-generator tool has inconsistent naming across the application. In tools.js it is named 'Structured Data Generator' (line 164), but in seo.js it is called 'Schema Markup Generator' (line 241). In the scheduled reports panel (ScheduledReportsPanel.jsx line 85), the related report is called 'Structured Data Report'. The cross-tool links in ReadabilityCrossToolLinks.jsx (line 31) call it 'Generate Schema Markup' and link to '/app/schema' (not '/app/schema-generator'). This terminology inconsistency creates confusion about whether 'schema', 'structured data', and 'schema markup' refer to the same tool or feature.",
    "steps": "1. Open the Tools navigation - see 'Structured Data Generator'.\n2. Open the Features page SEO config - see 'Schema Markup Generator'.\n3. Open Scheduled Reports - see 'Structured Data Report'.\n4. Open Readability cross-tool links - see 'Generate Schema Markup'.\n5. Note the inconsistent naming across all touchpoints.",
    "expected": "A single canonical name should be used consistently for this tool across all user-facing surfaces (navigation, feature pages, cross-tool references, reports, SEO metadata).",
    "actual": "The same tool is referred to as 'Structured Data Generator', 'Schema Markup Generator', 'Schema Generator', and 'Generate Schema Markup' across different components.",
    "impact": "Users may not realize these all refer to the same tool, causing confusion in navigation and support conversations. Inconsistent terminology undermines professional credibility and makes documentation/training difficult."
  },
  {
    "bug_id": "R11-B-011",
    "severity": "HIGH",
    "category": "Editorial Workflow",
    "component": "Checklist Templates",
    "file_line": "src/hooks/useChecklistTemplates.js:33",
    "description": "The useChecklistTemplates hook only queries templates created by the current user (line 33-36: where('createdBy', '==', currentUser.uid)). There is no mechanism to share templates between team members, even though the component description mentions 'shared templates' in the comment on line 24 ('Fetch templates (user's own + shared templates)'). This means editorial teams cannot share standardized checklist templates, forcing each team member to independently create and maintain their own templates rather than using organizationally approved ones.",
    "steps": "1. User A creates a custom checklist template.\n2. User B logs in and opens the Checklist Templates panel.\n3. User B cannot see User A's templates.\n4. Note the code comment on line 24 says 'user's own + shared templates' but the query only filters by createdBy == currentUser.uid.\n5. There is no 'shared' or 'isPublic' field being queried.",
    "expected": "The template query should include both user-owned templates AND shared/public templates (e.g., where isShared == true OR createdBy == currentUser.uid), matching the stated intent in the code comment.",
    "actual": "Only templates created by the current user are returned. The 'shared templates' mentioned in the comment are not implemented, isolating templates to individual users.",
    "impact": "Editorial teams cannot standardize their workflow through shared templates. Each team member must independently create and maintain templates, leading to inconsistent processes and duplicated effort across the content strategy team."
  },
  {
    "bug_id": "R11-B-012",
    "severity": "LOW",
    "category": "Metadata Issue",
    "component": "SEO Head",
    "file_line": "src/components/shared/SEOHead.jsx:36",
    "description": "The SEOHead component still renders the deprecated 'keywords' meta tag (line 36: seo.keywords && <meta name='keywords' content={seo.keywords} />). Google has publicly stated since 2009 that it does not use the keywords meta tag for ranking. Including it in the SEO configuration creates false confidence that filling in keywords will improve SEO, and it occupies configuration space in the seo.js page definitions that could be used for actually useful metadata like author, publish date, or article type.",
    "steps": "1. Open src/components/shared/SEOHead.jsx.\n2. Note line 36 renders <meta name='keywords'> when seo.keywords exists.\n3. Open src/config/seo.js and note that most page definitions include a 'keywords' field.\n4. Inspect the rendered HTML of any page with keywords defined.",
    "expected": "The SEO configuration should focus on metadata that actually impacts SEO (title, description, canonical, schema) and either remove the keywords meta tag entirely or clearly document it as having no SEO impact.",
    "actual": "The keywords meta tag is prominently included in the SEO configuration and rendered on pages, giving the false impression it has SEO value.",
    "impact": "Content strategists may spend time optimizing keywords meta tags thinking it improves SEO, wasting editorial effort on a deprecated feature. The configuration space could instead be used for more impactful metadata."
  },
  {
    "bug_id": "R11-B-013",
    "severity": "MEDIUM",
    "category": "Content Model Issue",
    "component": "Notification Preferences",
    "file_line": "src/components/shared/NotificationPreferences.jsx:22",
    "description": "The NOTIFICATION_TYPES configuration does not include notification types for content lifecycle events that are critical for a content strategy platform. Missing notification types include: 'content_review_due' (when content needs periodic review), 'checklist_item_updated' (when checklist best practices are updated), 'audit_completed' (when scheduled audits finish), 'content_expired' (when content reaches its review date), and 'report_generated' (when scheduled reports complete). The current types are limited to task assignments, mentions, overdue reminders, blockers, milestones, and comment replies -- all collaboration-focused rather than content lifecycle-focused.",
    "steps": "1. Open Notification Preferences.\n2. Review the available notification types.\n3. Note there are only 6 types, all focused on task collaboration.\n4. Try to find notifications for content lifecycle events like content review due dates, audit completions, or scheduled report delivery.\n5. No content lifecycle notification types exist.",
    "expected": "A content strategy platform should include notification types for content lifecycle events: content review due, audit completion, report delivery, content freshness warnings, and checklist updates.",
    "actual": "Only 6 collaboration-focused notification types exist. Zero content lifecycle notification types are available.",
    "impact": "Content strategists have no automated way to be notified about content lifecycle events. Content reviews will be missed, audit completions go unnoticed, and the content governance workflow lacks automated triggers."
  },
  {
    "bug_id": "R11-B-014",
    "severity": "HIGH",
    "category": "Content Reuse",
    "component": "Glossary / Help Content",
    "file_line": "src/components/help/GlossaryPage.jsx:178",
    "description": "The glossary 'Related Terms' feature displays related term names as clickable spans that set the search query (line 182-185), but the relatedTerms in the data are plain strings that may not exactly match any actual glossary term name. For example, term 'Alt Text' (id 1) lists 'Image Optimization' and 'Accessibility' as related terms, but there is no glossary term called 'Image Optimization' or 'Accessibility' in the glossaryTerms array. Clicking these related terms performs a search that returns no exact matches, providing a broken content relationship experience. Out of 30 terms, many reference related terms that do not exist as actual glossary entries.",
    "steps": "1. Open the Glossary page.\n2. Click on 'Alt Text' to expand it.\n3. See related terms: 'Image Optimization' and 'Accessibility'.\n4. Click 'Image Optimization' - it triggers a search.\n5. No term named 'Image Optimization' exists in the glossary.\n6. Repeat with multiple terms - many relatedTerms reference non-existent entries.",
    "expected": "Related terms should either: (a) only reference actual glossary term names with direct navigation links, or (b) be validated against the glossary to ensure all references resolve to existing entries.",
    "actual": "Related terms are free-text strings that frequently reference terms not present in the glossary, creating broken content relationships when clicked.",
    "impact": "Users clicking related terms expect to navigate to those term definitions but instead get empty or irrelevant search results. This undermines the knowledge graph value of the glossary and frustrates content discovery."
  },
  {
    "bug_id": "R11-B-015",
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "component": "Readability History",
    "file_line": "src/components/readability/ReadabilityHistory.jsx:102",
    "description": "The ReadabilityHistory component supports viewing and deleting past analyses, but provides no content lifecycle management capabilities such as: archiving analyses (to preserve but hide from active view), setting re-analysis reminders for periodic content monitoring, comparing two historical analyses side-by-side, or marking analyses as superseded when content has been updated. The only actions available are 'view' and 'delete', which is insufficient for content lifecycle tracking. The delete action permanently removes the data with no archive option.",
    "steps": "1. Navigate to the Readability tool history.\n2. Review available actions on history items.\n3. Note only 'view' (click on item) and 'delete' (trash icon) actions exist.\n4. Try to archive, compare, or set a review reminder on a historical analysis.\n5. No such actions are available.",
    "expected": "Content history should support lifecycle actions: archive (soft delete), set re-analysis schedule, compare analyses over time, and mark as superseded to maintain a complete content lifecycle record.",
    "actual": "Only hard delete and view are available. No archiving, comparison, scheduling, or lifecycle state tracking exists for historical analyses.",
    "impact": "Content strategists cannot track how content readability evolves over time or schedule periodic re-analyses. The delete-only approach means valuable historical data is permanently lost, preventing trend analysis and ROI reporting."
  }
]
