[
  {
    "bug_id": "R11-A-001",
    "severity": "CRITICAL",
    "category": "Content Model Issue",
    "component": "Checklist Data / Content Claims",
    "file_line": "src/data/checklistData.js:1",
    "description": "The checklist data contains 353 items, but the entire portal consistently claims '321-item checklist' across at least 15 locations including the landing page, feature detail page, onboarding walkthrough, SEO config, tool help panel, project dashboard, and getting started page. Additionally, the helpContent.js file header comment claims '313 checklist items' while actually containing 353 entries. This three-way inconsistency (321 claimed, 313 claimed in help, 353 actual) represents a fundamental content model integrity failure.",
    "steps": "1. Count the items in src/data/checklistData.js (353 items). 2. Search the codebase for '321' -- find it referenced in src/config/seo.js, src/config/tools.js, src/components/public/LandingPage.jsx, src/components/public/FeatureDetailPage.jsx, src/components/public/FeaturesPage.jsx, src/components/public/AboutPage.jsx, src/components/public/GettingStartedPage.jsx, src/components/help/OnboardingWalkthrough.jsx, src/components/shared/ToolHelpPanel.jsx, src/components/projects/ProgressDashboard.jsx, src/components/projects/ProjectDashboard.jsx. 3. Read the comment on line 1 of src/data/helpContent.js which says '313 checklist items'.",
    "expected": "All references to checklist item count should match the actual number of items (353) in checklistData.js, and the helpContent.js comment should also reflect the correct count.",
    "actual": "The portal claims 321 items across the UI, the helpContent.js header claims 313, but the actual data contains 353 checklist items.",
    "impact": "Users and clients are presented with inaccurate product claims. This undermines trust and credibility, which is especially damaging for a content strategy tool where accuracy is paramount. The ProgressDashboard uses hardcoded total: 321 which would produce incorrect completion percentages."
  },
  {
    "bug_id": "R11-A-002",
    "severity": "HIGH",
    "category": "Taxonomy Gap",
    "component": "Glossary Categories",
    "file_line": "src/data/glossary.js:246",
    "description": "The glossaryCategories array defines only 8 filterable categories (plus 'All'), but the glossary terms use 11 distinct categories. Three categories used by actual terms -- 'SERP Features' (id 8, Featured Snippet), 'Link Building' (id 16, Nofollow Link), and 'Content Quality' (id 7 E-E-A-T, id 30 YMYL) -- are missing from glossaryCategories. Users filtering by category will never be able to isolate these terms by their assigned category.",
    "steps": "1. Open GlossaryPage.jsx and use the category filter dropdown. 2. Note that 'SERP Features', 'Link Building', and 'Content Quality' are not options. 3. Look at glossary terms with id 7, 8, 16, and 30 -- they have categories that cannot be filtered.",
    "expected": "The glossaryCategories array should include all categories that are actually assigned to glossary terms: 'SERP Features', 'Link Building', and 'Content Quality' should be added.",
    "actual": "The glossaryCategories array is missing 3 categories that are used by glossary terms: 'SERP Features', 'Link Building', 'Content Quality'.",
    "impact": "Terms categorized under these three missing categories can only be found via text search or by browsing the 'All' view. The category filter -- a primary navigation mechanism for the glossary -- is incomplete, reducing discoverability of 4 out of 30 terms (13%)."
  },
  {
    "bug_id": "R11-A-003",
    "severity": "HIGH",
    "category": "Content Relationship",
    "component": "Glossary Related Terms",
    "file_line": "src/data/glossary.js:9",
    "description": "Every relatedTerms entry in the glossary references terms that do not exist as glossary entries. Out of 30 glossary terms, the relatedTerms arrays collectively reference 39 unique term names (such as 'Image Optimization', 'Link Building', 'Domain Authority', 'Keywords', 'Crawling', 'JSON-LD', etc.) that have no matching term definition in the glossary. The GlossaryPage component allows clicking related terms to search for them, but these searches will return no results since the referenced terms do not exist.",
    "steps": "1. Open GlossaryPage.jsx, expand any term (e.g., 'Alt Text'). 2. Click on a related term like 'Image Optimization' or 'Accessibility'. 3. Observe that the search returns no matching glossary terms. 4. Repeat for 'Backlink' -> click 'Link Building' or 'Domain Authority'. All related term links lead to empty results.",
    "expected": "Related terms should either (a) reference only terms that exist in the glossary, or (b) the glossary should be expanded to include all referenced terms. Currently every single relatedTerms reference is broken.",
    "actual": "39 distinct terms referenced in relatedTerms arrays have no corresponding glossary entry. 100% of related term cross-references are broken.",
    "impact": "The related terms feature, which is a core content navigation mechanism, provides a consistently broken user experience. Users following these cross-references will always get empty search results, undermining the glossary's utility as a knowledge base and creating a misleading content relationship model."
  },
  {
    "bug_id": "R11-A-004",
    "severity": "HIGH",
    "category": "Taxonomy Gap",
    "component": "AddCustomItemModal / Checklist Taxonomy",
    "file_line": "src/components/checklist/AddCustomItemModal.jsx:15",
    "description": "The CATEGORIES array in AddCustomItemModal.jsx defines 10 categories for custom checklist items: 'Technical SEO', 'Content', 'On-Page SEO', 'Off-Page SEO', 'Local SEO', 'Analytics', 'Performance', 'Security', 'Accessibility', 'Custom'. However, the actual checklistData.js uses 25 distinct categories including major ones like 'Content Strategy', 'AI & Generative Search', 'Schema Markup', 'Foundation & Setup', 'Image Optimization', 'Link Architecture', 'Mobile Optimization', 'Machine Readability', etc. The custom item categories are a completely different taxonomy from the main checklist categories.",
    "steps": "1. Open a project checklist page. 2. Click 'Add Custom Item'. 3. Expand the Category dropdown. 4. Compare available categories with those used in the main checklist (e.g., look at the filter dropdowns in SEOChecklist.jsx). 5. Note that major categories like 'Content Strategy', 'AI & Generative Search', 'Schema Markup', 'Foundation & Setup' are absent from custom items.",
    "expected": "Custom item categories should align with the categories used in the main checklist data, or at minimum provide a superset that includes the most important categories, so custom items can be meaningfully filtered alongside standard items.",
    "actual": "The custom item category taxonomy uses 10 categories that poorly overlap with the 25 categories in the checklist data. Only 'Technical SEO', 'Performance', 'Security', 'Accessibility', and 'Local SEO' match. Major categories are missing.",
    "impact": "Custom checklist items cannot be categorized using the same taxonomy as standard items, breaking category filtering consistency. Users cannot assign their custom items to categories like 'Content Strategy' or 'Schema Markup', which are among the most used categories in the standard checklist."
  },
  {
    "bug_id": "R11-A-005",
    "severity": "HIGH",
    "category": "Taxonomy Gap",
    "component": "ChecklistTemplates / Category Taxonomy",
    "file_line": "src/components/checklist/ChecklistTemplates.jsx:296",
    "description": "The CreateTemplateForm in ChecklistTemplates.jsx defines CATEGORY_OPTIONS with 15 categories that form yet a third distinct taxonomy, different from both the AddCustomItemModal categories (10 items) and the actual checklistData categories (25 items). This template category list includes entries like 'Content Optimization', 'Meta Tags', 'Site Speed', 'Internal Linking', 'External Linking', 'E-commerce' that do not match any checklistData category name. Meanwhile, major checklistData categories like 'AI & Generative Search', 'Foundation & Setup', 'Content Strategy', 'Machine Readability', 'Knowledge Graph' are absent.",
    "steps": "1. Open the Checklist Templates panel. 2. Click 'Create Template'. 3. Examine the 'Categories to Include' section. 4. Compare these 15 categories with the actual 25 categories in checklistData.js. 5. Note the naming mismatches: 'Content Optimization' vs 'Content Strategy', 'Site Speed' vs 'Performance', 'Meta Tags' (not a real category at all).",
    "expected": "Template category options should match the actual checklist data categories to ensure templates can correctly filter and include the desired checklist items.",
    "actual": "Three separate, inconsistent category taxonomies exist across the portal: checklistData (25 categories), AddCustomItemModal (10 categories), and ChecklistTemplates (15 categories). None fully align.",
    "impact": "Templates created with these categories will not correctly map to actual checklist items, resulting in templates that include wrong items or miss expected items. The itemCount calculation uses `selectedCategories.length * 8` as an approximation, which will be inaccurate since the categories don't match the data."
  },
  {
    "bug_id": "R11-A-006",
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "component": "OnboardingWalkthrough / ToolHelpPanel",
    "file_line": "src/components/help/OnboardingWalkthrough.jsx:32",
    "description": "The OnboardingWalkthrough references project phases as 'Discovery, Design, Development, and Launch' and the ToolHelpPanel references 'Discovery, Design, Development, Launch, or Post-Launch'. Neither matches the actual 6 phases defined in checklistData.js and SEOChecklist.jsx: 'Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch'. 'Design' and 'Development' are not real phases; 'Strategy', 'Build', and 'Pre-Launch' are omitted.",
    "steps": "1. Trigger the onboarding walkthrough for a new user (step 2). 2. Read the Content Planner description: 'Track progress across Discovery, Design, Development, and Launch phases.' 3. Open the tool help panel for the Content Planner. 4. Read 'Use the phase tabs to focus on Discovery, Design, Development, Launch, or Post-Launch tasks.' 5. Open an actual project checklist and see the real phases: Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch.",
    "expected": "Onboarding and help content should reference the actual phases: Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch.",
    "actual": "Onboarding mentions 'Discovery, Design, Development, and Launch'. ToolHelpPanel mentions 'Discovery, Design, Development, Launch, or Post-Launch'. Neither matches reality.",
    "impact": "New users are taught incorrect phase names during onboarding, creating confusion when they encounter the actual phases in the checklist interface. This erodes first-use confidence and increases support burden."
  },
  {
    "bug_id": "R11-A-007",
    "severity": "MEDIUM",
    "category": "Content Model Issue",
    "component": "FeatureDetailPage / SEO Config",
    "file_line": "src/components/public/FeatureDetailPage.jsx:75",
    "description": "The FeatureDetailPage stats section claims '8 Project Phases' for the Content Planner, and the SEO config description says 'Track progress across 8 phases'. However, the actual system has exactly 6 phases: Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch (as defined in SEOChecklist.jsx line 26 PHASES constant).",
    "steps": "1. Navigate to the Features page and click on Content Planner. 2. View the stats section showing '8 Project Phases'. 3. Compare with the actual PHASES array in SEOChecklist.jsx which defines exactly 6 phases.",
    "expected": "The phase count should reflect the actual 6 phases defined in the system.",
    "actual": "The UI claims 8 phases exist when only 6 are defined and used.",
    "impact": "Marketing claims on the public-facing feature detail page are inaccurate. Prospects evaluating the tool receive false product specifications, which could be seen as misleading marketing."
  },
  {
    "bug_id": "R11-A-008",
    "severity": "MEDIUM",
    "category": "Terminology",
    "component": "Checklist Data / TTFB Guidance",
    "file_line": "src/data/checklistData.js:59",
    "description": "Two checklist items provide contradictory guidance for Time to First Byte (TTFB) targets. Item 58 (line 59) states 'Reduce server response time (TTFB - Time to First Byte) to under 600ms'. Item 154 (line 155) states 'Optimize Time to First Byte (TTFB) - target < 800ms'. These are contradictory performance recommendations within the same checklist, with a 200ms discrepancy in the target threshold.",
    "steps": "1. Open the checklist and search for 'TTFB'. 2. Find item 58 which targets < 600ms. 3. Find item 154 which targets < 800ms. 4. Note the contradictory guidance for the same metric.",
    "expected": "Both items should reference the same TTFB target threshold, ideally aligned with current web performance best practices.",
    "actual": "Item 58 targets < 600ms and item 154 targets < 800ms for the same metric (TTFB).",
    "impact": "Users following the checklist will receive contradictory guidance on a critical performance metric. This undermines the checklist's authority as a definitive SEO reference and could lead to confusion about which target to meet."
  },
  {
    "bug_id": "R11-A-009",
    "severity": "MEDIUM",
    "category": "Metadata Issue",
    "component": "Glossary Data / Title Tag Example",
    "file_line": "src/data/glossary.js:210",
    "description": "The glossary term 'Title Tag' (id 26) uses the example '<title>Best Running Shoes 2024 - Reviews & Buying Guide</title>' with the year 2024. Given the system is deployed in 2026, this example is stale. For a glossary intended as a living reference, time-sensitive examples should reflect current or near-current dates. Similarly, the resources.js file has a resource titled 'Keyword Research Strategies for 2024' (line 142), which is also outdated.",
    "steps": "1. Navigate to the Glossary page and search for 'Title Tag'. 2. Expand the term and view the example showing '2024'. 3. Navigate to Resource Library and find 'Keyword Research Strategies for 2024'. 4. Note both contain outdated year references in a 2026 system.",
    "expected": "Content examples and resource titles should use current or timeless references, or include a content freshness strategy with periodic review dates.",
    "actual": "Glossary examples and resource titles reference the year 2024, appearing stale in a 2026 system.",
    "impact": "Outdated year references in educational content reduce perceived authority and relevance. For an SEO tool that advises on content freshness (checklist items 17, 165), having stale content in its own glossary and resources is contradictory."
  },
  {
    "bug_id": "R11-A-010",
    "severity": "MEDIUM",
    "category": "Taxonomy Gap",
    "component": "ActivityTimeline / Readability Tool",
    "file_line": "src/components/activity/ActivityTimeline.jsx:29",
    "description": "The ActivityTimeline component defines activity types for all portal tools (audit, accessibility, imagealt, meta, schema) but has no activity type for the Readability tool, which is defined in src/config/tools.js (id: 'readability'). The ACTIVITY_ICONS, ACTIVITY_COLORS, and ACTIVITY_CATEGORIES mappings all omit readability-related events. This means readability tool usage generates no trackable activity entries.",
    "steps": "1. Open the Activity Timeline page. 2. Use the Readability tool to analyze content. 3. Return to the Activity Timeline. 4. Observe that no readability activity is logged. 5. Check the ACTIVITY_CATEGORIES filter -- no 'Readability' category exists.",
    "expected": "The activity taxonomy should include activity types for all tools in the system, including 'readability.analyzed' or similar events in ACTIVITY_ICONS, ACTIVITY_COLORS, and ACTIVITY_CATEGORIES.",
    "actual": "The Readability tool has no activity type mappings. Activity from the readability tool is invisible in the activity timeline.",
    "impact": "Content strategists cannot track readability analysis activity across projects. Readability is a core content strategy concern, and its absence from the activity taxonomy creates an incomplete audit trail for content governance."
  },
  {
    "bug_id": "R11-A-011",
    "severity": "MEDIUM",
    "category": "Content Reuse",
    "component": "Resource Library / Category Alignment",
    "file_line": "src/data/resources.js:383",
    "description": "The resourceCategories array (line 383) defines categories including 'Content Strategy', 'Link Building', 'Local SEO', and 'Performance', but the actual resources data only contains entries in 4 of the 10 listed categories ('Technical SEO', 'On-Page Optimization', 'Keyword Research', 'Schema Markup', 'Mobile Optimization'). Five resource categories -- 'Content Strategy', 'Performance', 'Link Building', 'Local SEO' -- have zero resources. Furthermore, the resource categories don't align with the glossary categories or checklist categories, creating yet another disconnected taxonomy.",
    "steps": "1. Navigate to the Resource Library. 2. Filter by 'Content Strategy' category. 3. Observe zero results. 4. Filter by 'Link Building'. 5. Observe zero results. 6. Repeat for 'Performance' and 'Local SEO' -- all empty.",
    "expected": "Each defined category should contain at least one resource, or empty categories should not be shown in the filter. Additionally, resource categories should be aligned with the glossary and checklist taxonomies for cross-referencing.",
    "actual": "Five of ten resource categories contain zero resources. The resource taxonomy is disconnected from other content taxonomies in the system.",
    "impact": "Users selecting these empty categories see no results, which appears broken. The lack of cross-taxonomy alignment means content cannot be easily cross-referenced between the glossary, checklist, and resource library -- a missed content reuse opportunity."
  },
  {
    "bug_id": "R11-A-012",
    "severity": "LOW",
    "category": "Governance Gap",
    "component": "Checklist Data / Duplicate Items",
    "file_line": "src/data/checklistData.js:59",
    "description": "The checklist data contains overlapping/near-duplicate items with inconsistent metadata. For example, items 58 and 154 both address TTFB optimization but with different targets (600ms vs 800ms) and different categories ('Performance' for both, but different phrasing). Similarly, items 59 and 162 both cover resource hints (preconnect, dns-prefetch) with item 59 in 'Performance' and 162 also in 'Performance', but using different priority levels (HIGH vs MEDIUM). There is no governance mechanism to detect or prevent such overlaps.",
    "steps": "1. Search the checklist for 'TTFB' -- find items 58 and 154. 2. Search for 'resource hints' -- find items 59 and 162. 3. Search for 'crawl budget' -- find items 89 and 159 with similar scope. 4. Note no deduplication or cross-reference mechanism exists.",
    "expected": "A content governance process should prevent duplicate or contradictory checklist items. Where overlap exists, items should cross-reference each other or be consolidated.",
    "actual": "Multiple near-duplicate checklist items exist with inconsistent metadata, targets, and priority levels. No cross-referencing or deduplication system is in place.",
    "impact": "Users may complete one duplicate item thinking the topic is addressed, while missing the other version with different requirements. This creates false confidence in checklist completion and inconsistent guidance."
  },
  {
    "bug_id": "R11-A-013",
    "severity": "LOW",
    "category": "Editorial Workflow",
    "component": "ProjectCard / Completion Tracking",
    "file_line": "src/components/projects/ProjectCard.jsx:24",
    "description": "The ProjectCard component has a hardcoded completionPercentage of 0 with the comment '// Placeholder'. Every project card always displays 0% progress, even for completed projects. This is compounded by the ProgressDashboard (line 350) which uses hardcoded total: 321 and random values for completed items. These placeholder implementations mean the editorial workflow's progress tracking is non-functional at the project card level.",
    "steps": "1. Navigate to the Content Planner / Project Dashboard. 2. Observe that all project cards show 0% progress. 3. Open a project and complete several checklist items. 4. Return to the project dashboard. 5. Observe the progress bar still shows 0%.",
    "expected": "ProjectCard should fetch actual completion data from the checklist system and display real progress percentages.",
    "actual": "completionPercentage is hardcoded to 0, and the progress bar always shows 0% regardless of actual checklist completion status.",
    "impact": "Project managers cannot assess project status from the dashboard view, undermining the editorial workflow's ability to provide at-a-glance progress visibility. This forces users to open each project individually to check status."
  },
  {
    "bug_id": "R11-A-014",
    "severity": "LOW",
    "category": "Metadata Issue",
    "component": "Checklist Data / Missing Metadata",
    "file_line": "src/data/checklistData.js:2",
    "description": "Checklist items define metadata fields inconsistently. While all items include id, phase, priority, item, owner, category, projectTypes, effortLevel, and riskLevel, the custom item model (AddCustomItemModal) introduces additional fields like 'description', 'dueDate', and 'status' that are not present in the standard checklist data. Conversely, standard items have 'deliverableType' which is not available for custom items. This metadata model mismatch means standard and custom items cannot be uniformly queried or exported.",
    "steps": "1. Examine the fields in checklistData.js items (id, phase, priority, item, owner, category, projectTypes, effortLevel, riskLevel, deliverableType). 2. Examine the custom item fields in AddCustomItemModal.jsx (title, description, phase, priority, category, owner, dueDate). 3. Note that 'deliverableType', 'projectTypes', 'effortLevel', 'riskLevel' are missing from custom items. 4. Note that 'description', 'dueDate' are missing from standard items.",
    "expected": "Standard and custom checklist items should share a unified content model with consistent metadata fields, ensuring they can be uniformly filtered, exported, and reported on.",
    "actual": "Standard and custom items have different metadata schemas with non-overlapping fields, preventing unified content management.",
    "impact": "Exports and reports may produce inconsistent data when mixing standard and custom items. Filtering by deliverableType will exclude custom items, and filtering by dueDate will exclude standard items."
  },
  {
    "bug_id": "R11-A-015",
    "severity": "MEDIUM",
    "category": "Governance Gap",
    "component": "Glossary / Content Completeness",
    "file_line": "src/data/glossary.js:3",
    "description": "The glossary contains only 30 terms for an SEO content strategy portal that features 353 checklist items across 25 categories and includes specialized tools for accessibility (WCAG), readability, schema markup, and meta data generation. Critical domain terms used throughout the portal are missing from the glossary, including: 'WCAG' (central to the accessibility tool), 'Readability Score' (central to the readability tool), 'JSON-LD' (referenced in schema generator), 'INP' (Interaction to Next Paint, used in checklist items), 'CLS' (Cumulative Layout Shift), 'Rich Results', 'Structured Data', 'Content Clusters', 'Link Equity', 'Keyword Cannibalization' (has a term, but many of its referenced terms are missing). The glossary has no governance process for adding terms when new features are introduced.",
    "steps": "1. Open the Glossary page. 2. Search for 'WCAG' -- not found. 3. Search for 'Readability' -- not found. 4. Search for 'JSON-LD' -- not found. 5. Search for 'INP' -- not found. 6. Search for 'CLS' -- not found. 7. Compare the glossary's 30 terms against the 25 categories and 353 items in the checklist.",
    "expected": "The glossary should comprehensively cover terminology used across all portal tools and checklist items, with a governance process to expand the glossary when new features or categories are added.",
    "actual": "Only 30 terms exist, many core portal concepts are undefined, and no process ensures glossary completeness as the portal evolves.",
    "impact": "Users encountering unfamiliar terms in the checklist, audit results, or accessibility reports have no in-portal reference. This is especially problematic for less experienced team members who are the primary glossary audience."
  }
]
