[
  {
    "bug_id": "R05-200",
    "severity": "HIGH",
    "category": "Screen Reader",
    "component": "unifiedExportService",
    "file_line": "src/lib/unifiedExportService.js:16",
    "description": "Download helper creates anchor element without accessible name. The dynamically created <a> element used to trigger file downloads has no aria-label, textContent, or screen reader announcement. Screen reader users receive no feedback that a download has initiated.",
    "steps": "1. Use screen reader (NVDA/VoiceOver)\n2. Trigger any export (CSV, Excel, PDF, JSON, ZIP)\n3. Observe that dynamically appended anchor is briefly in DOM without accessible name",
    "expected": "Download anchor should have sr-only text or aria-label describing the file being downloaded, and a live region should announce the download.",
    "actual": "Anchor element is created with only href and download attributes -- no text content, no aria-label, no screen reader announcement.",
    "impact": "Screen reader users get no confirmation that a file download was triggered from any export action across the entire portal."
  },
  {
    "bug_id": "R05-201",
    "severity": "HIGH",
    "category": "Screen Reader",
    "component": "exportHubAdapter",
    "file_line": "src/lib/readability/exportHubAdapter.js:54",
    "description": "downloadBlob function creates inaccessible anchor element for triggering downloads. Identical to unifiedExportService -- dynamically injected <a> has no accessible text or live region announcement.",
    "steps": "1. Use screen reader\n2. Export a readability analysis batch as ZIP\n3. No announcement is made when the file starts downloading",
    "expected": "A polite aria-live region should announce 'Downloading [filename]' when export completes.",
    "actual": "Silent download -- anchor element has no accessible name and no ARIA live region announces the download.",
    "impact": "Screen reader users exporting readability analyses have no confirmation of successful download."
  },
  {
    "bug_id": "R05-202",
    "severity": "MEDIUM",
    "category": "Screen Reader",
    "component": "useNotifications",
    "file_line": "src/hooks/useNotifications.js:41",
    "description": "Notification count updates are not announced via ARIA live region. When new notifications arrive through Firestore realtime listener, the unreadCount state changes but there is no aria-live region mechanism provided by the hook to announce new notifications to screen reader users.",
    "steps": "1. Use screen reader\n2. Wait for a new notification to arrive in real-time\n3. Observe that unread count changes silently with no screen reader announcement",
    "expected": "Hook should provide a mechanism (e.g., return a live region announcement string) so consuming components can announce 'You have N new notifications'.",
    "actual": "unreadCount updates silently. No aria-live announcement mechanism is exposed by the hook.",
    "impact": "Screen reader users miss real-time notification arrivals and have no awareness of unread notification count changes."
  },
  {
    "bug_id": "R05-203",
    "severity": "HIGH",
    "category": "Semantic HTML",
    "component": "index.css",
    "file_line": "src/index.css:408",
    "description": "Tab component CSS class (.tabs, .tab, .tab-active) defines visual tab styling without requiring corresponding ARIA roles. The CSS-only approach allows developers to apply tab styling to any element (e.g., div, span) without enforcing role='tablist', role='tab', and aria-selected attributes. No documentation or enforcement exists to pair these CSS classes with proper ARIA semantics.",
    "steps": "1. Inspect any page using .tabs/.tab CSS classes\n2. Check for role='tablist' on container and role='tab' on children\n3. Check for aria-selected on active tab\n4. Check for keyboard arrow key navigation between tabs",
    "expected": "Tab containers should have role='tablist', each tab should have role='tab' and aria-selected, and tab panels should have role='tabpanel' with aria-labelledby.",
    "actual": "CSS classes provide only visual styling. There is no enforcement or co-located guidance requiring ARIA tab roles, and no keyboard navigation pattern is implemented in CSS.",
    "impact": "Screen reader users cannot identify tab interfaces as navigable tab widgets. Tab panels are not announced as connected to their respective tabs."
  },
  {
    "bug_id": "R05-204",
    "severity": "HIGH",
    "category": "ARIA Missing",
    "component": "index.css",
    "file_line": "src/index.css:305",
    "description": "Dropdown menu CSS classes (.dropdown-menu, .dropdown-item) define dropdown styling without requiring role='menu', role='menuitem', or aria-expanded on trigger elements. The CSS-only definition allows dropdown patterns to be built without proper ARIA menu semantics.",
    "steps": "1. Use screen reader to navigate to any dropdown in the portal\n2. Check if the trigger button has aria-expanded and aria-haspopup\n3. Check if the dropdown container has role='menu'\n4. Check if items have role='menuitem'",
    "expected": "Dropdown triggers should have aria-expanded and aria-haspopup='menu'. Dropdown container should have role='menu'. Items should have role='menuitem'.",
    "actual": "CSS framework provides visual dropdown styling only. No ARIA attributes are enforced or documented for the dropdown pattern.",
    "impact": "Screen readers cannot identify dropdown menus, announce expansion state, or navigate menu items. Users relying on assistive technology cannot use dropdown navigation."
  },
  {
    "bug_id": "R05-205",
    "severity": "HIGH",
    "category": "Focus Trap",
    "component": "index.css",
    "file_line": "src/index.css:328",
    "description": "Modal CSS classes (.modal-backdrop, .modal, .modal-header, .modal-body, .modal-footer) define modal styling without any focus trapping mechanism. The CSS defines z-index and backdrop but provides no focus management, no role='dialog', no aria-modal='true', and no mechanism to trap focus within the modal or return focus to the trigger on close.",
    "steps": "1. Open any modal in the portal\n2. Press Tab repeatedly\n3. Observe that focus escapes behind the modal backdrop to page content\n4. Check for role='dialog' and aria-modal='true'",
    "expected": "Modals should have role='dialog', aria-modal='true', aria-labelledby pointing to the modal title, focus should be trapped within the modal, and focus should return to trigger on close.",
    "actual": "CSS provides only visual modal styling. No focus trap, no ARIA dialog role, no focus return mechanism exists in the design system.",
    "impact": "Keyboard and screen reader users can navigate behind the modal, losing context. There is no way to identify the modal as a dialog or to close it with Escape key."
  },
  {
    "bug_id": "R05-206",
    "severity": "MEDIUM",
    "category": "Keyboard Nav Gap",
    "component": "index.css",
    "file_line": "src/index.css:174",
    "description": "Icon button class (.btn-icon) uses only padding and hover styling but lacks visible focus indicator. While the base .btn class includes focus-visible ring styles, .btn-icon is defined separately without @apply focus-visible:ring-2 or any focus styling, meaning icon-only buttons may lack visible focus indicators.",
    "steps": "1. Tab to an icon-only button (e.g., close button, action icon)\n2. Observe whether a visible focus ring appears\n3. Compare with regular .btn focus styling",
    "expected": "Icon buttons should have the same focus-visible ring styling as other button variants for keyboard navigability.",
    "actual": ".btn-icon class only applies p-2.5, rounded-xl, hover:bg-charcoal-100, and transition-colors. No focus-visible styles are defined.",
    "impact": "Keyboard users cannot see which icon button is currently focused, making navigation difficult."
  },
  {
    "bug_id": "R05-207",
    "severity": "MEDIUM",
    "category": "ARIA Missing",
    "component": "index.css",
    "file_line": "src/index.css:231",
    "description": "Search input class (.input-search) adds left padding for a search icon but provides no guidance for including an accessible label or role='search'. The pl-11 padding implies a visual search icon is positioned inside, but there is no requirement for an associated aria-label or landmark.",
    "steps": "1. Navigate to search input with screen reader\n2. Check if input has aria-label='Search' or is wrapped in role='search'\n3. Check if the visual search icon has aria-hidden='true'",
    "expected": "Search inputs should have role='search' on a containing element or form, and the input should have an explicit aria-label. The decorative icon should have aria-hidden='true'.",
    "actual": "CSS only provides visual padding for icon placement. No ARIA search role or label enforcement exists.",
    "impact": "Screen reader users cannot identify search inputs as search controls, and decorative icons may be announced unnecessarily."
  },
  {
    "bug_id": "R05-208",
    "severity": "MEDIUM",
    "category": "Color Contrast",
    "component": "index.css",
    "file_line": "src/index.css:216",
    "description": "Placeholder text color (#94a3b8 equivalent from text-charcoal-400) on white background may fail WCAG 2.2 AA contrast requirements. The .input class uses placeholder:text-charcoal-400 which maps to approximately #94a3b8 on a white (#ffffff) background, yielding a contrast ratio of approximately 3.0:1, below the 4.5:1 AA minimum for normal text.",
    "steps": "1. Navigate to any form input with placeholder text\n2. Measure contrast ratio between placeholder color and background\n3. Use browser devtools accessibility audit or contrast checker",
    "expected": "Placeholder text should meet at least 4.5:1 contrast ratio against the background, or 3:1 for large text per WCAG 2.2 SC 1.4.3.",
    "actual": "Placeholder color charcoal-400 (#94a3b8 approx) on white background yields approximately 3.0:1 contrast ratio.",
    "impact": "Users with low vision may not be able to read placeholder hint text in form inputs."
  },
  {
    "bug_id": "R05-209",
    "severity": "MEDIUM",
    "category": "Color Contrast",
    "component": "useDueDates",
    "file_line": "src/hooks/useDueDates.js:184",
    "description": "getDueDateUrgency function returns color-only status indicators ('red', 'amber', 'orange', 'yellow', 'blue', 'charcoal') without any text-based alternative for distinguishing urgency. Components consuming this hook may render urgency using color alone without a text label accessible to color-blind users.",
    "steps": "1. View due dates list\n2. Observe urgency indicators\n3. Turn on grayscale mode or simulate color blindness\n4. Try to distinguish between 'amber', 'orange', and 'yellow' urgency levels",
    "expected": "Urgency should be conveyed through text labels (already present as 'label' field), icons, or patterns in addition to color. The hook should document that color alone is insufficient.",
    "actual": "The hook returns a 'color' field that consuming components may use as the sole urgency indicator. While 'label' is also returned, there is no enforcement that it gets displayed.",
    "impact": "Color-blind users may not be able to distinguish urgency levels if consuming components rely solely on the color field per WCAG SC 1.4.1 Use of Color."
  },
  {
    "bug_id": "R05-210",
    "severity": "HIGH",
    "category": "Screen Reader",
    "component": "excelExport",
    "file_line": "src/lib/excelExport.js:163",
    "description": "Excel export download creates inaccessible anchor element without live region announcement. The dynamically created link element lacks accessible text and no aria-live region notifies assistive technology users that a download has started.",
    "steps": "1. Use screen reader\n2. Click 'Export to Excel' on any checklist page\n3. Observe no screen reader announcement of download starting",
    "expected": "An aria-live polite region should announce 'Downloading SEO_Checklist_[name].xlsx' when the export completes.",
    "actual": "A link element is silently appended, clicked, and removed from DOM with no accessible announcement.",
    "impact": "Screen reader users receive no feedback that Excel export completed and file is downloading."
  },
  {
    "bug_id": "R05-211",
    "severity": "MEDIUM",
    "category": "Form A11y",
    "component": "useFileAttachments",
    "file_line": "src/hooks/useFileAttachments.js:96",
    "description": "File upload progress (uploadProgress state 0-100) has no mechanism for live region announcement. During file upload, the progress percentage updates from 0 to 100 but the hook provides no aria-live announcement mechanism. Consuming components would need to implement their own live region to announce upload progress to screen reader users.",
    "steps": "1. Use screen reader\n2. Upload a file attachment\n3. Listen for progress announcements during upload\n4. Note silence until toast.success fires at completion",
    "expected": "Upload progress should be announced periodically (e.g., at 25%, 50%, 75%, 100%) via an aria-live region, or the hook should provide an announcement callback.",
    "actual": "uploadProgress state changes silently. Only the final toast.success provides feedback, and toast may not be in an aria-live region.",
    "impact": "Screen reader users have no awareness of file upload progress and may think the action failed during long uploads."
  },
  {
    "bug_id": "R05-212",
    "severity": "MEDIUM",
    "category": "Screen Reader",
    "component": "useReadabilityAnalysis",
    "file_line": "src/hooks/useReadabilityAnalysis.js:263",
    "description": "Analysis progress callback (handleProgress) updates state with stage and message but provides no aria-live announcement mechanism. The multi-step analysis pipeline (fetching, extracting, analyzing, scoring) reports progress through state updates only, with no way for consuming components to know they should announce these transitions via live regions.",
    "steps": "1. Use screen reader\n2. Start a readability analysis\n3. Listen for stage transition announcements (fetching -> extracting -> analyzing -> scoring -> complete)\n4. Observe silence between the initial action and the final toast",
    "expected": "Progress stage transitions should be announced via aria-live region. The hook should either manage a live region ref or provide explicit announcement strings.",
    "actual": "Progress updates only set React state. No live region announcement mechanism is provided by the hook.",
    "impact": "Screen reader users waiting for a multi-step analysis (which can take 30+ seconds) have no feedback about pipeline progress."
  },
  {
    "bug_id": "R05-213",
    "severity": "LOW",
    "category": "Semantic HTML",
    "component": "index.css",
    "file_line": "src/index.css:292",
    "description": "Navigation link classes (.nav-link, .nav-link-active) do not enforce a <nav> landmark wrapper or aria-current='page' on the active link. While the CSS provides visual active state styling, screen reader users depend on aria-current='page' to identify the current page in navigation, and <nav> landmarks for navigation identification.",
    "steps": "1. Use screen reader to locate navigation landmarks\n2. Check if <nav> element wraps navigation links\n3. Check if active navigation link has aria-current='page'",
    "expected": "Navigation should be wrapped in <nav> with an aria-label, and the active link should have aria-current='page'.",
    "actual": "CSS classes provide visual styling only with no semantic enforcement for navigation landmarks or aria-current.",
    "impact": "Screen reader users cannot identify navigation landmarks or determine which page is currently active."
  },
  {
    "bug_id": "R05-214",
    "severity": "MEDIUM",
    "category": "Screen Reader",
    "component": "pdfGenerator",
    "file_line": "src/lib/pdfGenerator.js:299",
    "description": "previewPDF opens a new browser window with window.open but provides no accessible name for the new window/tab. The URL.createObjectURL blob URL gives no meaningful title. Additionally, the setTimeout to revoke the URL after 100ms may revoke it before the PDF loads in slow connections, causing the preview to fail silently.",
    "steps": "1. Use screen reader\n2. Click 'Preview PDF'\n3. Observe new window/tab opens with blob URL as title\n4. Screen reader announces unhelpful window title like 'blob:http://...'",
    "expected": "The new window should have a meaningful title, or an aria-live announcement should state 'PDF preview opened in new tab'. The blob URL revocation should be handled more safely.",
    "actual": "window.open(url, '_blank') creates a window with an opaque blob URL as the only identifier. No accessible announcement is made.",
    "impact": "Screen reader users cannot identify what opened in the new tab and may be confused by the blob URL title."
  }
]
