[
  {
    "bug_id": "R08-A-001",
    "severity": "HIGH",
    "category": "Data Integrity",
    "component": "ExportHubPage",
    "file_line": "src/components/export/ExportHubPage.jsx:243",
    "description": "Project export uses an empty mockItems array, causing all project exports to contain zero checklist items regardless of actual project data.",
    "steps": "1. Navigate to the Export Hub page. 2. Select a project from the list. 3. Click export for the selected project. 4. Observe the exported file contents.",
    "expected": "The exported file should contain the actual checklist items and their completion status for the selected project.",
    "actual": "The export produces a file with an empty items array because mockItems is hardcoded as an empty array on line 243 with a comment 'This would be actual checklist items'.",
    "impact": "All project-level exports are functionally broken, producing empty data files that provide no value to stakeholders or clients expecting progress reports."
  },
  {
    "bug_id": "R08-A-002",
    "severity": "HIGH",
    "category": "Permission Issue",
    "component": "TimeTracker",
    "file_line": "src/components/checklist/TimeTracker.jsx:267",
    "description": "Time entry deletion has no ownership or permission check. Any user who can view the item detail modal can delete any other user's time entries.",
    "steps": "1. User A logs a time entry on a checklist item. 2. User B opens the same checklist item and navigates to the Time tab. 3. User B clicks the delete button on User A's time entry.",
    "expected": "Only the time entry owner or a project manager/admin should be able to delete time entries. Other users should see the delete button disabled or hidden.",
    "actual": "The deleteEntry function is called directly without any user ownership verification or role-based permission check, allowing any viewer to delete any entry.",
    "impact": "Time tracking data integrity is compromised as any team member can remove others' logged time, leading to inaccurate project billing and resource tracking."
  },
  {
    "bug_id": "R08-A-003",
    "severity": "HIGH",
    "category": "Permission Issue",
    "component": "FileUpload",
    "file_line": "src/components/checklist/FileUpload.jsx:61-69",
    "description": "File deletion lacks any permission or ownership check. Any authenticated user who can view the item can delete any file attachment, regardless of who uploaded it.",
    "steps": "1. User A uploads a file attachment to a checklist item. 2. User B (e.g., a viewer or client role) opens the same item. 3. User B clicks the delete icon on User A's uploaded file and confirms deletion.",
    "expected": "File deletion should be restricted to the file uploader, project managers, or administrators. Client-role users should not be able to delete files.",
    "actual": "The handleDelete and confirmDelete functions execute without any ownership or role verification, allowing any authenticated user to delete any attachment.",
    "impact": "Critical project assets and deliverables can be accidentally or maliciously deleted by unauthorized team members, with no audit trail to identify who performed the deletion."
  },
  {
    "bug_id": "R08-A-004",
    "severity": "HIGH",
    "category": "Data Integrity",
    "component": "ItemDetailModal",
    "file_line": "src/components/checklist/ItemDetailModal.jsx:262-271",
    "description": "Task assignment uses free-text comma-separated input for user identifiers with no validation against actual team members in the system.",
    "steps": "1. Open any checklist item detail modal. 2. Navigate to the Details tab. 3. In the 'Assigned To' field, type arbitrary text such as 'nonexistent@fake.com, random text'. 4. Click Assign.",
    "expected": "The assignment field should validate user identifiers against registered team members, providing an autocomplete dropdown or user picker that only allows selection of valid users.",
    "actual": "The input accepts any free-text string and splits it by commas to create assignments. There is no validation that the entered values correspond to actual users in the system.",
    "impact": "Invalid assignments create orphaned tasks that no real user can see in their My Tasks view, causing items to appear assigned but never acted upon, creating workflow dead-ends."
  },
  {
    "bug_id": "R08-A-005",
    "severity": "MEDIUM",
    "category": "Missing Feature",
    "component": "TimeTracker",
    "file_line": "src/components/checklist/TimeTracker.jsx:237-278",
    "description": "Time entries cannot be edited after creation. The component only supports Create and Delete operations for time entries, missing the Update operation from CRUD.",
    "steps": "1. Start a timer or add a manual time entry on a checklist item. 2. After the entry is created, attempt to modify the duration or notes. 3. Observe there is no edit capability.",
    "expected": "Each time entry should have an edit button allowing users to correct the duration, update notes, or adjust the timestamp if an error was made.",
    "actual": "The time entries list only provides a delete button. There is no edit/update functionality, forcing users to delete and recreate entries to make corrections.",
    "impact": "Users who make mistakes in time entries must delete and recreate them, losing the original timestamp and creating gaps in the audit trail of time tracking changes."
  },
  {
    "bug_id": "R08-A-006",
    "severity": "HIGH",
    "category": "Audit Trail",
    "component": "AuditLogViewer",
    "file_line": "src/components/admin/AuditLogViewer.jsx:94-111",
    "description": "The Audit Log Viewer has a TODO placeholder that returns empty logs. No actual audit logging is implemented, making the entire compliance tracking feature non-functional.",
    "steps": "1. Navigate to the Admin section and open the Audit Log Viewer. 2. Perform various actions across the platform (create projects, upload files, change roles). 3. Return to the Audit Log Viewer and observe the log entries.",
    "expected": "The audit log should display timestamped entries for all significant user actions including CRUD operations, exports, role changes, and login/logout events.",
    "actual": "The fetchLogs function on line 98 has a TODO comment and always sets logs to an empty array. No audit events are ever recorded or displayed regardless of user activity.",
    "impact": "The platform has no compliance audit trail whatsoever. All user actions are untracked, making it impossible to investigate security incidents, demonstrate regulatory compliance, or review change history."
  },
  {
    "bug_id": "R08-A-007",
    "severity": "MEDIUM",
    "category": "Audit Trail",
    "component": "FileUpload",
    "file_line": "src/components/checklist/FileUpload.jsx:28-34",
    "description": "File upload and deletion operations are not logged to any audit trail. There is no record of who uploaded or deleted files, or when these actions occurred.",
    "steps": "1. Upload a file to a checklist item. 2. Delete a different file from the same item. 3. Check the Activity tab or any audit log for records of these file operations.",
    "expected": "File upload and deletion events should be recorded in the activity log or audit trail with timestamps, user identity, file name, and action type.",
    "actual": "The onDrop and confirmDelete functions perform their operations without emitting any activity or audit log events. The uploadedByName field exists on attachments but no corresponding activity entry is created.",
    "impact": "There is no accountability for file management actions. If files are deleted or inappropriate files are uploaded, there is no way to identify who performed the action or when it occurred."
  },
  {
    "bug_id": "R08-A-008",
    "severity": "MEDIUM",
    "category": "Risk",
    "component": "AuditDashboard",
    "file_line": "src/components/audit/dashboard/AuditDashboard.jsx:254-273",
    "description": "Shared audit links have no expiration mechanism or revocation capability. Once a share link is created, it remains accessible indefinitely with no way to revoke access.",
    "steps": "1. Run a technical SEO audit. 2. Click the Share button to generate a share link. 3. Optionally set a password. 4. Copy and distribute the link. 5. Attempt to revoke access or set an expiry date.",
    "expected": "Share links should have configurable expiration dates and a mechanism to revoke access. Expired links should return a 'link expired' message.",
    "actual": "The share modal creates persistent links with optional password protection but no expiration date field and no revocation mechanism. Links remain active indefinitely.",
    "impact": "Confidential SEO audit data may remain accessible to external parties long after the intended sharing period, creating data security and confidentiality risks for client information."
  },
  {
    "bug_id": "R08-A-009",
    "severity": "MEDIUM",
    "category": "Workflow Gap",
    "component": "ProjectCreationWizard",
    "file_line": "src/components/projects/ProjectCreationWizard.jsx:122-123",
    "description": "The project creation wizard does not validate that the target launch date is after the start date. Users can create projects where the deadline precedes the start date.",
    "steps": "1. Navigate to Create New Project. 2. In Step 2 (Timeline), set the start date to 2026-06-01. 3. Set the target launch date to 2026-01-01 (before the start date). 4. Proceed through the wizard and create the project.",
    "expected": "The wizard should validate that targetLaunchDate is after startDate and display an error message if the dates are logically inconsistent.",
    "actual": "The validateStep function for step 2 only checks that both dates are non-empty. It does not compare them to ensure targetLaunchDate > startDate, allowing logically invalid timelines.",
    "impact": "Projects with impossible timelines will show incorrect progress metrics, negative days-remaining counts, and immediately appear as 'overdue' in the Progress Dashboard."
  },
  {
    "bug_id": "R08-A-010",
    "severity": "MEDIUM",
    "category": "Data Integrity",
    "component": "ProgressDashboard",
    "file_line": "src/components/projects/ProgressDashboard.jsx:346-358",
    "description": "The Progress Dashboard uses randomized mock data for project statistics when real stats are not available, displaying fabricated completion percentages and critical item counts.",
    "steps": "1. Create a new project with no checklist progress. 2. Navigate to the Progress Dashboard. 3. Observe the completion percentage and critical item counts for the project.",
    "expected": "Projects without stats data should show zero progress, zero completed items, and zero critical items, or fetch real statistics from the checklist completion state.",
    "actual": "When project.stats is undefined, the code generates random values using Math.random() for completed items, percentage, and critical counts, displaying fabricated data to users.",
    "impact": "Project managers and stakeholders see misleading progress data that does not reflect actual project status, potentially leading to incorrect resource allocation and scheduling decisions."
  },
  {
    "bug_id": "R08-A-011",
    "severity": "MEDIUM",
    "category": "Scope Gap",
    "component": "ExportHubPage",
    "file_line": "src/components/export/ExportHubPage.jsx:321",
    "description": "The project selection dropdown in the Export Hub only shows the first 6 projects, with no pagination or search, preventing users from exporting data for projects beyond position 6.",
    "steps": "1. Create more than 6 projects in the Content Planner. 2. Navigate to the Export Hub. 3. Open the project selector dropdown. 4. Attempt to find projects that were created 7th or later.",
    "expected": "All projects should be accessible in the project selector, either through scrollable list, search/filter, or pagination.",
    "actual": "The project list is truncated using projects.slice(0, 6), making projects beyond the first 6 completely inaccessible for export operations.",
    "impact": "Organizations with more than 6 projects cannot export data for their newer projects, creating an artificial limitation that prevents comprehensive reporting across the full project portfolio."
  },
  {
    "bug_id": "R08-A-012",
    "severity": "HIGH",
    "category": "Workflow Gap",
    "component": "BatchAuditPanel",
    "file_line": "src/components/audit/BatchAuditPanel.jsx:313-315",
    "description": "The batch audit pause mechanism does not actually stop the running audit loop because the isRunning state check on line 315 captures the stale closure value.",
    "steps": "1. Add 10+ URLs to the batch audit panel. 2. Start the batch audit. 3. While audits are running, click the Pause button. 4. Observe whether processing actually stops.",
    "expected": "Clicking Pause should immediately stop processing the next URL in the queue after the current one finishes.",
    "actual": "The for loop on line 313 checks 'if (!isRunning) break;' but isRunning is captured in the closure at the time runBatchAudit was called. Setting isRunning to false via pauseAudit will not break the loop because the loop references the stale closure value.",
    "impact": "Users cannot effectively pause a long-running batch audit, potentially overwhelming target servers or consuming unnecessary resources when a pause is needed."
  },
  {
    "bug_id": "R08-A-013",
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "component": "AuditDashboard",
    "file_line": "src/components/audit/dashboard/AuditDashboard.jsx:235",
    "description": "Saved audits cannot be updated or deleted. The save function checks if savedAuditId exists and returns early with a toast message, preventing any modifications to previously saved audit results.",
    "steps": "1. Run an SEO audit and view results. 2. Click Save to persist the audit. 3. Attempt to re-save after making notes or changes. 4. Attempt to delete the saved audit.",
    "expected": "Users should be able to update saved audits (e.g., add notes, re-run and update scores) and delete audits they no longer need.",
    "actual": "The save button becomes non-functional after first save, displaying 'Audit already saved'. There is no update or delete functionality for saved audits.",
    "impact": "Saved audits become immutable artifacts with no lifecycle management. Users cannot correct errors, update results, or clean up outdated audits, leading to data clutter."
  },
  {
    "bug_id": "R08-A-014",
    "severity": "MEDIUM",
    "category": "Permission Issue",
    "component": "TeamManagementPage",
    "file_line": "src/components/projects/TeamManagementPage.jsx:36-51",
    "description": "Project Managers can change any user's role to Administrator, effectively escalating privileges beyond their own level. There is no restriction preventing PMs from assigning the admin role.",
    "steps": "1. Log in as a user with the Project Manager role. 2. Navigate to Team Management. 3. Click Edit Role on any team member. 4. Select 'Administrator' from the dropdown. 5. The role change succeeds.",
    "expected": "Project Managers should only be able to assign roles at or below their own permission level. Only Administrators should be able to promote users to Administrator.",
    "actual": "The handleUpdateRole function directly updates the Firestore user document with the selected role value without checking whether the current user has the authority to assign that role level.",
    "impact": "Any Project Manager can escalate their own or others' privileges to Administrator, bypassing the intended role hierarchy and potentially gaining access to system-wide administrative functions."
  },
  {
    "bug_id": "R08-A-015",
    "severity": "LOW",
    "category": "Audit Trail",
    "component": "TeamManagementPage",
    "file_line": "src/components/projects/TeamManagementPage.jsx:36-51",
    "description": "Role changes are not logged to any audit trail. When a user's role is updated, no record is created documenting who made the change, what the previous role was, or when it occurred.",
    "steps": "1. As an admin or PM, navigate to Team Management. 2. Change a team member's role from SEO Specialist to Project Manager. 3. Check for any log or history of this change.",
    "expected": "Role changes should be logged with the modifier's identity, the target user, the old role, the new role, and a timestamp, visible in the audit log.",
    "actual": "The handleUpdateRole function only updates the Firestore document and shows a toast notification. No audit log entry is created for the role change.",
    "impact": "There is no accountability or traceability for permission changes, making it impossible to investigate unauthorized role escalations or review the history of access control decisions."
  },
  {
    "bug_id": "R08-A-016",
    "severity": "MEDIUM",
    "category": "Scope Gap",
    "component": "AuditHistoryPanel",
    "file_line": "src/components/audit/AuditHistoryPanel.jsx:325",
    "description": "The audit history list is limited to showing only 10 audits with no pagination or 'load more' capability, preventing access to older audit history.",
    "steps": "1. Run more than 10 audits for the same domain over time. 2. Navigate to the Audit History panel. 3. Attempt to view audits older than the 10 most recent.",
    "expected": "The audit history should support pagination, infinite scroll, or a 'load more' button to access the complete audit history beyond the initial 10 entries.",
    "actual": "The list uses filteredAudits.slice(0, 10) on line 325, permanently capping the visible history at 10 entries with no way to access older records.",
    "impact": "Long-term trend analysis and historical comparison are limited to the 10 most recent audits. Users tracking SEO improvements over months or years cannot access their full audit history."
  }
]
