[
  {
    "bug_id": "R04-001",
    "severity": "HIGH",
    "category": "Taxonomy Issue",
    "component": "App (Route Structure)",
    "file_line": "src/App.jsx:282",
    "description": "Shared audit view route (/audit/shared/:shareId) breaks the /app prefix convention used by all other authenticated-context routes. It sits outside both the /app/* and public route namespaces, creating an inconsistent URL taxonomy.",
    "steps": "1. Review route definitions in App.jsx\n2. Compare /audit/shared/:shareId (line 282) with /shared/readability/:shareToken (line 370)\n3. Observe that two different URL patterns are used for the same concept (shared public views)",
    "expected": "All public share routes should use a consistent namespace, e.g., /shared/audit/:shareId and /shared/readability/:shareToken",
    "actual": "/audit/shared/:shareId uses a different pattern than /shared/readability/:shareToken -- one nests under the tool path, the other uses a /shared top-level prefix",
    "impact": "Users and developers cannot predict shared-link URL structures; inconsistent taxonomy makes navigation and link-sharing confusing"
  },
  {
    "bug_id": "R04-002",
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "component": "App (Route Structure)",
    "file_line": "src/App.jsx:186",
    "description": "The public /accessibility route maps to AccessibilityStatement (legal page), while the authenticated /app/accessibility route maps to the Accessibility Audit tool. The identical path segment 'accessibility' is used for completely different content types (legal vs. tool), creating a naming collision.",
    "steps": "1. Visit /accessibility as a logged-out user -- see AccessibilityStatement legal page\n2. Log in and visit /app/accessibility -- see the Accessibility Audit tool\n3. Observe that 'accessibility' means two different things depending on auth state",
    "expected": "Legal page should use a distinct route like /accessibility-statement or /legal/accessibility to avoid semantic collision with the tool route",
    "actual": "Both routes use 'accessibility' as the path segment for completely unrelated content types",
    "impact": "Users searching for the accessibility audit tool may land on the legal statement and vice versa; search and bookmarks become unreliable"
  },
  {
    "bug_id": "R04-003",
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "component": "App (Route Structure)",
    "file_line": "src/App.jsx:229",
    "description": "Route /app/planner/projects/:projectId renders SEOChecklist component, but the toolName in the error boundary is 'Content Checklist'. The route path says 'planner/projects', the component name says 'SEOChecklist', and the error label says 'Content Checklist' -- three different labels for the same thing.",
    "steps": "1. Navigate to /app/planner/projects/123\n2. Trigger an error to see ToolErrorBoundary\n3. Observe the error boundary calls this 'Content Checklist'\n4. Check the component name (SEOChecklist) and URL path (planner/projects)",
    "expected": "Consistent naming across route path, component name, and UI-facing labels",
    "actual": "Three different naming conventions: URL says 'planner/projects', component says 'SEOChecklist', error boundary says 'Content Checklist'",
    "impact": "Users cannot correlate error messages with the tool they were using; internal developers face naming confusion"
  },
  {
    "bug_id": "R04-004",
    "severity": "HIGH",
    "category": "Cognitive Overload",
    "component": "VPATReportGenerator",
    "file_line": "src/components/accessibility/VPATReportGenerator.jsx:101",
    "description": "The VPAT Report Generator renders all 55+ WCAG criteria in a single scrollable list with all 4 principle sections expanded by default (line 101). Each criterion has a conformance dropdown and a remarks textarea, creating 110+ interactive form elements visible simultaneously with no progressive disclosure or pagination.",
    "steps": "1. Open VPATReportGenerator\n2. Observe that all 4 principle groups (Perceivable, Operable, Understandable, Robust) are expanded\n3. Count the visible form fields -- 55+ select dropdowns plus 55+ text areas",
    "expected": "Progressive disclosure with one principle section open at a time, or a wizard-style flow that presents criteria in manageable groups of 5-10",
    "actual": "All principle sections are expanded by default (expandedPrinciples initialized to all 4 principles), exposing 110+ form elements at once",
    "impact": "Overwhelming cognitive load causes users to abandon VPAT evaluation or rush through without thoughtful assessment"
  },
  {
    "bug_id": "R04-005",
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "component": "VPATReportGenerator",
    "file_line": "src/components/accessibility/VPATReportGenerator.jsx:288",
    "description": "The header subtitle says 'WCAG 2.1' but the criteria list includes WCAG 2.2 criteria (lines 86-95), and the export PDF title says 'WCAG 2.2 Conformance Report' (line 179). Mixed version labeling within the same component.",
    "steps": "1. Open VPATReportGenerator\n2. See header subtitle: 'Voluntary Product Accessibility Template (WCAG 2.1)'\n3. Scroll down to see WCAG 2.2 criteria (e.g., 2.4.11 Focus Not Obscured)\n4. Export PDF and see title: 'WCAG 2.2 Conformance Report'",
    "expected": "Consistent WCAG version labeling throughout the component -- either 2.1 or 2.2",
    "actual": "Header says WCAG 2.1, export says WCAG 2.2, criteria include both 2.1 and 2.2 items",
    "impact": "Users may provide an inaccurate VPAT to procurement teams, leading to compliance confusion"
  },
  {
    "bug_id": "R04-006",
    "severity": "MEDIUM",
    "category": "Content Grouping",
    "component": "AccessibilityDashboard",
    "file_line": "src/components/accessibility/dashboard/AccessibilityDashboard.jsx:262",
    "description": "Dashboard tab labels use inconsistent content-type terminology. The tabs are: 'Overview', 'Violations', 'Pages', and 'WCAG Reference'. 'WCAG Reference' is an informational/educational resource mixed in with audit result views, breaking the expected grouping of audit-specific data tabs.",
    "steps": "1. Complete an accessibility audit\n2. View the dashboard tabs: Overview, Violations, Pages, WCAG Reference\n3. Click WCAG Reference -- it shows a static reference table, not audit results\n4. Compare with other tabs which show dynamic audit data",
    "expected": "WCAG Reference should be separated from audit result tabs (e.g., as a sidebar link or help panel), or relabeled to 'WCAG Compliance Map' to indicate it shows audit data mapped to criteria",
    "actual": "Static educational reference content is mixed in as a peer tab alongside dynamic audit result tabs",
    "impact": "Users expecting audit-specific data in every tab are confused by the static reference content; it dilutes the task-focused audit workflow"
  },
  {
    "bug_id": "R04-007",
    "severity": "MEDIUM",
    "category": "Navigation Gap",
    "component": "ActivityPage",
    "file_line": "src/components/activity/ActivityPage.jsx:14",
    "description": "The 'Back to Dashboard' link on ActivityPage navigates to '/' (root path) instead of '/app' (the authenticated dashboard). For logged-in users, '/' redirects to '/app' via SmartHome, but this creates an unnecessary redirect hop and breaks the /app namespace convention.",
    "steps": "1. Log in and navigate to /app/activity\n2. Click 'Back to Dashboard' link\n3. Observe the browser navigates to '/' then redirects to '/app'",
    "expected": "Back link should navigate directly to '/app' (the authenticated dashboard) without redirect",
    "actual": "Link points to '/' which triggers SmartHome redirect logic to eventually reach '/app'",
    "impact": "Unnecessary page load/redirect; violates the /app namespace convention for authenticated routes; may cause brief flash of landing page"
  },
  {
    "bug_id": "R04-008",
    "severity": "HIGH",
    "category": "Cognitive Overload",
    "component": "HomePage",
    "file_line": "src/components/home/HomePage.jsx:188",
    "description": "The HomePage presents 8 quick action buttons (line 188), 4 stat cards, a full tools grid section with 7+ cards, recent projects list, recent audits list, favorites widget, activity widget, recommendations section, and a tips section -- all on a single page with no progressive disclosure. Users face 9 distinct content sections simultaneously.",
    "steps": "1. Log in and land on /app (HomePage)\n2. Count the distinct content sections visible: stats, quick actions, tools grid, recent projects, recent audits, favorites, activity, recommendations, tips\n3. Measure page scroll length",
    "expected": "Dashboard should prioritize 2-3 key sections with clear visual hierarchy; secondary content should be collapsible or on sub-pages",
    "actual": "9 distinct content sections are rendered sequentially in a single-scroll page with no collapsibility",
    "impact": "Users experience decision paralysis and cannot quickly identify the most relevant next action; cognitive overload on every visit"
  },
  {
    "bug_id": "R04-009",
    "severity": "MEDIUM",
    "category": "IA Problem",
    "component": "HomePage",
    "file_line": "src/components/home/HomePage.jsx:188",
    "description": "Quick Actions section duplicates the Content Tools grid section below it. Both sections provide navigation to the same set of tools (planner, audit, accessibility, image-alt, meta-generator, schema-generator, readability). Quick Actions adds Export as the 8th item, but otherwise links to the same destinations as the ToolCard grid.",
    "steps": "1. Log in and view /app\n2. Observe the Quick Actions section with 8 icon buttons\n3. Scroll down to the Content Tools section\n4. Compare: both sections link to the same tools",
    "expected": "Either Quick Actions OR Tools grid, not both. Quick Actions could link to specific sub-actions (e.g., 'New Audit' not just 'Run Audit'), while the tool grid provides overview cards.",
    "actual": "Two navigation sections on the same page point to the same destinations, creating redundancy and cognitive overhead",
    "impact": "Users are unsure which navigation to use; page feels cluttered and repetitive"
  },
  {
    "bug_id": "R04-010",
    "severity": "LOW",
    "category": "Taxonomy Issue",
    "component": "ActivityTimeline",
    "file_line": "src/components/activity/ActivityTimeline.jsx:83",
    "description": "The activity filter categories use inconsistent granularity. 'Tools' groups 6 different tool types together (audit, accessibility, imagealt, meta, schema), while 'Checklist' and 'Files' are separate categories with only 2 types each. The 'Readability' tool activity type is entirely missing from any filter category.",
    "steps": "1. Navigate to /app/activity\n2. Click through filter buttons: All Activity, Projects, Checklist, Tools, Collaboration, Files\n3. Observe 'Tools' groups 6 types while others have 2-3\n4. Check that readability tool activities would not appear under any specific filter",
    "expected": "Filter categories should have balanced granularity, and all tool types should be represented in a filter category",
    "actual": "'Tools' is a catch-all for 6 distinct tools; readability activity type is missing from ACTIVITY_CATEGORIES",
    "impact": "Users cannot filter for specific tool activity; readability activities only appear under 'All Activity'"
  },
  {
    "bug_id": "R04-011",
    "severity": "MEDIUM",
    "category": "Navigation Gap",
    "component": "PublicNavigation",
    "file_line": "src/components/public/PublicNavigation.jsx:18",
    "description": "The public navigation Features dropdown lists 6 tools but omits the AI Readability Checker, which exists as an authenticated tool at /app/readability. The feature is available in the app but has no corresponding public marketing page in the features dropdown, making it undiscoverable to prospective users.",
    "steps": "1. Visit the public site as a logged-out user\n2. Open the Features dropdown in the navigation\n3. Count the tools listed: Content Planner, Technical Audit, Accessibility Analyzer, Meta Data Generator, Schema Generator, Image Alt Generator\n4. Note that AI Readability Checker is missing",
    "expected": "All tools available in the app should have corresponding feature pages listed in the public navigation",
    "actual": "AI Readability Checker is omitted from FEATURES array in PublicNavigation.jsx (line 18-25) despite being a full tool available at /app/readability",
    "impact": "Prospective users cannot discover the Readability Checker feature before signing up, reducing conversion potential for that tool"
  },
  {
    "bug_id": "R04-012",
    "severity": "MEDIUM",
    "category": "Navigation Gap",
    "component": "ExportHubPage",
    "file_line": "src/components/export/ExportHubPage.jsx:260",
    "description": "The ExportHubPage 'Back to Dashboard' link navigates to '/' (root) instead of '/app' (authenticated dashboard), same pattern as ActivityPage. This is a repeated navigation gap across multiple authenticated pages.",
    "steps": "1. Log in and navigate to /app/export\n2. Click 'Back to Dashboard' link at the top\n3. Observe navigation goes to '/' which redirects to '/app'",
    "expected": "Back link should point to '/app' for authenticated pages",
    "actual": "Link targets '/' requiring an extra redirect through SmartHome component",
    "impact": "Inconsistent back-navigation across authenticated pages; unnecessary redirect hop on every back-navigation"
  },
  {
    "bug_id": "R04-013",
    "severity": "HIGH",
    "category": "Progressive Disclosure",
    "component": "SEOChecklist",
    "file_line": "src/components/checklist/SEOChecklist.jsx:50",
    "description": "The SEOChecklist component initializes with all 6 phases expanded by default (expandedPhases = PHASES, line 50). With checklist data potentially containing 100+ items across 6 phases (Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch), all items render simultaneously without progressive disclosure.",
    "steps": "1. Navigate to /app/planner/projects/:id\n2. Observe that all 6 phases are expanded showing every checklist item\n3. Count the total items visible across all phases",
    "expected": "Only the current active phase or the first incomplete phase should be expanded by default; other phases should be collapsed",
    "actual": "All 6 phases expanded simultaneously (line 50: expandedPhases initialized to full PHASES array), showing all checklist items at once",
    "impact": "Users are overwhelmed by the full checklist on first load; cannot quickly identify which phase needs attention; long scroll required to reach later phases"
  },
  {
    "bug_id": "R04-014",
    "severity": "LOW",
    "category": "IA Problem",
    "component": "AuditLogViewer",
    "file_line": "src/components/admin/AuditLogViewer.jsx:36",
    "description": "The AuditLogViewer's RESOURCE_TYPES array (line 36-47) uses inconsistent naming for resources that map to the same tools: 'Accessibility Report' vs 'Accessibility Analyzer', 'Alt Text' vs 'Image Alt Generator', 'Meta Tags' vs 'Meta Data Generator'. The resource type labels do not match the tool names used elsewhere in the application.",
    "steps": "1. Open AuditLogViewer\n2. Open the Resource filter dropdown\n3. Compare resource names ('Accessibility Report', 'Alt Text', 'Meta Tags', 'Schema') to the tool names used in Navigation and HomePage ('Accessibility Analyzer', 'Image Alt Generator', 'Meta Data Generator', 'Structured Data Generator')",
    "expected": "Resource type labels should match the canonical tool names used across the application",
    "actual": "Resource types use shortened/different names that don't align with the tool naming convention elsewhere",
    "impact": "Admins filtering audit logs for a specific tool may not find the correct resource filter; naming inconsistency erodes trust in data accuracy"
  },
  {
    "bug_id": "R04-015",
    "severity": "MEDIUM",
    "category": "Content Grouping",
    "component": "GlossaryPage",
    "file_line": "src/components/help/GlossaryPage.jsx:86",
    "description": "The GlossaryPage displays 3 stat cards (Total Terms, Categories, Filtered Results) above the actual glossary content. These meta-statistics about the glossary add no user value and push the actual content below the fold, especially on smaller screens. A glossary's primary purpose is content lookup, not analytics about itself.",
    "steps": "1. Navigate to /help/glossary\n2. Observe 3 large stat cards above the search results\n3. Note that the actual glossary terms are pushed below the fold\n4. Consider whether 'Total Terms: 150' or 'Categories: 12' helps the user find a definition",
    "expected": "Glossary page should prioritize the search bar and term results; remove or minimize meta-statistics that don't aid the lookup task",
    "actual": "Three large stat cards (Total Terms, Categories, Filtered Results) occupy prominent screen real estate above the actual glossary content",
    "impact": "Users must scroll past irrelevant meta-information to reach the glossary content; poor content-to-action ratio on a reference page"
  }
]
