[
  {
    "bug_id": "R05-100",
    "severity": "MEDIUM",
    "category": "Screen Reader",
    "component": "ReadabilityBenchmarkWidget",
    "file_line": "src/components/readability/ReadabilityBenchmarkWidget.jsx:86",
    "description": "The benchmark widget container div lacks a role and accessible label. Screen readers cannot identify this as a distinct benchmarks region or understand its purpose.",
    "steps": "1. Use screen reader (NVDA/VoiceOver)\n2. Navigate to ReadabilityBenchmarkWidget on the input screen\n3. Listen for region announcement",
    "expected": "Widget should be announced as a labelled region, e.g. role='region' aria-label='Your readability benchmarks'",
    "actual": "Widget renders as a generic <div> with no role or aria-label; screen readers provide no context about this group of statistics",
    "impact": "Screen reader users cannot distinguish benchmark data from surrounding content or understand the widget boundary"
  },
  {
    "bug_id": "R05-101",
    "severity": "MEDIUM",
    "category": "Color Contrast",
    "component": "ReadabilityBenchmarkWidget",
    "file_line": "src/components/readability/ReadabilityBenchmarkWidget.jsx:102",
    "description": "Trend direction (up/down/neutral) is communicated solely through color (green/red/gray) and icon. The numeric trend value is present but the semantic meaning (improving vs declining) is not conveyed to screen readers.",
    "steps": "1. Use a screen reader\n2. Navigate to the Trend section\n3. Listen for trend direction announcement",
    "expected": "Trend should include screen-reader-accessible text like 'Improving by 5 points' or 'Declining by 3 points'",
    "actual": "Screen reader only reads the numeric value (e.g., '+5') with no semantic label explaining that this is a trend; the TrendIcon is aria-hidden",
    "impact": "Screen reader users may not understand whether the trend number represents improvement or decline"
  },
  {
    "bug_id": "R05-102",
    "severity": "LOW",
    "category": "ARIA Missing",
    "component": "ReadabilityCategoryChart",
    "file_line": "src/components/readability/ReadabilityCategoryChart.jsx:148",
    "description": "The BarChart3 decorative icon in the chart heading is missing aria-hidden='true', causing screen readers to potentially announce the SVG element.",
    "steps": "1. Use a screen reader\n2. Navigate to the Category Breakdown heading\n3. Listen for unexpected SVG announcement before 'Category Breakdown'",
    "expected": "Decorative icon should have aria-hidden='true' so screen readers skip it",
    "actual": "BarChart3 icon at line 148 has no aria-hidden attribute; screen reader may announce SVG content",
    "impact": "Minor screen reader noise when navigating to the chart heading"
  },
  {
    "bug_id": "R05-103",
    "severity": "HIGH",
    "category": "Keyboard Nav Gap",
    "component": "ReadabilityCoverageTable",
    "file_line": "src/components/readability/ReadabilityCoverageTable.jsx:90",
    "description": "Sortable table column headers use onClick on <th> elements but are not keyboard accessible. The <th> elements have no tabIndex, role='button', or onKeyDown handler, so keyboard-only users cannot trigger sorting.",
    "steps": "1. Tab to the Coverage Comparison table\n2. Try to Tab to column headers to sort\n3. Press Enter or Space on a sortable column header",
    "expected": "Sortable column headers should be focusable and activatable via keyboard (Enter/Space), either by using <button> elements inside <th> or by adding tabIndex=0, role='button', and onKeyDown",
    "actual": "Column headers are only clickable with a mouse; they cannot receive keyboard focus and have no keyboard event handlers",
    "impact": "Keyboard-only users and screen reader users cannot sort the coverage table, a core interactive feature (WCAG 2.1.1 Keyboard)"
  },
  {
    "bug_id": "R05-104",
    "severity": "MEDIUM",
    "category": "Semantic HTML",
    "component": "ReadabilityCheckItem",
    "file_line": "src/components/readability/ReadabilityCheckItem.jsx:114",
    "description": "The expandable check item header uses a <div> with role='button' instead of a native <button> element. While it has tabIndex and onKeyDown, this is a non-semantic pattern that may cause inconsistent behavior across assistive technologies.",
    "steps": "1. Navigate to a failing check item using a screen reader\n2. Try to activate the expandable header\n3. Check announcement behavior",
    "expected": "Expandable header should use a native <button> element for reliable cross-browser/AT behavior",
    "actual": "Uses <div role='button' tabIndex={0}> which is less reliable than a native button for all AT; some screen readers may not announce the interactive role correctly",
    "impact": "Some assistive technologies may not properly convey the interactive nature of the expandable section header"
  },
  {
    "bug_id": "R05-105",
    "severity": "MEDIUM",
    "category": "Screen Reader",
    "component": "ReadabilityCoverageTable",
    "file_line": "src/components/readability/ReadabilityCoverageTable.jsx:80",
    "description": "The data table lacks an accessible name. While it has role='table', there is no aria-label or aria-labelledby linking it to the 'Coverage Comparison' heading above, so screen readers announce it as an unnamed table.",
    "steps": "1. Use screen reader\n2. Navigate to the coverage comparison table\n3. Listen for table announcement",
    "expected": "Table should have aria-labelledby pointing to the heading 'Coverage Comparison' or an aria-label describing the table",
    "actual": "Table has role='table' but no accessible name; screen reader announces 'table' with no description",
    "impact": "Screen reader users cannot quickly identify the purpose of the table when navigating by landmarks or tables list"
  },
  {
    "bug_id": "R05-106",
    "severity": "HIGH",
    "category": "Focus Trap",
    "component": "ReadabilityDashboard",
    "file_line": "src/components/readability/ReadabilityDashboard.jsx:187",
    "description": "The Share dialog dropdown (line 187) appears as an absolutely positioned panel but has no focus trap, no aria-modal, and no Escape key handling. Focus can move to elements behind the dropdown, and pressing Escape does not close it.",
    "steps": "1. Click the Share button on the dashboard\n2. Press Tab repeatedly in the share dialog\n3. Notice focus escapes the dialog into the background\n4. Press Escape key",
    "expected": "Share dialog should trap focus within its boundary, return focus to the Share button on Escape, and use role='dialog' with aria-label",
    "actual": "Focus freely escapes the share dialog; Escape key is not handled; dialog has no role='dialog' or aria attributes",
    "impact": "Keyboard-only users lose context when focus escapes the share dialog; screen reader users are not informed a dialog has opened (WCAG 2.4.3 Focus Order)"
  },
  {
    "bug_id": "R05-107",
    "severity": "MEDIUM",
    "category": "ARIA Missing",
    "component": "ReadabilityDashboard",
    "file_line": "src/components/readability/ReadabilityDashboard.jsx:240",
    "description": "The Export dropdown button lacks aria-haspopup='true' and aria-expanded attributes. Screen readers cannot announce that this button opens a menu, and the expanded state is not communicated.",
    "steps": "1. Use a screen reader\n2. Navigate to the Export button\n3. Listen for menu announcement\n4. Open the export dropdown",
    "expected": "Export button should have aria-haspopup='menu' and aria-expanded toggling between true/false",
    "actual": "Export button has no aria-haspopup or aria-expanded; screen reader announces it as a plain button with no menu indication",
    "impact": "Screen reader users are not informed that activating the button will reveal a dropdown menu (WCAG 4.1.2 Name, Role, Value)"
  },
  {
    "bug_id": "R05-108",
    "severity": "LOW",
    "category": "Screen Reader",
    "component": "ReadabilityHistory",
    "file_line": "src/components/readability/ReadabilityHistory.jsx:357",
    "description": "The loading spinner on the 'Load More' button uses a visual spinning border animation but lacks role='status' or aria-label to announce loading state to screen readers.",
    "steps": "1. Navigate to history list and trigger Load More\n2. Use a screen reader during loading state\n3. Listen for loading announcement",
    "expected": "Loading spinner should include role='status' and aria-label='Loading more analyses' or use a live region to announce loading state",
    "actual": "Spinner is a purely visual <span> with animate-spin class; screen reader only reads 'Loading...' text but the spinner itself has no semantic role",
    "impact": "Minor: the text 'Loading...' partially mitigates this, but the spinner has no semantic meaning for assistive technologies"
  },
  {
    "bug_id": "R05-109",
    "severity": "HIGH",
    "category": "Keyboard Nav Gap",
    "component": "ReadabilityIssuesTable",
    "file_line": "src/components/readability/ReadabilityIssuesTable.jsx:309",
    "description": "Table rows with expandable details use onClick on <tr> elements but are not keyboard accessible. The <tr> elements have no tabIndex, role, or onKeyDown handler, so keyboard users cannot expand row details.",
    "steps": "1. Tab to the Issues table\n2. Try to navigate to a row with expandable details\n3. Try to press Enter or Space to expand the row",
    "expected": "Expandable rows should be focusable and activatable via keyboard. Each expandable <tr> needs tabIndex=0, role='button' or role='row' with aria-expanded, and an onKeyDown handler",
    "actual": "Table rows only respond to mouse click; keyboard users cannot focus or activate expandable rows",
    "impact": "Keyboard-only users cannot access check detail information in the Issues table, a primary interface for reviewing results (WCAG 2.1.1 Keyboard)"
  },
  {
    "bug_id": "R05-110",
    "severity": "HIGH",
    "category": "Keyboard Nav Gap",
    "component": "ReadabilityIssuesTable",
    "file_line": "src/components/readability/ReadabilityIssuesTable.jsx:162",
    "description": "The SortHeader component renders sortable <th> elements with onClick handlers but no keyboard support (same pattern as ReadabilityCoverageTable). The <th> elements are not focusable and have no onKeyDown handler.",
    "steps": "1. Tab through the Issues table header\n2. Try to focus on any sortable column header\n3. Try to press Enter or Space to sort",
    "expected": "Sortable column headers should contain a <button> element or have tabIndex=0 with onKeyDown to enable keyboard sorting",
    "actual": "Column headers use onClick on <th> elements only; they cannot receive keyboard focus",
    "impact": "Keyboard-only users cannot sort the issues table columns (WCAG 2.1.1 Keyboard)"
  },
  {
    "bug_id": "R05-111",
    "severity": "MEDIUM",
    "category": "Form A11y",
    "component": "ReadabilityDashboard",
    "file_line": "src/components/readability/ReadabilityDashboard.jsx:224",
    "description": "The share link <input> (readOnly) at line 224 lacks an aria-label. While there is a preceding text 'Share link:', it is not programmatically associated via htmlFor/id or aria-labelledby.",
    "steps": "1. Open the Share dialog\n2. Generate a share link\n3. Tab to the share link input\n4. Listen for screen reader announcement",
    "expected": "The share link input should have an aria-label='Share link URL' or be associated with the preceding label via id and aria-labelledby",
    "actual": "Input has no label association; screen reader announces it as an unlabeled text field",
    "impact": "Screen reader users cannot identify the purpose of the share link input field"
  },
  {
    "bug_id": "R05-112",
    "severity": "HIGH",
    "category": "ARIA Missing",
    "component": "CommandPalette",
    "file_line": "src/components/shared/CommandPalette.jsx:190",
    "description": "The Command Palette overlay renders as a generic <div> with no role='dialog', no aria-modal='true', and no aria-label. Screen readers are not informed that a modal dialog has opened, and the dialog is not identified as a combobox/listbox pattern.",
    "steps": "1. Press Cmd+K to open the Command Palette\n2. Use a screen reader to listen for dialog announcement\n3. Navigate through the command list",
    "expected": "The palette container should have role='dialog' aria-modal='true' aria-label='Command palette'. The search input + results should use role='combobox' with aria-controls pointing to the results list, and results should use role='listbox' with role='option' items.",
    "actual": "Outer container is a plain <div> with no ARIA dialog role; results list has no role='listbox'; individual commands have no role='option' or aria-selected",
    "impact": "Screen reader users cannot identify the Command Palette as a modal dialog, and the search+results interaction pattern is not conveyed to assistive technologies (WCAG 4.1.2)"
  },
  {
    "bug_id": "R05-113",
    "severity": "HIGH",
    "category": "Focus Trap",
    "component": "LinkToProjectModal",
    "file_line": "src/components/shared/LinkToProjectModal.jsx:68",
    "description": "The LinkToProjectModal renders as a full-screen overlay but has no focus trap. While it handles Escape key, Tab can move focus to elements behind the modal backdrop. The modal container also lacks role='dialog' and aria-modal='true'.",
    "steps": "1. Open the Link to Project modal\n2. Press Tab repeatedly\n3. Observe that focus escapes to page content behind the modal",
    "expected": "Modal should have role='dialog' aria-modal='true' aria-labelledby pointing to the heading. Focus should be trapped within the modal and returned to the trigger button on close.",
    "actual": "Modal is a plain <div> with no dialog role; focus is not trapped and can escape to background content; initial focus is not moved to the modal on open",
    "impact": "Keyboard users lose context as focus escapes the modal; screen reader users are not informed a dialog has opened (WCAG 2.4.3 Focus Order, WCAG 4.1.2 Name Role Value)"
  },
  {
    "bug_id": "R05-114",
    "severity": "MEDIUM",
    "category": "ARIA Missing",
    "component": "LinkToProjectModal",
    "file_line": "src/components/shared/LinkToProjectModal.jsx:85",
    "description": "The close button (X icon) in the LinkToProjectModal header lacks an aria-label. The button only contains an SVG icon with no text, making it unidentifiable to screen readers.",
    "steps": "1. Open the Link to Project modal\n2. Navigate to the close button with a screen reader\n3. Listen for button announcement",
    "expected": "Close button should have aria-label='Close dialog' or 'Close link to project modal'",
    "actual": "Button announces as an unlabeled button with no accessible name",
    "impact": "Screen reader users cannot identify the purpose of the close button in the modal header"
  },
  {
    "bug_id": "R05-115",
    "severity": "MEDIUM",
    "category": "Form A11y",
    "component": "LinkToProjectModal",
    "file_line": "src/components/shared/LinkToProjectModal.jsx:98",
    "description": "The search input in the LinkToProjectModal has placeholder text but no aria-label or associated <label> element. Screen readers announce it as an unlabeled text input.",
    "steps": "1. Open the Link to Project modal\n2. Tab to the search input\n3. Listen for screen reader announcement",
    "expected": "Search input should have aria-label='Search projects' or an associated label element",
    "actual": "Input has only placeholder='Search projects...' with no programmatic label; screen readers may read the placeholder but it is not a reliable accessible name",
    "impact": "Screen reader users may not understand the purpose of the search field in the modal"
  }
]
