[
  {
    "bug_id": "R06-100",
    "severity": "HIGH",
    "category": "Meta Tag Issue",
    "component": "ReadabilityPage",
    "file_line": "src/components/readability/ReadabilityPage.jsx:67",
    "description": "ReadabilityPage sets document.title via direct DOM manipulation instead of using the SEOHead component. This means no meta description, no canonical URL, no OG tags, and no Twitter cards are set for the /app/readability route. The page is entirely missing from the pageSEO configuration in seo.js.",
    "steps": "1. Navigate to /app/readability\n2. Inspect <head> element\n3. Observe no meta description, canonical, OG or Twitter tags are set",
    "expected": "ReadabilityPage should use SEOHead component with proper meta description, canonical URL, and social card tags, and a 'readability' entry should exist in pageSEO config",
    "actual": "Page uses document.title = directly at line 75, bypassing SEOHead entirely. No meta description, canonical, OG, or Twitter card tags are rendered for this page.",
    "impact": "The AI Readability Checker page has zero SEO metadata. Search engines see no description, no canonical, and social shares have no rich preview. This is a core tool page with high traffic potential."
  },
  {
    "bug_id": "R06-101",
    "severity": "HIGH",
    "category": "Social Cards",
    "component": "ReadabilityShareView",
    "file_line": "src/components/readability/ReadabilityShareView.jsx:70",
    "description": "ReadabilityShareView is a public-facing shared analysis page (no auth required) but has no SEOHead, no OG tags, no Twitter cards, and no meta description. When users share analysis links on social media, there is no rich preview card.",
    "steps": "1. Navigate to /share/readability/:token (a public shared URL)\n2. Inspect <head> element\n3. Share the URL on Twitter/LinkedIn/Slack\n4. Observe no preview card appears",
    "expected": "Shared analysis view should render dynamic OG tags with og:title='AI Readability Report - Score X/100', og:description with the grade summary, og:image with a generated screenshot or branded image, and twitter:card meta tags",
    "actual": "No SEOHead component used. No OG or Twitter meta tags rendered. Shared links have no social preview, reducing click-through rates from social shares.",
    "impact": "Critical for virality. Shared readability reports on social media show blank previews instead of rich cards with score/grade, severely reducing engagement and traffic from social sharing."
  },
  {
    "bug_id": "R06-102",
    "severity": "HIGH",
    "category": "Sitemap Gap",
    "component": "SEO Config",
    "file_line": "src/config/seo.js:27",
    "description": "The pageSEO configuration defines entries for public feature pages but has no entry for the readability tool (/features/readability or /app/readability). Additionally, no sitemap.xml generation is implemented anywhere in the codebase. The sitemap configuration is entirely absent.",
    "steps": "1. Search codebase for 'sitemap' references\n2. Check pageSEO object in seo.js for readability entries\n3. Attempt to access /sitemap.xml",
    "expected": "A sitemap.xml should be generated (either statically or dynamically) listing all public pages. The pageSEO config should include a 'features/readability' entry for the readability tool's public feature page.",
    "actual": "No sitemap generation exists. No readability-related entry in pageSEO. Search engines have no structured way to discover all pages.",
    "impact": "Without a sitemap, search engine crawlers rely solely on link discovery, potentially missing orphaned pages. The readability feature page is not indexed optimally."
  },
  {
    "bug_id": "R06-103",
    "severity": "MEDIUM",
    "category": "Schema Error",
    "component": "SEO Config",
    "file_line": "src/config/seo.js:144",
    "description": "The organizationSchema foundingDate uses '2024' as a plain string. Schema.org expects foundingDate to be in ISO 8601 date format (YYYY-MM-DD or YYYY). While '2024' is technically a valid year, Google's Rich Results validator prefers the full date format, and the value should match the actual founding date.",
    "steps": "1. Open src/config/seo.js\n2. Check organizationSchema.foundingDate at line 144\n3. Validate with Google Rich Results Test",
    "expected": "foundingDate should use ISO 8601 format like '2024-01-01' for best schema validation results",
    "actual": "foundingDate is set to plain string '2024' without full date specificity",
    "impact": "May trigger schema validation warnings in Google Rich Results Test. Incomplete date format reduces structured data quality score."
  },
  {
    "bug_id": "R06-104",
    "severity": "MEDIUM",
    "category": "Canonical Issue",
    "component": "SEOHead",
    "file_line": "src/components/shared/SEOHead.jsx:25",
    "description": "SEOHead defaults to canonical '/' when no canonical is provided and no pageKey matches. This means any page using SEOHead without explicitly passing canonical or using a valid pageKey will have a canonical pointing to the homepage, creating canonical confusion for search engines.",
    "steps": "1. Open SEOHead.jsx\n2. See line 25: pageCanonical = canonical || seo.canonical || '/'\n3. Use SEOHead on any page without passing canonical prop or a valid pageKey\n4. Inspect rendered canonical tag",
    "expected": "If no canonical is provided and no pageKey matches, the canonical should either be omitted entirely or derived from the current route path using window.location.pathname",
    "actual": "Defaults to '/' causing all unconfigured pages to canonicalize to the homepage, which signals to search engines that those pages are duplicates of the homepage",
    "impact": "Pages without explicit canonical configuration incorrectly point to the root URL, which can cause indexation issues and dilute page authority for non-homepage content."
  },
  {
    "bug_id": "R06-105",
    "severity": "MEDIUM",
    "category": "Heading Hierarchy",
    "component": "ReadabilityShareView",
    "file_line": "src/components/readability/ReadabilityShareView.jsx:168",
    "description": "ReadabilityShareView has heading hierarchy violations. The page starts with an h1 ('AI Readability Report') at line 168, then has h2 elements for sections (lines 219, 234, 281, 314, 345), but the error state at line 143 uses an h2 without a preceding h1 when the error branch renders. This means some page states have no h1.",
    "steps": "1. Navigate to /share/readability/:token with an invalid/expired token\n2. Inspect the heading hierarchy\n3. Observe h2 'This link has expired' or 'Analysis not available' appears without any h1 on the page",
    "expected": "All page states (loading, error, success) should have a consistent heading hierarchy starting with h1. The error state should include an h1 element.",
    "actual": "Error state renders h2 at line 143 with no h1 on the page. The loading state also has no heading at all.",
    "impact": "Search engines and screen readers cannot determine the primary topic of the page in error states. Heading hierarchy violations reduce SEO heading signal quality."
  },
  {
    "bug_id": "R06-106",
    "severity": "MEDIUM",
    "category": "Heading Hierarchy",
    "component": "ReportBuilderPage",
    "file_line": "src/components/reports/ReportBuilderPage.jsx:412",
    "description": "ReportBuilderPage uses h2 for 'Report Builder' (line 412) and h3 elements for sidebar sections (lines 455, 489, 543, 568, 714, 837) but has no h1 element on the page at all. The page title is an <input> field for the report name, not a heading.",
    "steps": "1. Navigate to /app/reports/builder\n2. Inspect heading hierarchy\n3. Observe no h1 element exists",
    "expected": "The page should have an h1 element, either 'Report Builder' or the report name, to establish proper heading hierarchy",
    "actual": "No h1 exists. The sidebar uses h2 'Report Builder' and h3 sub-sections. The report name is rendered as an <input> element, not a heading.",
    "impact": "Missing h1 means search engines cannot identify the primary topic of the page. Every page should have exactly one h1 for proper SEO heading hierarchy."
  },
  {
    "bug_id": "R06-107",
    "severity": "MEDIUM",
    "category": "Heading Hierarchy",
    "component": "UserSettingsPage",
    "file_line": "src/components/settings/UserSettingsPage.jsx:304",
    "description": "UserSettingsPage renders h1 'Settings' at line 304, followed by h2 elements for each section (lines 363, 511, 535, 623, 738). However, the Danger Zone section at line 738 uses h2 for 'Danger Zone' and then h3 for 'Delete Account' at line 747, while other sections directly use h2 without h3 sub-sections, creating inconsistent heading nesting.",
    "steps": "1. Navigate to /app/settings\n2. Inspect heading hierarchy across different sections\n3. Note inconsistent heading depth between sections",
    "expected": "All settings sections should use consistent heading hierarchy. If h3 is used for sub-sections within one section, the pattern should be consistent across all sections.",
    "actual": "Danger Zone has h2 > h3 nesting while other sections have h2 > form fields with no h3. The heading level usage is inconsistent across sections.",
    "impact": "Inconsistent heading hierarchy makes it harder for search engines to understand content structure and for assistive technologies to navigate the page."
  },
  {
    "bug_id": "R06-108",
    "severity": "HIGH",
    "category": "Meta Tag Issue",
    "component": "ReportBuilderPage",
    "file_line": "src/components/reports/ReportBuilderPage.jsx:362",
    "description": "The HTML export feature in ReportBuilderPage (lines 362-382) generates a standalone HTML document with minimal SEO tags. The exported HTML has <meta charset> and <title> but is missing: meta viewport tag (critical for mobile rendering), meta description, canonical URL, OG tags, and a proper lang attribute on the <html> element.",
    "steps": "1. Create a report in Report Builder\n2. Export as HTML\n3. Open the exported .html file\n4. Inspect the <head> element",
    "expected": "Exported HTML should include <html lang='en'>, <meta name='viewport' content='width=device-width, initial-scale=1'>, a meta description, and basic OG tags for when the HTML file is hosted/shared",
    "actual": "Exported HTML at line 362 has bare-minimum head: only charset and title. Missing viewport meta tag, lang attribute, and all SEO-relevant meta tags.",
    "impact": "Exported HTML reports render poorly on mobile devices without viewport meta tag. When these reports are hosted on client domains, they have zero SEO value and poor mobile usability."
  },
  {
    "bug_id": "R06-109",
    "severity": "MEDIUM",
    "category": "Internal Links",
    "component": "ReadabilityCrossToolLinks",
    "file_line": "src/components/readability/ReadabilityCrossToolLinks.jsx:50",
    "description": "ReadabilityCrossToolLinks references paths '/app/content-planner' and '/app/keyword-research' (lines 54, 62) that do not correspond to any actual routes or tools in the tools.js registry. The Content Planner tool is registered at '/app/planner' not '/app/content-planner', and there is no 'keyword-research' tool at all.",
    "steps": "1. Open ReadabilityCrossToolLinks.jsx\n2. See CROSS_TOOL_LINKS entries for 'content-planner' path='/app/content-planner' and 'keyword-research' path='/app/keyword-research'\n3. Check tools.js - planner is at '/app/planner', no keyword-research tool exists\n4. Click these links from the readability results page",
    "expected": "Cross-tool links should point to valid, existing routes. The content planner link should use '/app/planner' and the keyword research link should either be removed or point to an existing tool.",
    "actual": "Links to '/app/content-planner' and '/app/keyword-research' are broken - these routes don't exist. Users clicking these links get a blank page or 404.",
    "impact": "Broken internal links waste crawl budget and link equity. Users encounter dead ends. Two of four cross-tool links are non-functional, reducing the feature's value."
  },
  {
    "bug_id": "R06-110",
    "severity": "MEDIUM",
    "category": "Internal Links",
    "component": "Breadcrumb",
    "file_line": "src/components/shared/Breadcrumb.jsx:14",
    "description": "The Breadcrumb component's ROUTE_CONFIG at line 14 is missing entries for the readability tool routes. There is no '/readability' breadcrumb entry, so when users navigate to /app/readability or /app/readability/:analysisId, no breadcrumb trail is generated. Similarly, '/reports' and '/schema-generator' have entries but the paths don't include the /app prefix that the actual routes use.",
    "steps": "1. Navigate to /app/readability\n2. Check breadcrumb component output\n3. Observe empty breadcrumbs or incorrect trail\n4. Compare ROUTE_CONFIG paths with actual tool routes in tools.js",
    "expected": "ROUTE_CONFIG should include entries for '/readability' (or the full /app/readability path) with parent: '/', and paths should match the actual routing structure used in tools.js",
    "actual": "No readability entry in ROUTE_CONFIG. Breadcrumb trail is empty for readability pages. Route paths in ROUTE_CONFIG don't include /app prefix while actual routes do.",
    "impact": "Missing breadcrumbs for the readability tool page means no structured breadcrumb trail for Google, and users lose navigation context. Breadcrumb schema markup is not generated for these pages."
  },
  {
    "bug_id": "R06-111",
    "severity": "LOW",
    "category": "Schema Error",
    "component": "SEO Config",
    "file_line": "src/config/seo.js:150",
    "description": "The softwareSchemas entries for 'audit' (line 175) and 'accessibility' (line 196) are missing the 'screenshot' property that the 'planner' schema includes at line 172. Google Rich Results uses screenshot to display app preview images. Inconsistent schema properties across similar schema types reduces structured data quality.",
    "steps": "1. Open seo.js\n2. Compare softwareSchemas.planner (has screenshot) with softwareSchemas.audit and softwareSchemas.accessibility (no screenshot)\n3. Validate with Google Rich Results Test",
    "expected": "All SoftwareApplication schemas should consistently include the screenshot property pointing to actual screenshot images",
    "actual": "Only the planner schema includes screenshot. The audit, accessibility, meta-generator, schema-generator, and image-alt schemas all omit it.",
    "impact": "Inconsistent schema properties reduce the likelihood of rich results appearing for these tool pages. Google may display richer results for tools that include screenshots."
  },
  {
    "bug_id": "R06-112",
    "severity": "MEDIUM",
    "category": "Meta Tag Issue",
    "component": "SchemaGeneratorPage",
    "file_line": "src/components/schema-generator/SchemaGeneratorPage.jsx:16",
    "description": "SchemaGeneratorPage does not use the SEOHead component and does not set any page title, meta description, or canonical URL. The page relies entirely on whatever default title was set by a parent component. No SEO metadata is managed for this authenticated tool page.",
    "steps": "1. Navigate to /app/schema-generator\n2. Inspect <head> element\n3. Check for page-specific title, description, canonical tags",
    "expected": "SchemaGeneratorPage should set a page title like 'Schema Generator | Content Strategy Portal' using either SEOHead or document.title, and ideally set noindex for authenticated tool pages",
    "actual": "No title management, no meta tags, no SEOHead usage. Page title remains whatever was set by the last page visited or the default.",
    "impact": "If search engines somehow index this authenticated page, it has no descriptive title or meta description. Users see stale titles in browser tabs when switching between tools."
  },
  {
    "bug_id": "R06-113",
    "severity": "LOW",
    "category": "URL Structure",
    "component": "Tool Config",
    "file_line": "src/config/tools.js:169",
    "description": "The schema generator tool is registered in tools.js with the path '/app/schema-generator' (line 169) but the cross-tool links in ReadabilityCrossToolLinks.jsx reference it as '/app/schema' (line 33). This URL inconsistency means cross-tool linking to the schema generator may not match the expected route.",
    "steps": "1. Check tools.js: schema-generator path is '/app/schema-generator'\n2. Check ReadabilityCrossToolLinks.jsx: schema link path is '/app/schema'\n3. Click 'Generate Schema Markup' from readability results",
    "expected": "All references to the schema generator should use the consistent path '/app/schema-generator'",
    "actual": "Cross-tool link uses '/app/schema' while the tool is registered at '/app/schema-generator'. This creates a URL mismatch.",
    "impact": "Inconsistent URL structure confuses crawlers and may result in broken deep links. Users may be directed to an incorrect or non-existent route."
  },
  {
    "bug_id": "R06-114",
    "severity": "LOW",
    "category": "Social Cards",
    "component": "SEO Config",
    "file_line": "src/config/seo.js:20",
    "description": "The defaultMeta.ogImage points to a static path '${SITE_URL}/og-image.png' but there is no mechanism to verify this image exists, and there are no page-specific OG images. All pages share the same generic OG image. Feature pages should have tool-specific OG images for better social sharing differentiation.",
    "steps": "1. Check seo.js defaultMeta.ogImage\n2. Share different feature pages on social media\n3. Observe all pages show the same og-image.png",
    "expected": "Each major page section (features, tools, help) should have unique OG images. The pageSEO config should support per-page ogImage overrides.",
    "actual": "Single generic og-image.png is used for all pages. No page-specific OG image support in pageSEO entries.",
    "impact": "All social shares look identical regardless of the page being shared. Reduced visual differentiation on social platforms reduces click-through rates."
  },
  {
    "bug_id": "R06-115",
    "severity": "MEDIUM",
    "category": "Heading Hierarchy",
    "component": "ReadabilityDashboard",
    "file_line": "src/components/readability/ReadabilityDashboard.jsx:337",
    "description": "ReadabilityDashboard uses h3 for 'Quick Wins' at line 337 but the parent ReadabilityPage uses h1 at line 208. This means h3 appears as a direct child of h1, skipping h2 entirely. The tab section labels inside tab panels also use inconsistent heading levels - ReadabilityCategoryAccordion uses h3 at line 262, creating an h1 > h3 skip.",
    "steps": "1. Navigate to /app/readability with results showing\n2. Inspect heading hierarchy on the dashboard\n3. Observe h1 (page title) followed by h3 (Quick Wins, Detailed Check Results) with no intervening h2",
    "expected": "Heading levels should not skip. If the page has h1, the next level should be h2 for major sections, then h3 for sub-sections.",
    "actual": "h1 at ReadabilityPage level is followed directly by h3 in ReadabilityDashboard and ReadabilityCategoryAccordion, skipping h2.",
    "impact": "Skipped heading levels (h1 > h3) violate SEO best practices and WCAG guidelines. Search engines use heading hierarchy to understand content structure."
  },
  {
    "bug_id": "R06-116",
    "severity": "LOW",
    "category": "Internal Links",
    "component": "Footer",
    "file_line": "src/components/shared/Footer.jsx:129",
    "description": "Footer includes links to '/terms', '/privacy', '/ai-policy', and '/accessibility' (lines 129-139) but the pageSEO config in seo.js has no entries for these legal pages. If these pages exist, they lack structured SEO metadata. If they don't exist, these are broken internal links.",
    "steps": "1. Check Footer.jsx lines 129-139 for legal page links\n2. Check pageSEO in seo.js for matching entries\n3. Navigate to /terms, /privacy, /ai-policy, /accessibility\n4. Check if pages exist and have proper meta tags",
    "expected": "Either the legal pages should have pageSEO entries with proper meta descriptions and canonical URLs, or if the pages don't exist yet, the links should be removed or marked as coming soon",
    "actual": "Footer links to 4 legal pages that have no SEO configuration. These pages may not exist at all, resulting in broken links from every page of the site.",
    "impact": "Broken footer links from every page of the site waste crawl budget and create a poor user experience. Missing SEO config for legal pages means no meta descriptions or canonicals."
  }
]
