[
  {
    "bug_id": "R06-008",
    "batch": 3,
    "severity": "HIGH",
    "category": "Sitemap Gap",
    "file": "src/App.jsx",
    "line": 0,
    "description": "No sitemap.xml file exists anywhere in the project. The application has 15+ public routes (/, /about, /features, /features/:slug, /help, /help/getting-started, /help/resources, /help/glossary, /terms, /privacy, /ai-policy, /accessibility, /login, /register) but no sitemap to guide search engine crawling.",
    "skip_reason": "No sitemap.xml for crawlers",
    "fix_approach": "Add build-time sitemap generation from route config"
  },
  {
    "bug_id": "R07-C-003",
    "batch": 5,
    "severity": "HIGH",
    "category": "Hallucination Risk",
    "file": "src/lib/accessibility/aiSuggestionService.js",
    "line": 0,
    "description": "The generateCompliancePlan function asks the LLM to generate specific remediation timelines ('1-2 weeks'), expected improvement percentages ('+15% compliance'), and resource requirements without grounding these estimates in actual project data. The LLM is given only aggregate violation counts and scores, yet is asked to predict specific timelines and improvement percentages, which are hallucination-prone outputs that users may treat as reliable planning data.",
    "skip_reason": "Compliance plan produces ungrounded timelines",
    "fix_approach": "Add disclaimers; remove specific percentages from prompts"
  },
  {
    "bug_id": "R04-202",
    "batch": 6,
    "severity": "HIGH",
    "category": "Cognitive Overload",
    "file": "src/hooks/useReadabilityAnalysis.js",
    "line": 0,
    "description": "The analysis state machine exposes 6 granular internal states (idle, fetching, extracting, analyzing, scoring, error) directly to UI consumers. This creates unnecessary cognitive complexity for users viewing progress indicators. The UI must handle each state separately despite 'fetching', 'extracting', 'analyzing', and 'scoring' all being substages of a single 'in progress' concept.",
    "skip_reason": "Analysis state machine exposes 6 internal states to UI",
    "fix_approach": "Create simplified loading/ready/error mapping for UI"
  },
  {
    "bug_id": "R11-A-003",
    "batch": 6,
    "severity": "HIGH",
    "category": "Content Relationship",
    "file": "src/data/glossary.js",
    "line": 0,
    "description": "Every relatedTerms entry in the glossary references terms that do not exist as glossary entries. Out of 30 glossary terms, the relatedTerms arrays collectively reference 39 unique term names (such as 'Image Optimization', 'Link Building', 'Domain Authority', 'Keywords', 'Crawling', 'JSON-LD', etc.) that have no matching term definition in the glossary. The GlossaryPage component allows clicking related terms to search for them, but these searches will return no results since the referenced terms do not exist.",
    "skip_reason": "Glossary relatedTerms reference non-existent entries",
    "fix_approach": "Add referenced terms or remove broken refs"
  },
  {
    "bug_id": "R06-102",
    "batch": 7,
    "severity": "HIGH",
    "category": "Sitemap Gap",
    "file": "src/config/seo.js",
    "line": 0,
    "description": "The pageSEO configuration defines entries for public feature pages but has no entry for the readability tool (/features/readability or /app/readability). Additionally, no sitemap.xml generation is implemented anywhere in the codebase. The sitemap configuration is entirely absent.",
    "skip_reason": "No sitemap generation in SEO config",
    "fix_approach": "Create sitemap script from route config"
  },
  {
    "bug_id": "R09-B-003",
    "batch": 7,
    "severity": "HIGH",
    "category": "Deploy Risk",
    "file": "src/config/seo.js",
    "line": 0,
    "description": "The site URL is hardcoded as 'https://contentstrategyportal.com' with a TODO comment 'Update with actual domain'. This value is used for all canonical URLs, Open Graph meta tags, Twitter Card URLs, schema.org JSON-LD, breadcrumb schemas, and HowTo schema throughout the application. If the actual production domain differs (e.g., staging, preview deployments, or a different production domain), all SEO metadata will point to an incorrect or non-existent domain.",
    "skip_reason": "Site URL hardcoded as placeholder with TODO",
    "fix_approach": "Add VITE_SITE_URL env var; fail build if unset"
  },
  {
    "bug_id": "R10-C-012",
    "batch": 7,
    "severity": "HIGH",
    "category": "Missing Empty State",
    "file": "src/hooks/useExportHistory.js",
    "line": 0,
    "description": "The usePendingExports hook is a stub implementation that always returns empty arrays for all export categories. The pending state is initialized with empty arrays (line 132-139) and never populated - the useEffect simply sets loading to false. This means the pending exports feature shows no data regardless of actual pending items, providing a misleading empty state.",
    "skip_reason": "usePendingExports is a stub — always empty",
    "fix_approach": "Implement tracking or remove stub"
  },
  {
    "bug_id": "R11-C-011",
    "batch": 7,
    "severity": "HIGH",
    "category": "Editorial Workflow",
    "file": "src/hooks/useDueDates.js",
    "line": 0,
    "description": "The due date system supports only three type values: 'task', 'project', and 'reminder' (line 64). There is no support for content lifecycle milestone types such as 'content_review', 'content_refresh', 'content_archive', 'content_publish', or 'content_approval'. This means the editorial workflow cannot track content-specific lifecycle events like scheduled content reviews, publication deadlines, or archival dates. The due date urgency calculation (getDueDateUrgency, line 177) also uses a generic color system with 'charcoal' for future items, which is not a standard Tailwind CSS color and may not render correctly.",
    "skip_reason": "Due dates lack content lifecycle types",
    "fix_approach": "Add lifecycle types; integrate with retention"
  },
  {
    "bug_id": "R03-100",
    "batch": 10,
    "severity": "HIGH",
    "category": "Terminology Inconsistency",
    "file": "src/components/readability/ReadabilityCategoryChart.jsx",
    "line": 0,
    "description": "Category key 'technicalAccess' is inconsistent with 'technicalAccessibility' used in ReadabilityCategoryAccordion.jsx and likely across the data model. This will cause the chart and accordion to reference different keys for the same category, leading to missing data or zero scores.",
    "skip_reason": "CategoryChart terminology inconsistent with scorer",
    "fix_approach": "Align labels with scorer category names"
  },
  {
    "bug_id": "R04-100",
    "batch": 10,
    "severity": "HIGH",
    "category": "Taxonomy Issue",
    "file": "src/components/readability/ReadabilityCategoryChart.jsx",
    "line": 0,
    "description": "Taxonomy key inconsistency between ReadabilityCategoryAccordion and ReadabilityCategoryChart. The accordion uses 'technicalAccessibility' as the category key while the chart uses 'technicalAccess'. This mismatch means the same category is keyed differently across sibling components, causing potential data lookup failures and confusing the IA model.",
    "skip_reason": "CategoryChart categories dont match accordion",
    "fix_approach": "Use same keys/labels as accordion"
  },
  {
    "bug_id": "R08-A-001",
    "batch": 11,
    "severity": "HIGH",
    "category": "Data Integrity",
    "file": "src/components/export/ExportHubPage.jsx",
    "line": 0,
    "description": "Project export uses an empty mockItems array, causing all project exports to contain zero checklist items regardless of actual project data.",
    "skip_reason": "ExportHubPage data may be stale after modification",
    "fix_approach": "Add last-modified check; warn if data changed"
  },
  {
    "bug_id": "R07-C-006",
    "batch": 5,
    "severity": "MEDIUM",
    "category": "Model Selection",
    "file": "src/lib/accessibility/aiSuggestionService.js",
    "line": 0,
    "description": "Multiple AI service files hardcode different Claude model versions without centralized model configuration. aiSuggestionService.js uses 'claude-sonnet-4-20250514' (line 70), metaGeneratorService.js uses 'claude-sonnet-4-20250514' (line 247), imageAltService.js uses 'claude-sonnet-4-20250514' (line 123), schemaGeneratorService.js uses 'claude-sonnet-4-20250514' (line 294), while aiAnalyzer.js uses 'claude-sonnet-4-5-20250929' (line 63) and llmPreview.js uses 'claude-sonnet-4-5-20250929' (line 12). This creates inconsistency where some services use an older model version than others, and model updates require changes across 6+ files.",
    "skip_reason": "AI services hardcode different model versions",
    "fix_approach": "Centralize model config in single module"
  },
  {
    "bug_id": "R09-A-014",
    "batch": 5,
    "severity": "MEDIUM",
    "category": "Caching Gap",
    "file": "vite.config.js",
    "line": 0,
    "description": "The Vite build configuration does not explicitly configure output file naming with content hashes for assets beyond the default. While Vite does add hashes to JS chunks by default, there is no explicit configuration for CSS, font, or image asset naming patterns. More critically, there is no configuration for service worker, cache headers, or asset manifest generation. The application has no service worker for offline caching or cache-first strategies, meaning repeat visits always require full network requests for HTML and uncached assets.",
    "skip_reason": "No explicit content hash for long-term caching",
    "fix_approach": "Configure Vite hashFunction for deterministic hashing"
  },
  {
    "bug_id": "R05-212",
    "batch": 6,
    "severity": "MEDIUM",
    "category": "Screen Reader",
    "file": "src/hooks/useReadabilityAnalysis.js",
    "line": 0,
    "description": "Analysis progress callback (handleProgress) updates state with stage and message but provides no aria-live announcement mechanism. The multi-step analysis pipeline (fetching, extracting, analyzing, scoring) reports progress through state updates only, with no way for consuming components to know they should announce these transitions via live regions.",
    "skip_reason": "Analysis progress no aria-live for screen readers",
    "fix_approach": "Add aria-live=\"polite\" for progress announcements"
  },
  {
    "bug_id": "R08-C-015",
    "batch": 6,
    "severity": "MEDIUM",
    "category": "Workflow Gap",
    "file": "src/hooks/useReadabilityAnalysis.js",
    "line": 0,
    "description": "The enforceStorageLimit function auto-deletes the oldest analyses when the storage limit is exceeded, but this happens silently with no user notification or confirmation. Users lose historical analysis data without being warned beforehand. There is no warning when approaching the limit, no option to choose which analyses to delete, and no archive mechanism to preserve data in a cheaper storage tier before deletion.",
    "skip_reason": "Auto-deletes oldest analyses silently on limit",
    "fix_approach": "Show notification before deletion; let user choose"
  },
  {
    "bug_id": "R11-A-015",
    "batch": 6,
    "severity": "MEDIUM",
    "category": "Governance Gap",
    "file": "src/data/glossary.js",
    "line": 0,
    "description": "The glossary contains only 30 terms for an SEO content strategy portal that features 353 checklist items across 25 categories and includes specialized tools for accessibility (WCAG), readability, schema markup, and meta data generation. Critical domain terms used throughout the portal are missing from the glossary, including: 'WCAG' (central to the accessibility tool), 'Readability Score' (central to the readability tool), 'JSON-LD' (referenced in schema generator), 'INP' (Interaction to Next Paint, used in checklist items), 'CLS' (Cumulative Layout Shift), 'Rich Results', 'Structured Data', 'Content Clusters', 'Link Equity', 'Keyword Cannibalization' (has a term, but many of its referenced terms are missing). The glossary has no governance process for adding terms when new features are introduced.",
    "skip_reason": "Glossary has only 30 terms — insufficient scope",
    "fix_approach": "Expand to 80-100+ terms by topic"
  },
  {
    "bug_id": "R11-C-002",
    "batch": 6,
    "severity": "MEDIUM",
    "category": "Terminology",
    "file": "src/data/glossary.js",
    "line": 0,
    "description": "The glossary entry for 'Core Web Vitals' (id 4) references 'INP (interactivity)' as the current interactivity metric, which is correct for WCAG 2.2 era. However, the Title Tag entry (id 26) contains 'Best Running Shoes 2024' in its example, which is a hardcoded year that becomes stale over time. The glossary lacks a dateLastReviewed or version metadata field on each term, meaning there is no governance mechanism to ensure terminology stays current.",
    "skip_reason": "Glossary example uses stale year 2024",
    "fix_approach": "Update to current year; add dynamic generation"
  },
  {
    "bug_id": "R05-209",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Color Contrast",
    "file": "src/hooks/useDueDates.js",
    "line": 0,
    "description": "getDueDateUrgency function returns color-only status indicators ('red', 'amber', 'orange', 'yellow', 'blue', 'charcoal') without any text-based alternative for distinguishing urgency. Components consuming this hook may render urgency using color alone without a text label accessible to color-blind users.",
    "skip_reason": "Due date urgency uses color only",
    "fix_approach": "Add text labels: Overdue, Due Soon, On Track"
  },
  {
    "bug_id": "R06-103",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Schema Error",
    "file": "src/config/seo.js",
    "line": 0,
    "description": "The organizationSchema foundingDate uses '2024' as a plain string. Schema.org expects foundingDate to be in ISO 8601 date format (YYYY-MM-DD or YYYY). While '2024' is technically a valid year, Google's Rich Results validator prefers the full date format, and the value should match the actual founding date.",
    "skip_reason": "foundingDate uses plain string not ISO 8601",
    "fix_approach": "Change to \"2024-01-01\" per spec"
  },
  {
    "bug_id": "R09-C-009",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Deploy Risk",
    "file": "src/lib/schema-generator/schemaGeneratorService.js",
    "line": 0,
    "description": "Unlike suggestionService.js which throws an error when API key is used in production, schemaGeneratorService.js getApiConfig() (line 30-43) returns { useProxy: false, apiKey } without any production guard. If VITE_CLAUDE_API_KEY is present in the environment during a production build, the service will use direct browser-to-API calls with the header 'anthropic-dangerous-direct-browser-access: true' (line 291). This inconsistency means some AI features are properly secured while others are not.",
    "skip_reason": "schemaGenerator uses direct API key in production",
    "fix_approach": "Block direct key in prod; require proxy URL"
  },
  {
    "bug_id": "R09-C-014",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Monitoring Gap",
    "file": "src/hooks/useExportHistory.js",
    "line": 0,
    "description": "The logExport function (line 100-113) catches errors but only logs them to console.error and returns null. There is no metric tracking for export success/failure rates, no tracking of export durations, and no monitoring of which export types are most used. The deleteExport function (line 117-123) similarly only logs errors to console. For a business-critical feature like report generation and export, this lack of telemetry makes it impossible to understand export reliability and usage patterns.",
    "skip_reason": "Export history no metrics tracking",
    "fix_approach": "Add success/failure tracking; log duration"
  },
  {
    "bug_id": "R10-C-008",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Missing Error State",
    "file": "src/hooks/useExportHistory.js",
    "line": 0,
    "description": "The useExportHistory hook's onSnapshot listener does not include an error callback. If the Firestore query fails, loading remains true indefinitely. Additionally, the logExport function (line 100) silently returns null on error with only a console.error, providing no user feedback that the export was not logged. The deleteExport function (line 117) also silently fails.",
    "skip_reason": "Export onSnapshot has no error callback",
    "fix_approach": "Add error callback; expose error state"
  },
  {
    "bug_id": "R10-C-015",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Feedback Gap",
    "file": "src/hooks/useDueDates.js",
    "line": 0,
    "description": "The markComplete function silently succeeds or fails without any user feedback. Unlike addDueDate, updateDueDate, and deleteDueDate which all show toast messages, markComplete has no toast notification on success or failure. Users click to mark a due date complete and get no confirmation that the action was recorded.",
    "skip_reason": "Due date completion silently succeeds — no feedback",
    "fix_approach": "Add toast notification on completion"
  },
  {
    "bug_id": "R11-B-002",
    "batch": 7,
    "severity": "MEDIUM",
    "category": "Terminology",
    "file": "src/config/seo.js",
    "line": 0,
    "description": "The SEO configuration for the glossary page at pageSEO['help/glossary'] claims '100+ Terms Explained Simply' in the title tag, but the glossary data file (src/data/glossary.js) contains only 30 terms. This is a significant discrepancy between the metadata claim and the actual content, constituting misleading terminology/content representation.",
    "skip_reason": "SEO meta claims 100+ terms but only 30 exist",
    "fix_approach": "Update meta or expand glossary"
  },
  {
    "bug_id": "R05-211",
    "batch": 8,
    "severity": "MEDIUM",
    "category": "Form A11y",
    "file": "src/hooks/useFileAttachments.js",
    "line": 0,
    "description": "File upload progress (uploadProgress state 0-100) has no mechanism for live region announcement. During file upload, the progress percentage updates from 0 to 100 but the hook provides no aria-live announcement mechanism. Consuming components would need to implement their own live region to announce upload progress to screen reader users.",
    "skip_reason": "FileAttachments file input missing label",
    "fix_approach": "Add aria-label or associated label element"
  },
  {
    "bug_id": "R09-B-013",
    "batch": 8,
    "severity": "MEDIUM",
    "category": "Caching Gap",
    "file": "src/components/readability/ReadabilityInputScreen.jsx",
    "line": 0,
    "description": "The first-use onboarding callout directly accesses localStorage.getItem('readability-onboarded') during render without using the storageHelpers utility and without try/catch error handling. If localStorage is unavailable (private browsing in some browsers, storage quota exceeded, or SSR context), this will throw an unhandled exception during render. Additionally, the key 'readability-onboarded' is not registered in STORAGE_KEYS in storageHelpers.js, bypassing the centralized storage management, quota tracking, and export/import functionality.",
    "skip_reason": "InputScreen no client-side caching of inputs",
    "fix_approach": "Cache recent inputs in localStorage"
  },
  {
    "bug_id": "R08-B-009",
    "batch": 9,
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "file": "src/components/readability/ReadabilityWeightConfig.jsx",
    "line": 0,
    "description": "The ReadabilityWeightConfig component stores custom weight configurations only in local component state. When the user adjusts weights and clicks 'Apply Weights', the onChange callback fires (line 41) but there is no persistence mechanism. The weights revert to defaults when the component remounts. The parent ReadabilityDashboard (line 447) only logs the weights to console. Custom weight configurations are lost on page navigation.",
    "skip_reason": "WeightConfig weights lost on navigation",
    "fix_approach": "Persist custom weights to localStorage"
  },
  {
    "bug_id": "R02-207",
    "batch": 10,
    "severity": "MEDIUM",
    "category": "Color Inconsistency",
    "file": "src/hooks/useReadabilityExport.js",
    "line": 0,
    "description": "The getGradeColorRGB function (lines 59-65) uses different score thresholds than the GRADE_MAP in gradeMapper.js (lines 6-15). The PDF export maps >=90 to emerald, >=80 to teal, >=70 to amber, >=60 to orange, and <60 to red. But GRADE_MAP has finer granularity: 95-100=A+/emerald, 90-94=A/emerald, 85-89=B+/teal, 80-84=B/teal, 75-79=C+/amber, 70-74=C/amber, 60-69=D/orange, 0-59=F/red. The score of 85 would be 'teal' in the UI but maps to teal in PDF, which happens to match, but a score of 92 maps to emerald in the GRADE_MAP but the PDF function also returns emerald for >=90. However, the key discrepancy: a score of 75 shows 'amber' in GRADE_MAP (C+) but in the PDF it uses getGradeColorRGB which returns amber for >=70 -- these happen to overlap but the dual mapping system is fragile and will diverge if either is modified independently.",
    "skip_reason": "ReadabilityExport grade colors differ from gradeMapper",
    "fix_approach": "Align with gradeMapper canonical values"
  },
  {
    "bug_id": "R04-203",
    "batch": 10,
    "severity": "MEDIUM",
    "category": "Progressive Disclosure",
    "file": "src/hooks/useReadabilityExport.js",
    "line": 0,
    "description": "The exportPDF function accepts 12 option parameters including advanced white-labeling features (brandPrimaryColor, brandAccentColor, customFooterText, hidePoweredBy) at the same level as basic options (reportTitle, clientName). No progressive disclosure separates basic from advanced export options. All options are destructured in a single block at line 100-113.",
    "skip_reason": "ReadabilityExport all options shown without grouping",
    "fix_approach": "Group by type; show common first with More Options"
  },
  {
    "bug_id": "R09-C-011",
    "batch": 10,
    "severity": "MEDIUM",
    "category": "Monitoring Gap",
    "file": "src/lib/readability/aiAnalyzer.js",
    "line": 0,
    "description": "In aiAnalyzer.js, when the caller provides an AbortSignal via options.signal (line 54), the code creates a NEW AbortController and its own signal but then uses 'const signal = options.signal || controller.signal'. This means if the caller passes a signal, the internal timeout controller's abort will never trigger because the fetch uses the caller's signal instead. The 120-second timeout (line 10) is effectively bypassed whenever options.signal is provided, which is the normal usage path from useReadabilityAnalysis.",
    "skip_reason": "aiAnalyzer no metrics for latency, failures, or tokens",
    "fix_approach": "Add timing wrapper; track rates and token usage"
  },
  {
    "bug_id": "R11-A-010",
    "batch": 10,
    "severity": "MEDIUM",
    "category": "Taxonomy Gap",
    "file": "src/components/activity/ActivityTimeline.jsx",
    "line": 0,
    "description": "The ActivityTimeline component defines activity types for all portal tools (audit, accessibility, imagealt, meta, schema) but has no activity type for the Readability tool, which is defined in src/config/tools.js (id: 'readability'). The ACTIVITY_ICONS, ACTIVITY_COLORS, and ACTIVITY_CATEGORIES mappings all omit readability-related events. This means readability tool usage generates no trackable activity entries.",
    "skip_reason": "ActivityTimeline readability activities not categorized",
    "fix_approach": "Add readability type mapping to config"
  },
  {
    "bug_id": "R08-A-011",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Scope Gap",
    "file": "src/components/export/ExportHubPage.jsx",
    "line": 0,
    "description": "The project selection dropdown in the Export Hub only shows the first 6 projects, with no pagination or search, preventing users from exporting data for projects beyond position 6.",
    "skip_reason": "ExportHubPage only current project — no cross-project",
    "fix_approach": "Add multi-project export option"
  },
  {
    "bug_id": "R09-A-012",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Dependency Risk",
    "file": "package.json",
    "line": 0,
    "description": "The package.json uses caret (^) version ranges for all 18 production dependencies. While this is common, several dependencies are pinned to major versions that may have breaking changes in minor releases. Notable concerns: firebase ^12.7.0 (Firebase SDK is large and frequently updated with potential breaking changes), pdfjs-dist ^5.4.530 (uncommon version pattern suggesting a newer release train), and jspdf ^4.0.0 (major version 4 may have API changes from v3). There is no package-lock.json audit step in the build scripts, and no 'npm audit' or security scanning in the CI pipeline (no CI configuration files found).",
    "skip_reason": "Dependencies not pinned — semver allows breaking changes",
    "fix_approach": "Pin all versions; add Dependabot/Renovate"
  },
  {
    "bug_id": "R09-A-013",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Deploy Risk",
    "file": "package.json",
    "line": 0,
    "description": "The package.json contains only basic scripts (dev, build, preview, lint, test). There are no CI/CD configuration files in the repository (no .github/workflows, no .gitlab-ci.yml, no Dockerfile, no vercel.json, no firebase.json for hosting). The build process has no automated quality gates: no lint step in build, no test step before deploy, no bundle size budget enforcement, no lighthouse CI, and no environment variable validation.",
    "skip_reason": "No automated security audit in CI",
    "fix_approach": "Add npm audit to CI; fail on HIGH/CRITICAL"
  },
  {
    "bug_id": "R09-A-018",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Error Logging",
    "file": "src/contexts/AuthContext.jsx",
    "line": 0,
    "description": "The deleteAccount function silently catches and ignores Firebase Storage file deletion errors (line 187-189: empty catch block with comment 'Silently fail if no files exist or storage error'). Similarly, fetchUserProfile at line 217 silently swallows Firestore read errors. If storage deletion fails due to permission issues or partial failures, the user receives a success toast ('Your account has been permanently deleted') even though their files remain in Firebase Storage, creating orphaned data and potential GDPR/privacy compliance issues.",
    "skip_reason": "AuthContext error logging insufficient for prod",
    "fix_approach": "Add structured logging; integrate monitoring"
  },
  {
    "bug_id": "R09-B-009",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Dependency Risk",
    "file": "package.json",
    "line": 0,
    "description": "The lucide-react dependency is pinned to version '^0.294.0', which is a pre-1.0 release. Pre-1.0 semver ranges with caret (^) allow minor version upgrades that may include breaking changes per semver conventions for pre-1.0 packages. lucide-react is used extensively throughout the entire application (every component imports icons from it). A breaking change in icon names, props, or tree-shaking behavior could break the entire UI across all components simultaneously during npm install or CI builds.",
    "skip_reason": "Dependencies have known vulnerabilities",
    "fix_approach": "Run npm audit fix; add CI security gate"
  },
  {
    "bug_id": "R09-C-012",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Dependency Risk",
    "file": "package.json",
    "line": 0,
    "description": "Several dependencies use caret (^) version ranges, which means minor and patch versions can change between installs. Critical dependencies like firebase (^12.7.0), jspdf (^4.0.0), and exceljs (^4.4.0) could receive breaking updates within their major version. Additionally, there is no package-lock.json enforcement or lockfile integrity check in the build scripts, and the dependency count is large (17 runtime dependencies) with no evidence of periodic audit.",
    "skip_reason": "Packages at end-of-life with no migration plan",
    "fix_approach": "Audit EOL deps; plan migration"
  },
  {
    "bug_id": "R01-206",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "State Bug",
    "file": "src/hooks/useReadabilitySettings.js",
    "line": 0,
    "description": "updateSettings captures `settings` in its closure (line 61: `const newSettings = { ...settings, ...updates }`). If updateSettings is called twice in rapid succession, the second call will use the stale settings state that doesn't include the first update's changes, overwriting them.",
    "skip_reason": "ReadabilitySettings reverts to defaults on remount",
    "fix_approach": "Persist to localStorage or Firestore"
  },
  {
    "bug_id": "R08-A-007",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "Audit Trail",
    "file": "src/components/checklist/FileUpload.jsx",
    "line": 0,
    "description": "File upload and deletion operations are not logged to any audit trail. There is no record of who uploaded or deleted files, or when these actions occurred.",
    "skip_reason": "FileUpload audit trail insufficient",
    "fix_approach": "Track upload/delete via document metadata"
  },
  {
    "bug_id": "R09-B-010",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "Environment Issue",
    "file": "src/utils/lazyWithRetry.js",
    "line": 0,
    "description": "The lazyWithRetry utility uses a fixed 1-second retry delay (RETRY_DELAY = 1000ms) with no exponential backoff. When a chunk fails to load (e.g., during a deployment with cache invalidation), all 3 retries fire at the same 1-second interval. This provides no relief for transient network issues or CDN propagation delays. Additionally, there is no mechanism to force a page reload when chunk loading ultimately fails after retries -- which is the standard recovery mechanism when a new deployment invalidates old chunk hashes.",
    "skip_reason": "lazyWithRetry environment detection inconsistent",
    "fix_approach": "Unify using import.meta.env.PROD"
  },
  {
    "bug_id": "R09-C-010",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "Error Logging",
    "file": "src/utils/storageHelpers.js",
    "line": 0,
    "description": "All error handling in storageHelpers.js relies exclusively on console.error/console.warn calls (lines 48, 64, 68, 75, 90, 314, 362). There is no integration with any structured logging or error monitoring service. Additionally, the importAllData function (line 353) accepts arbitrary JSON data without any schema validation, version checking, or sanitization — it blindly writes to all storage keys, which could corrupt application state if malformed data is imported.",
    "skip_reason": "storageHelpers error logging insufficient",
    "fix_approach": "Add structured logging; surface quota errors"
  },
  {
    "bug_id": "R09-C-013",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "Caching Gap",
    "file": "src/lib/readability/utils/analysisCache.js",
    "line": 0,
    "description": "The analysis cache stores potentially large analysis result objects in localStorage (line 107), but there is no size check before writing. Each cached analysis contains checkResults, recommendations, llmExtractions, and aiAssessment data that could be several hundred KB when serialized to JSON. With MAX_CACHE_ENTRIES set to 20 (line 9), the cache could consume several MB of the ~5MB localStorage quota, directly competing with the storageHelpers.js STORAGE_KEYS data and potentially causing QuotaExceededError across the application.",
    "skip_reason": "analysisCache no TTL or invalidation",
    "fix_approach": "Add TTL; invalidate on data changes"
  },
  {
    "bug_id": "R10-C-009",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "Feedback Gap",
    "file": "src/hooks/useReadabilitySettings.js",
    "line": 0,
    "description": "The updateSettings function applies the optimistic update to local state immediately (line 61) but does not revert the state if the Firestore write fails (lines 70-73). The error is only logged to console.error and stored in an error state variable, but the UI shows the new settings values even though they were not actually persisted. There is no toast or user-visible notification of the save failure.",
    "skip_reason": "ReadabilitySettings no save confirmation",
    "fix_approach": "Add toast confirming save; error toast on failure"
  },
  {
    "bug_id": "R09-A-019",
    "batch": 19,
    "severity": "MEDIUM",
    "category": "Deploy Risk",
    "file": "index.html",
    "line": 0,
    "description": "The application is a single-page application using BrowserRouter (client-side routing with history API), but there is no hosting/server configuration file defining SPA fallback routing. Without a hosting config (firebase.json, netlify.toml, vercel.json, _redirects, etc.), direct navigation to any route other than '/' (e.g., /app/audit, /login, /features/planner) will return a 404 from the hosting server because those paths do not correspond to physical files.",
    "skip_reason": "SPA routing is platform-dependent",
    "fix_approach": "Add platform-specific config files (_redirects, vercel.json)"
  },
  {
    "bug_id": "R01-004",
    "batch": 2,
    "severity": "LOW",
    "category": "Performance Bug",
    "file": "src/components/accessibility/dashboard/AccessibilityDashboard.jsx",
    "line": 0,
    "description": "handleExportPDF, handleExportExcel, and handleExportVPAT functions are not wrapped in useCallback despite referencing stable dependencies. These get recreated on every render.",
    "skip_reason": "Export handlers not wrapped in useCallback",
    "fix_approach": "Wrap in useCallback; minimal real-world impact"
  },
  {
    "bug_id": "R09-C-015",
    "batch": 5,
    "severity": "LOW",
    "category": "Code Splitting",
    "file": "vite.config.js",
    "line": 0,
    "description": "The manualChunks configuration in vite.config.js includes 'htmlparser2' and 'franc' in the 'vendor-readability' chunk (line 20), but these libraries are used exclusively by the readability analysis feature. Grouping them with jszip (which is used by both audit export and readability export) into a single vendor chunk means that navigating to any feature that uses jszip will also load htmlparser2 and franc, even if readability analysis is never used.",
    "skip_reason": "manualChunks groups readability-only libs into shared chunk",
    "fix_approach": "Split by actual usage pattern"
  },
  {
    "bug_id": "R10-A-014",
    "batch": 6,
    "severity": "LOW",
    "category": "Form UX Issue",
    "file": "src/components/audit/ScheduledAuditsPanel.jsx",
    "line": 0,
    "description": "The AuditScheduleFormModal has a 3-step wizard but allows skipping directly to any step by clicking the step indicator bars (lines 851-862). The handleSubmit validates required fields (name, url, categories) only on final submission but not on step navigation. A user can skip from Step 1 to Step 3 without entering the required URL or name, then must backtrack when the final validation fails. The step indicators are clickable buttons but there is no per-step validation enforced.",
    "skip_reason": "AuditScheduleForm allows advancing without validation",
    "fix_approach": "Add required field checks before Next"
  },
  {
    "bug_id": "R06-111",
    "batch": 7,
    "severity": "LOW",
    "category": "Schema Error",
    "file": "src/config/seo.js",
    "line": 0,
    "description": "The softwareSchemas entries for 'audit' (line 175) and 'accessibility' (line 196) are missing the 'screenshot' property that the 'planner' schema includes at line 172. Google Rich Results uses screenshot to display app preview images. Inconsistent schema properties across similar schema types reduces structured data quality.",
    "skip_reason": "Software schemas missing screenshot property",
    "fix_approach": "Add screenshot URLs to schema entries"
  },
  {
    "bug_id": "R06-114",
    "batch": 7,
    "severity": "LOW",
    "category": "Social Cards",
    "file": "src/config/seo.js",
    "line": 0,
    "description": "The defaultMeta.ogImage points to a static path '${SITE_URL}/og-image.png' but there is no mechanism to verify this image exists, and there are no page-specific OG images. All pages share the same generic OG image. Feature pages should have tool-specific OG images for better social sharing differentiation.",
    "skip_reason": "All pages share same OG image",
    "fix_approach": "Assign tool-specific social preview images"
  },
  {
    "bug_id": "R07-B-015",
    "batch": 8,
    "severity": "LOW",
    "category": "Token Management",
    "file": "src/components/readability/ReadabilityInputScreen.jsx",
    "line": 0,
    "description": "The paste input tab limits content to 2MB by raw byte size but has no consideration for token limits of the AI models that will process the content. A 2MB HTML file could contain hundreds of thousands of tokens, potentially exceeding the context window of models like GPT-4o or Claude, leading to truncated analysis or unexpected costs.",
    "skip_reason": "InputScreen no token/character limit indicator",
    "fix_approach": "Add character count with max limit"
  },
  {
    "bug_id": "R03-209",
    "batch": 10,
    "severity": "LOW",
    "category": "Terminology Inconsistency",
    "file": "src/hooks/useReadabilityExport.js",
    "line": 0,
    "description": "Header text 'AI Readability Checker' differs from the product name 'AI Readability Analysis Report' used on the cover page",
    "skip_reason": "ReadabilityExport terminology inconsistency",
    "fix_approach": "Standardize labels to match tools.js names"
  },
  {
    "bug_id": "R04-010",
    "batch": 10,
    "severity": "LOW",
    "category": "Taxonomy Issue",
    "file": "src/components/activity/ActivityTimeline.jsx",
    "line": 0,
    "description": "The activity filter categories use inconsistent granularity. 'Tools' groups 6 different tool types together (audit, accessibility, imagealt, meta, schema), while 'Checklist' and 'Files' are separate categories with only 2 types each. The 'Readability' tool activity type is entirely missing from any filter category.",
    "skip_reason": "ActivityTimeline inconsistent activity type labels",
    "fix_approach": "Standardize using canonical tool names"
  },
  {
    "bug_id": "R11-C-014",
    "batch": 11,
    "severity": "LOW",
    "category": "Metadata Issue",
    "file": "src/lib/readability/checks/technicalAccess.js",
    "line": 0,
    "description": "The checkRobotsTxt function (TA-03) always returns status 'warn' regardless of the analysis outcome. Line 59 has a conditional that evaluates to 'warn' in both the true and false branches: `status: crawlerIssues.length > 0 ? 'warn' : 'warn'`. This means the check can never pass or fail, always producing a warning that adds noise to the results without actionable differentiation.",
    "skip_reason": "technicalAccess missing robots.txt advanced parsing",
    "fix_approach": "Parse crawl-delay, sitemap refs, user-agent rules"
  },
  {
    "bug_id": "R08-C-016",
    "batch": 12,
    "severity": "LOW",
    "category": "Audit Trail",
    "file": "src/lib/audit/auditStorageService.js",
    "line": 0,
    "description": "The shared audit view count increment in getSharedAudit (line 297-298) uses a non-atomic read-then-write pattern. The current viewCount is read from the document, incremented in JavaScript, and written back. Under concurrent access, multiple viewers could read the same viewCount value simultaneously and all write the same incremented value, resulting in lost view counts. Firestore provides the increment() server-side function specifically for this use case.",
    "skip_reason": "auditStorageService no audit trail for operations",
    "fix_approach": "Log operations to auditLog with actor and timestamp"
  },
  {
    "bug_id": "R09-B-014",
    "batch": 14,
    "severity": "LOW",
    "category": "Error Logging",
    "file": "src/hooks/useCustomChecklistItems.js",
    "line": 0,
    "description": "The Firestore onSnapshot listener in useCustomChecklistItems does not handle errors via the onSnapshot error callback. The onSnapshot function accepts an optional error handler as its third argument (or via the observer object), but here only the success callback is provided. If the Firestore subscription encounters a permission error, network disconnection, or quota limit, the error will be unhandled and the loading state will remain true indefinitely, leaving users in a perpetual loading state.",
    "skip_reason": "useCustomChecklistItems error logging insufficient",
    "fix_approach": "Add structured logging with item context"
  },
  {
    "bug_id": "R08-B-014",
    "batch": 15,
    "severity": "LOW",
    "category": "Workflow Gap",
    "file": "src/components/shared/DueDatesWidget.jsx",
    "line": 0,
    "description": "The 'View all' button in the DueDatesWidget (displayed when there are more than 5 due dates) has no onClick handler and no navigation target. It renders as a button element with text showing the total count but clicking it does nothing. This is a workflow dead-end where users are informed that more items exist but cannot access them.",
    "skip_reason": "DueDatesWidget no bulk operations",
    "fix_approach": "Add bulk mark-complete and bulk reschedule"
  },
  {
    "bug_id": "R09-B-016",
    "batch": 17,
    "severity": "LOW",
    "category": "Monitoring Gap",
    "file": "src/components/shared/FeedbackWidget.jsx",
    "line": 0,
    "description": "The FeedbackWidget catches submission errors with an empty catch block that only shows a toast message ('Failed to submit feedback. Please try again.'). There is no console.error, no error logging, and no monitoring event. For a feature specifically designed to collect user feedback (including bug reports), the irony is that bug report submission failures themselves are completely invisible to the team. Additionally, the error object is not logged, so there is no way to distinguish between network failures, Firestore permission issues, or quota limits.",
    "skip_reason": "FeedbackWidget failures not tracked",
    "fix_approach": "Add error tracking for submissions"
  }
]