[
  {
    "bug_id": "R09-B-005",
    "batch": 1,
    "severity": "HIGH",
    "category": "Code Splitting",
    "file": "src/components/readability/ReadabilityDashboard.jsx",
    "line": 0,
    "description": "ReadabilityDashboard uses React.lazy for ReadabilityCategoryChart and ReadabilityLLMPreview, but eagerly imports seven other large components (ReadabilityRecommendations, ReadabilityIssuesTable, ReadabilityCrossToolLinks, ReadabilityPDFPreview, ReadabilityQuotableHighlighter, ReadabilityWeightConfig, ReadabilityScoreCard) that are displayed conditionally based on tab selection. Only one tab panel is visible at a time, yet all tab components are loaded upfront. Additionally, ReadabilityPDFPreview (which internally imports heavy PDF generation libraries) is eagerly imported even though it only renders when the user clicks 'Export as PDF'.",
    "skip_reason": "ReadabilityDashboard eagerly imports all 7 tab components",
    "fix_approach": "Convert to React.lazy with lazyWithRetry; load active tab only"
  },
  {
    "bug_id": "R06-108",
    "batch": 2,
    "severity": "HIGH",
    "category": "Meta Tag Issue",
    "file": "src/components/reports/ReportBuilderPage.jsx",
    "line": 0,
    "description": "The HTML export feature in ReportBuilderPage (lines 362-382) generates a standalone HTML document with minimal SEO tags. The exported HTML has <meta charset> and <title> but is missing: meta viewport tag (critical for mobile rendering), meta description, canonical URL, OG tags, and a proper lang attribute on the <html> element.",
    "skip_reason": "HTML export missing viewport, lang, OG tags",
    "fix_approach": "Add complete HTML5 boilerplate to export template"
  },
  {
    "bug_id": "R08-B-003",
    "batch": 3,
    "severity": "HIGH",
    "category": "Workflow Gap",
    "file": "src/components/reports/ScheduledReportsPanel.jsx",
    "line": 0,
    "description": "The ScheduledReportsPanel stores all schedule data in local React state only. The TODO comment on line 154 ('TODO: Load scheduled reports from Firestore') confirms that scheduled reports are never persisted to any backend. This means all scheduled report configurations are lost on page refresh, browser close, or navigation away from the panel.",
    "skip_reason": "ScheduledReportsPanel local state only — never persisted",
    "fix_approach": "Migrate to Firestore; add onSnapshot for real-time sync"
  },
  {
    "bug_id": "R04-205",
    "batch": 8,
    "severity": "HIGH",
    "category": "IA Problem",
    "file": "src/hooks/useReadabilityHistory.js",
    "line": 0,
    "description": "STORAGE_LIMITS is duplicated identically in both useReadabilityHistory.js (line 21) and useReadabilityAnalysis.js (line 38). This role-based configuration defines storage tiers (admin:500, project_manager:250, etc.) and is a critical IA concern because role-based limits should be defined in a single authoritative source. If one file is updated without the other, users see inconsistent storage information.",
    "skip_reason": "ReadabilityHistory no sorting or organization",
    "fix_approach": "Add sort options (date/score/URL); group by domain"
  },
  {
    "bug_id": "R04-008",
    "batch": 10,
    "severity": "HIGH",
    "category": "Cognitive Overload",
    "file": "src/components/home/HomePage.jsx",
    "line": 0,
    "description": "The HomePage presents 8 quick action buttons (line 188), 4 stat cards, a full tools grid section with 7+ cards, recent projects list, recent audits list, favorites widget, activity widget, recommendations section, and a tips section -- all on a single page with no progressive disclosure. Users face 9 distinct content sections simultaneously.",
    "skip_reason": "HomePage tools compete equally — no visual hierarchy",
    "fix_approach": "Show top tools prominently; rest behind See All"
  },
  {
    "bug_id": "R08-A-012",
    "batch": 12,
    "severity": "HIGH",
    "category": "Workflow Gap",
    "file": "src/components/audit/BatchAuditPanel.jsx",
    "line": 0,
    "description": "The batch audit pause mechanism does not actually stop the running audit loop because the isRunning state check on line 315 captures the stale closure value.",
    "skip_reason": "BatchAuditPanel no scheduling — manual trigger only",
    "fix_approach": "Add schedule option; integrate with ScheduledAuditsPanel"
  },
  {
    "bug_id": "R11-B-011",
    "batch": 12,
    "severity": "HIGH",
    "category": "Editorial Workflow",
    "file": "src/hooks/useChecklistTemplates.js",
    "line": 0,
    "description": "The useChecklistTemplates hook only queries templates created by the current user (line 33-36: where('createdBy', '==', currentUser.uid)). There is no mechanism to share templates between team members, even though the component description mentions 'shared templates' in the comment on line 24 ('Fetch templates (user's own + shared templates)'). This means editorial teams cannot share standardized checklist templates, forcing each team member to independently create and maintain their own templates rather than using organizationally approved ones.",
    "skip_reason": "Templates go live immediately without review",
    "fix_approach": "Add draft/published status; require review before publishing"
  },
  {
    "bug_id": "R11-B-008",
    "batch": 3,
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "file": "src/components/reports/ScheduledReportsPanel.jsx",
    "line": 0,
    "description": "The ScheduledReportsPanel component uses only local React state (useState) to manage all scheduled reports, with a TODO comment on line 154-155 stating 'Load scheduled reports from Firestore / Reports will be populated when users create scheduled reports'. This means all scheduled reports are lost on page refresh or navigation. For a content lifecycle feature that manages recurring report generation, this lack of persistence renders the entire scheduling system non-functional in practice.",
    "skip_reason": "ScheduledReportsPanel configs lost on unmount",
    "fix_approach": "Implement Firestore persistence; add status tracking"
  },
  {
    "bug_id": "R04-206",
    "batch": 8,
    "severity": "MEDIUM",
    "category": "Navigation Gap",
    "file": "src/hooks/useReadabilityHistory.js",
    "line": 0,
    "description": "The hook exposes both 'loadHistory: refresh' and 'refresh' as separate return values (lines 367-372), but they both point to the same function. This creates a confusing navigation/action API where consumers don't know which to call. Additionally, the aliasing (loadHistory maps to refresh, not the actual loadHistory function) obscures the real behavior.",
    "skip_reason": "ReadabilityHistory no deep link to specific results",
    "fix_approach": "Add URL-based routing with analysis ID"
  },
  {
    "bug_id": "R08-B-011",
    "batch": 9,
    "severity": "MEDIUM",
    "category": "Missing Feature",
    "file": "src/components/shared/LinkToProjectModal.jsx",
    "line": 0,
    "description": "The LinkToProjectModal allows linking items to projects but provides no mechanism to unlink an item from a project. Once an item is linked (handleLink function, line 55), the 'Linked' badge is shown (line 182) and the button becomes disabled. There is no unlink/remove association button or workflow. This is a missing CRUD operation - the 'Delete' part of linking is absent.",
    "skip_reason": "LinkToProjectModal no inline project creation option",
    "fix_approach": "Add Create New Project quick-create form within modal"
  },
  {
    "bug_id": "R04-009",
    "batch": 10,
    "severity": "MEDIUM",
    "category": "IA Problem",
    "file": "src/components/home/HomePage.jsx",
    "line": 0,
    "description": "Quick Actions section duplicates the Content Tools grid section below it. Both sections provide navigation to the same set of tools (planner, audit, accessibility, image-alt, meta-generator, schema-generator, readability). Quick Actions adds Export as the 8th item, but otherwise links to the same destinations as the ToolCard grid.",
    "skip_reason": "HomePage no clear hierarchy between categories",
    "fix_approach": "Group by workflow stage; add section headings"
  },
  {
    "bug_id": "R10-A-009",
    "batch": 11,
    "severity": "MEDIUM",
    "category": "Missing Empty State",
    "file": "src/components/export/ExportHubPage.jsx",
    "line": 0,
    "description": "When there are more than 6 projects, the ExportHubPage only shows the first 6 (projects.slice(0, 6) at line 321) but provides no pagination, 'Show More' button, or indication that additional projects exist. Users with many projects cannot access exports for projects beyond the first 6.",
    "skip_reason": "ExportHubPage no empty state when no tools used",
    "fix_approach": "Add EmptyState with guidance for unused projects"
  },
  {
    "bug_id": "R08-B-006",
    "batch": 12,
    "severity": "MEDIUM",
    "category": "Workflow Gap",
    "file": "src/hooks/useAssignments.js",
    "line": 0,
    "description": "The unassignTask function does not log activity or send notifications when a task is unassigned. While assignTask (line 42) properly logs activity and sends notifications to assigned users, and updateTaskStatus (line 107) logs activity, the unassignTask function (line 150) only deletes the assignment data without any audit logging or notification to the previously assigned users.",
    "skip_reason": "useAssignments no unassign or reassign capability",
    "fix_approach": "Add unassign with confirmation; reassign notifies both parties"
  },
  {
    "bug_id": "R08-A-016",
    "batch": 13,
    "severity": "MEDIUM",
    "category": "Scope Gap",
    "file": "src/components/audit/AuditHistoryPanel.jsx",
    "line": 0,
    "description": "The audit history list is limited to showing only 10 audits with no pagination or 'load more' capability, preventing access to older audit history.",
    "skip_reason": "AuditHistoryPanel has no export capability",
    "fix_approach": "Add CSV/JSON export using unifiedExportService"
  },
  {
    "bug_id": "R08-A-009",
    "batch": 14,
    "severity": "MEDIUM",
    "category": "Workflow Gap",
    "file": "src/components/projects/ProjectCreationWizard.jsx",
    "line": 0,
    "description": "The project creation wizard does not validate that the target launch date is after the start date. Users can create projects where the deadline precedes the start date.",
    "skip_reason": "ProjectCreationWizard no templates or quick-start",
    "fix_approach": "Add template selection as first step; pre-fill from template"
  },
  {
    "bug_id": "R04-213",
    "batch": 16,
    "severity": "MEDIUM",
    "category": "Progressive Disclosure",
    "file": "src/lib/readability/scorer.js",
    "line": 0,
    "description": "The scorer returns categoryScores with nested objects containing score/label/weight (line 83-89), but also returns checkResults as a nested object grouped by category key (line 90-96), AND returns allChecks as a flat array (line 97). Consumers receive the same check data in three different shapes: by-category nested objects, a flat array, and the category scores with metadata. No progressive disclosure helps consumers choose the right representation.",
    "skip_reason": "Readability scorer no progressive disclosure for weights",
    "fix_approach": "Add expandable breakdown; show summary by default"
  },
  {
    "bug_id": "R07-C-016",
    "batch": 16,
    "severity": "MEDIUM",
    "category": "Hallucination Risk",
    "file": "src/lib/readability/utils/whyItMatters.js",
    "line": 0,
    "description": "The 'Why This Matters' explanations contain assertive, unqualified claims about AI model behavior that are presented as factual statements without citations or caveats. For example: 'AS-01' states 'Explicit expertise signals (author credentials, citations) build trust with AI models evaluating content authority' but the mapping from AS-01 to AS-10 does not match the actual check IDs. AS-01 in aiSignals.js is 'Content uniqueness signals' (boilerplate detection), but the whyItMatters description for AS-01 discusses 'expertise signals'. This mismatch means users see explanations that do not correspond to the actual check being performed.",
    "skip_reason": "whyItMatters AI explanations not grounded in logic",
    "fix_approach": "Add source citations; validate against check documentation"
  },
  {
    "bug_id": "R10-C-011",
    "batch": 17,
    "severity": "MEDIUM",
    "category": "Undo Missing",
    "file": "src/hooks/useTimeTracking.js",
    "line": 0,
    "description": "The deleteEntry function permanently deletes time tracking entries without confirmation or undo. Time entries represent work records that may be needed for billing, reporting, or compliance. Additionally, there is no validation to prevent deleting another user's time entries - the function only checks for the entry ID without verifying ownership.",
    "skip_reason": "useTimeTracking delete has no undo",
    "fix_approach": "Add soft-delete with 5-second undo toast"
  },
  {
    "bug_id": "R10-A-010",
    "batch": 19,
    "severity": "MEDIUM",
    "category": "Form UX Issue",
    "file": "src/components/feedback/FeedbackForm.jsx",
    "line": 0,
    "description": "The feedback form resets all fields when isOpen becomes false (useEffect at line 142-160) with a 300ms delay. However, there is no unsaved changes warning when closing the form. If a user has partially filled out a detailed bug report with steps to reproduce, expected/actual behavior, and a screenshot, clicking the backdrop (line 286-288) or pressing Escape (line 165) immediately closes the modal and queues all data for deletion with no confirmation.",
    "skip_reason": "FeedbackForm no unsaved changes warning",
    "fix_approach": "Add beforeunload listener and confirmation dialog"
  },
  {
    "bug_id": "R01-208",
    "batch": 12,
    "severity": "LOW",
    "category": "Performance Bug",
    "file": "src/hooks/useUnsavedChanges.js",
    "line": 0,
    "description": "The dirty detection useEffect at line 57-60 uses JSON.stringify to deep-compare `values` and `originalValues` on every render when either changes. For large forms, this is an O(n) operation on every keystroke that could cause UI jank.",
    "skip_reason": "useUnsavedChanges no debounced autosave",
    "fix_approach": "Add 2-second autosave to localStorage; show Draft saved indicator"
  },
  {
    "bug_id": "R04-204",
    "batch": 12,
    "severity": "LOW",
    "category": "Content Grouping",
    "file": "src/hooks/useFavoritesAndRecents.js",
    "line": 0,
    "description": "ITEM_TYPES defines only 4 types (PROJECT, TOOL, AUDIT, RESOURCE) while the application has many more item types across other hooks (accessibility, image_alt, meta_data, schema, checklist). Favorites and recents cannot represent the full taxonomy of items in the application, resulting in incomplete content grouping.",
    "skip_reason": "Favorites not categorized by tool type",
    "fix_approach": "Group by tool type; add filter tabs"
  },
  {
    "bug_id": "R02-108",
    "batch": 15,
    "severity": "LOW",
    "category": "Color Inconsistency",
    "file": "src/components/shared/EmptyState.jsx",
    "line": 0,
    "description": "EmptyState component mixes gray-* and charcoal-* color palettes, using gray-50 for light mode background alongside charcoal-800 for dark mode.",
    "skip_reason": "EmptyState color inconsistency across contexts",
    "fix_approach": "Standardize color props; add dark mode variants"
  },
  {
    "bug_id": "R02-109",
    "batch": 15,
    "severity": "LOW",
    "category": "Visual Hierarchy",
    "file": "src/components/shared/EmptyState.jsx",
    "line": 0,
    "description": "Empty state icon uses text-gray-300 in light mode and text-gray-600 in dark mode, both of which are very low contrast and may be difficult to perceive.",
    "skip_reason": "EmptyState visual hierarchy unclear",
    "fix_approach": "Add variant prop (info/action/error) with distinct visuals"
  },
  {
    "bug_id": "R04-211",
    "batch": 16,
    "severity": "LOW",
    "category": "Content Grouping",
    "file": "src/lib/readability/utils/whyItMatters.js",
    "line": 0,
    "description": "The WHY_IT_MATTERS descriptions for CS-07 through CS-10 do not accurately match the check titles they correspond to. CS-07 maps to paragraph length check but the WHY_IT_MATTERS text for CS-07 discusses 'Internal links'. CS-09 maps to 'Logical reading order' but WHY_IT_MATTERS discusses 'Image alt text'. CS-10 maps to 'No content duplication' but describes 'content hierarchy'. The ID-to-description mapping is misaligned.",
    "skip_reason": "whyItMatters shown without hierarchy or collapsibility",
    "fix_approach": "Add collapsible sections per category; prioritize by impact"
  },
  {
    "bug_id": "R06-116",
    "batch": 19,
    "severity": "LOW",
    "category": "Internal Links",
    "file": "src/components/shared/Footer.jsx",
    "line": 0,
    "description": "Footer includes links to '/terms', '/privacy', '/ai-policy', and '/accessibility' (lines 129-139) but the pageSEO config in seo.js has no entries for these legal pages. If these pages exist, they lack structured SEO metadata. If they don't exist, these are broken internal links.",
    "skip_reason": "Footer links incomplete for public pages",
    "fix_approach": "Add missing links; ensure consistency with sitemap"
  },
  {
    "bug_id": "R07-C-014",
    "batch": 19,
    "severity": "LOW",
    "category": "Confidence Gap",
    "file": "src/lib/readability/utils/scoreConfidence.js",
    "line": 0,
    "description": "The calculateScoreConfidence function starts with a base confidence of 95% (line 22) and only reduces it based on N/A check ratio and LLM consensus. However, it does not account for several factors that should reduce confidence: (1) whether AI analysis was available (if fallback was used, confidence should be lower), (2) the number of LLMs that successfully responded (1 vs 3), (3) the input method (URL fetch vs paste, where paste has no server-side rendering context). The minimum confidence floor of 40% (line 30) is also relatively high for scenarios where most checks are N/A and AI analysis failed.",
    "skip_reason": "scoreConfidence lacks confidence bands and methodology",
    "fix_approach": "Add confidence interval display; document methodology"
  }
]