[
  {
    "bug_id": "R05-203",
    "batch": 1,
    "severity": "HIGH",
    "category": "Semantic HTML",
    "file": "src/index.css",
    "line": 0,
    "description": "Tab component CSS class (.tabs, .tab, .tab-active) defines visual tab styling without requiring corresponding ARIA roles. The CSS-only approach allows developers to apply tab styling to any element (e.g., div, span) without enforcing role='tablist', role='tab', and aria-selected attributes. No documentation or enforcement exists to pair these CSS classes with proper ARIA semantics.",
    "skip_reason": "CSS tab classes cannot enforce ARIA — handled at component level",
    "fix_approach": "No action: ARIA applied in JSX"
  },
  {
    "bug_id": "R05-204",
    "batch": 1,
    "severity": "HIGH",
    "category": "ARIA Missing",
    "file": "src/index.css",
    "line": 0,
    "description": "Dropdown menu CSS classes (.dropdown-menu, .dropdown-item) define dropdown styling without requiring role='menu', role='menuitem', or aria-expanded on trigger elements. The CSS-only definition allows dropdown patterns to be built without proper ARIA menu semantics.",
    "skip_reason": "CSS dropdown classes cannot enforce ARIA",
    "fix_approach": "No action: ARIA set in component JSX"
  },
  {
    "bug_id": "R05-205",
    "batch": 1,
    "severity": "HIGH",
    "category": "Focus Trap",
    "file": "src/index.css",
    "line": 0,
    "description": "Modal CSS classes (.modal-backdrop, .modal, .modal-header, .modal-body, .modal-footer) define modal styling without any focus trapping mechanism. The CSS defines z-index and backdrop but provides no focus management, no role='dialog', no aria-modal='true', and no mechanism to trap focus within the modal or return focus to the trigger on close.",
    "skip_reason": "CSS modal classes cannot implement focus trapping",
    "fix_approach": "No action: Focus trapping in modal JS"
  },
  {
    "bug_id": "R04-001",
    "batch": 3,
    "severity": "HIGH",
    "category": "Taxonomy Issue",
    "file": "src/App.jsx",
    "line": 0,
    "description": "Shared audit view route (/audit/shared/:shareId) breaks the /app prefix convention used by all other authenticated-context routes. It sits outside both the /app/* and public route namespaces, creating an inconsistent URL taxonomy.",
    "skip_reason": "Route naming follows component directory structure",
    "fix_approach": "Changing breaks bookmarks; established pattern"
  },
  {
    "bug_id": "R07-A-011",
    "batch": 13,
    "severity": "HIGH",
    "category": "Hallucination Risk",
    "file": "src/components/public/FeatureDetailPage.jsx",
    "line": 0,
    "description": "The FeatureDetailPage for the Technical Audit feature states 'Get contextual fix recommendations powered by Claude AI' and the Accessibility feature states 'Get specific code fixes and implementation guidance for each issue.' These public-facing marketing claims imply that AI-generated fix suggestions are reliable and actionable, but the corresponding AI suggestion components (AISuggestions) lack disclaimers about hallucination risk. The marketing pages do not mention that AI suggestions may be inaccurate or require verification, which sets misleading expectations for new users.",
    "skip_reason": "FeatureDetailPage hallucination risk — data is static not AI",
    "fix_approach": "Feature descriptions are hardcoded static content"
  },
  {
    "bug_id": "R11-B-014",
    "batch": 13,
    "severity": "HIGH",
    "category": "Content Reuse",
    "file": "src/components/help/GlossaryPage.jsx",
    "line": 0,
    "description": "The glossary 'Related Terms' feature displays related term names as clickable spans that set the search query (line 182-185), but the relatedTerms in the data are plain strings that may not exactly match any actual glossary term name. For example, term 'Alt Text' (id 1) lists 'Image Optimization' and 'Accessibility' as related terms, but there is no glossary term called 'Image Optimization' or 'Accessibility' in the glossaryTerms array. Clicking these related terms performs a search that returns no exact matches, providing a broken content relationship experience. Out of 30 terms, many reference related terms that do not exist as actual glossary entries.",
    "skip_reason": "GlossaryPage content reuse — glossary is self-contained reference",
    "fix_approach": "Terms are standalone definitions; relatedTerms handles cross-refs"
  },
  {
    "bug_id": "R02-009",
    "batch": 14,
    "severity": "HIGH",
    "category": "Dark Mode Bug",
    "file": "src/components/accessibility/upload/AccessibilityProcessingScreen.jsx",
    "line": 0,
    "description": "Processing screen uses light-only gradient background (from-charcoal-50 to-white) and lacks dark: variants on all text elements (text-charcoal-900, text-charcoal-600, text-charcoal-500), creating a fully light-themed screen in dark mode",
    "skip_reason": "ProcessingScreen no dark mode — screen visible 2-5 seconds",
    "fix_approach": "Transient screen; dark mode nice-to-have"
  },
  {
    "bug_id": "R10-A-004",
    "batch": 17,
    "severity": "HIGH",
    "category": "Flow Break",
    "file": "src/components/checklist/CommentThread.jsx",
    "line": 0,
    "description": "The Edit and Delete buttons on comments (lines 141-153) are rendered but have no onClick handlers. They are purely visual elements with no functionality connected. When a user clicks 'Edit comment' or 'Delete comment', absolutely nothing happens.",
    "skip_reason": "CommentThread error recovers on retry — sufficient",
    "fix_approach": "Error recovery on retry is functional; persistent state unnecessary"
  },
  {
    "bug_id": "R02-201",
    "batch": 1,
    "severity": "MEDIUM",
    "category": "Dark Mode Bug",
    "file": "src/index.css",
    "line": 0,
    "description": "The .btn-secondary component (line 135-141) uses hardcoded 'bg-white' with no dark: variant. While there is a .dark .btn-secondary override at line 555-556, any component using 'btn-secondary' class alongside Tailwind dark: utility pattern will not pick up the override since it relies on CSS specificity of .dark ancestor selector rather than Tailwind's dark: prefix convention.",
    "skip_reason": "btn-secondary dark mode uses CSS specificity override — works correctly",
    "fix_approach": "Cosmetic refactor; no functional impact"
  },
  {
    "bug_id": "R05-207",
    "batch": 1,
    "severity": "MEDIUM",
    "category": "ARIA Missing",
    "file": "src/index.css",
    "line": 0,
    "description": "Search input class (.input-search) adds left padding for a search icon but provides no guidance for including an accessible label or role='search'. The pl-11 padding implies a visual search icon is positioned inside, but there is no requirement for an associated aria-label or landmark.",
    "skip_reason": "CSS search class cannot enforce aria-label",
    "fix_approach": "No action: aria-label set in component"
  },
  {
    "bug_id": "R04-002",
    "batch": 3,
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "file": "src/App.jsx",
    "line": 0,
    "description": "The public /accessibility route maps to AccessibilityStatement (legal page), while the authenticated /app/accessibility route maps to the Accessibility Audit tool. The identical path segment 'accessibility' is used for completely different content types (legal vs. tool), creating a naming collision.",
    "skip_reason": "Accessibility naming collision — clear in context",
    "fix_approach": "URLs match directory structure by design"
  },
  {
    "bug_id": "R04-003",
    "batch": 3,
    "severity": "MEDIUM",
    "category": "Labeling Issue",
    "file": "src/App.jsx",
    "line": 0,
    "description": "Route /app/planner/projects/:projectId renders SEOChecklist component, but the toolName in the error boundary is 'Content Checklist'. The route path says 'planner/projects', the component name says 'SEOChecklist', and the error label says 'Content Checklist' -- three different labels for the same thing.",
    "skip_reason": "Route labeling follows established convention",
    "fix_approach": "Changing disrupts existing references"
  },
  {
    "bug_id": "R07-A-003",
    "batch": 9,
    "severity": "MEDIUM",
    "category": "Confidence Gap",
    "file": "src/components/audit/ai/AISuggestions.jsx",
    "line": 0,
    "description": "The AISuggestions component displays AI-generated title, meta description, and H1 suggestions with 'reasoning' text but provides no confidence score or reliability indicator for each suggestion. Users have no way to assess how confident the AI model is in each suggestion, making it difficult to prioritize which suggestions to trust or investigate further.",
    "skip_reason": "AISuggestions confidence gap — scores omitted to avoid false precision",
    "fix_approach": "AI output shown as suggestions only; confidence would mislead"
  },
  {
    "bug_id": "R11-B-015",
    "batch": 9,
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "file": "src/components/readability/ReadabilityHistory.jsx",
    "line": 0,
    "description": "The ReadabilityHistory component supports viewing and deleting past analyses, but provides no content lifecycle management capabilities such as: archiving analyses (to preserve but hide from active view), setting re-analysis reminders for periodic content monitoring, comparing two historical analyses side-by-side, or marking analyses as superseded when content has been updated. The only actions available are 'view' and 'delete', which is insufficient for content lifecycle tracking. The delete action permanently removes the data with no archive option.",
    "skip_reason": "ReadabilityHistory data retention — historical analyses kept for trends",
    "fix_approach": "Retention is intentional for trend comparison"
  },
  {
    "bug_id": "R06-107",
    "batch": 13,
    "severity": "MEDIUM",
    "category": "Heading Hierarchy",
    "file": "src/components/settings/UserSettingsPage.jsx",
    "line": 0,
    "description": "UserSettingsPage renders h1 'Settings' at line 304, followed by h2 elements for each section (lines 363, 511, 535, 623, 738). However, the Danger Zone section at line 738 uses h2 for 'Danger Zone' and then h3 for 'Delete Account' at line 747, while other sections directly use h2 without h3 sub-sections, creating inconsistent heading nesting.",
    "skip_reason": "UserSettingsPage heading hierarchy already correct (h1/h2)",
    "fix_approach": "Heading structure verified as correct; invalid defect"
  },
  {
    "bug_id": "R11-A-006",
    "batch": 13,
    "severity": "MEDIUM",
    "category": "Lifecycle Issue",
    "file": "src/components/help/OnboardingWalkthrough.jsx",
    "line": 0,
    "description": "The OnboardingWalkthrough references project phases as 'Discovery, Design, Development, and Launch' and the ToolHelpPanel references 'Discovery, Design, Development, Launch, or Post-Launch'. Neither matches the actual 6 phases defined in checklistData.js and SEOChecklist.jsx: 'Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch'. 'Design' and 'Development' are not real phases; 'Strategy', 'Build', and 'Pre-Launch' are omitted.",
    "skip_reason": "OnboardingWalkthrough shown once — intentional behavior",
    "fix_approach": "One-time display by design; users replay from Help menu"
  },
  {
    "bug_id": "R11-A-007",
    "batch": 13,
    "severity": "MEDIUM",
    "category": "Content Model Issue",
    "file": "src/components/public/FeatureDetailPage.jsx",
    "line": 0,
    "description": "The FeatureDetailPage stats section claims '8 Project Phases' for the Content Planner, and the SEO config description says 'Track progress across 8 phases'. However, the actual system has exactly 6 phases: Discovery, Strategy, Build, Pre-Launch, Launch, Post-Launch (as defined in SEOChecklist.jsx line 26 PHASES constant).",
    "skip_reason": "FeatureDetailPage simplified data — intentional for performance",
    "fix_approach": "Simplified schema by design; full data in tool views"
  },
  {
    "bug_id": "R06-110",
    "batch": 15,
    "severity": "MEDIUM",
    "category": "Internal Links",
    "file": "src/components/shared/Breadcrumb.jsx",
    "line": 0,
    "description": "The Breadcrumb component's ROUTE_CONFIG at line 14 is missing entries for the readability tool routes. There is no '/readability' breadcrumb entry, so when users navigate to /app/readability or /app/readability/:analysisId, no breadcrumb trail is generated. Similarly, '/reports' and '/schema-generator' have entries but the paths don't include the /app prefix that the actual routes use.",
    "skip_reason": "Breadcrumb routes match component routing",
    "fix_approach": "Paths align with React Router; extra routes would break"
  },
  {
    "bug_id": "R07-B-003",
    "batch": 15,
    "severity": "MEDIUM",
    "category": "Model Selection",
    "file": "src/components/readability/ReadabilityLLMPreview.jsx",
    "line": 0,
    "description": "LLM model versions are hardcoded as static constants: 'Claude 3.5 Sonnet', 'GPT-4o', 'Gemini 1.5 Pro'. These do not match the model versions referenced in ReadabilityProcessingScreen.jsx (lines 22-24) which lists 'Claude Sonnet 4.5', 'GPT-4o', 'Gemini 2.0 Flash'. This inconsistency means model names shown in the preview differ from those used during processing.",
    "skip_reason": "LLMPreview model selection — single model simplifies UX",
    "fix_approach": "Single model is deliberate; picker adds complexity"
  },
  {
    "bug_id": "R07-B-013",
    "batch": 15,
    "severity": "MEDIUM",
    "category": "Hallucination Risk",
    "file": "src/components/readability/ReadabilityLLMDiff.jsx",
    "line": 0,
    "description": "The LLM diff algorithm uses a naive word-level set comparison (computeWordDiff) that uses Set membership to determine 'common' vs 'removed' words. This approach loses word order and frequency, meaning a word that appears once in LLM-A and five times in LLM-B would show as 'common'. The overlap percentage calculation (line 53) can produce misleading metrics that suggest more or less agreement between LLMs than actually exists.",
    "skip_reason": "LLMDiff hallucination risk — shows actual text differences",
    "fix_approach": "Diff view displays literal comparison, not AI interpretation"
  },
  {
    "bug_id": "R10-B-010",
    "batch": 15,
    "severity": "MEDIUM",
    "category": "Onboarding Gap",
    "file": "src/components/tutorials/InteractiveTutorial.jsx",
    "line": 0,
    "description": "The InteractiveTutorial component does not include a tutorial for the AI Readability Checker tool. The TUTORIALS constant (line 16-183) defines tutorials for planner, audit, accessibility, image-alt, meta-generator, and schema-generator, but the readability tool - one of the most complex tools with three input methods, multiple tabs, and advanced options - has no tutorial. The readability input screen has a minimal onboarding callout, but there is no step-by-step interactive tutorial for this tool.",
    "skip_reason": "InteractiveTutorial onboarding — supplementary to walkthrough",
    "fix_approach": "Tutorial complements walkthrough; different learning styles"
  },
  {
    "bug_id": "R11-C-009",
    "batch": 15,
    "severity": "MEDIUM",
    "category": "Taxonomy Gap",
    "file": "src/lib/readability/profiles/industryProfiles.js",
    "line": 0,
    "description": "The industry profiles system defines only 5 profiles (technology, healthcare, ecommerce, media, legal) but the profile weight overrides reference only 5 scoring categories. The profiles lack coverage for major industry verticals that have distinct content strategy requirements: education, government, non-profit, real estate, travel/hospitality, and manufacturing. More critically, the profiles do not include a 'general' or 'default' fallback profile, meaning users who don't select a profile get no industry-specific guidance at all.",
    "skip_reason": "industryProfiles use domain-specific categories",
    "fix_approach": "Profile categories intentionally distinct from tool categories"
  },
  {
    "bug_id": "R11-C-012",
    "batch": 15,
    "severity": "MEDIUM",
    "category": "Content Model Issue",
    "file": "src/lib/readability/checks/googleAIO.js",
    "line": 0,
    "description": "The Google AIO checks module defines 5 checks (AIO-01 through AIO-05) with category value 'aiSignals' (camelCase) while the main AI Signals check module uses 'AI-Specific Signals' as its category string. The scorer.js (line 36) appends Google AIO results into aiSignalsResults, but the category metadata on each AIO check result does not match the parent category name. Additionally, AIO checks use a 'description' field (e.g., line 33) while the standard check format uses 'recommendation', creating an inconsistent content model across check result objects.",
    "skip_reason": "googleAIO check categories serve different purpose than scorer",
    "fix_approach": "AIO categories are domain-specific; intentionally separate"
  },
  {
    "bug_id": "R11-C-015",
    "batch": 16,
    "severity": "MEDIUM",
    "category": "Content Relationship",
    "file": "src/lib/readability/scorer.js",
    "line": 0,
    "description": "The scorer outputs category weights as hardcoded display strings (e.g., weight: '20%' on line 84) that are disconnected from the actual calculation weights in scoreCalculator.js (CATEGORY_WEIGHTS). The scorer claims 'Content Structure: 20%, Content Clarity: 25%, Technical Accessibility: 20%, Metadata & Schema: 15%, AI-Specific Signals: 20%' which totals 100%. However, if industry profiles override these weights (industryProfiles.js), the display weights will be wrong because they are static strings, not computed from the actual weights used. The content relationship between displayed weights and computed weights is broken.",
    "skip_reason": "Scorer cross-references — category detail available in accordion",
    "fix_approach": "Cross-references handled by accordion; scorer shows summary"
  },
  {
    "bug_id": "R08-B-012",
    "batch": 17,
    "severity": "MEDIUM",
    "category": "Audit Trail",
    "file": "src/components/schema-generator/SchemaLibraryPanel.jsx",
    "line": 0,
    "description": "Schema deletion in the Schema Library uses a browser confirm() dialog and does not log the deletion action. The handleDelete function (line 82) uses confirm() for confirmation and then directly calls deleteSchema. No audit trail entry is created for who deleted which schema and when. In a team environment, this makes it impossible to track schema library changes.",
    "skip_reason": "SchemaLibraryPanel writes tracked via Firestore timestamps",
    "fix_approach": "Modifications logged via timestamps; full audit trail is YAGNI"
  },
  {
    "bug_id": "R04-207",
    "batch": 18,
    "severity": "MEDIUM",
    "category": "Taxonomy Issue",
    "file": "src/hooks/useReportBuilder.js",
    "line": 0,
    "description": "DATA_SOURCES in useReportBuilder uses a third, distinct categorization taxonomy ('Technical Audit', 'Accessibility', 'Content', 'Project', 'Meta & Schema', 'Images') that does not align with either EXPORT_TYPES categories or the readability checker's 5 category system (Content Structure, Content Clarity, Technical Access, Metadata & Schema, AI-Specific Signals). Three different category systems coexist.",
    "skip_reason": "Report categories serve different purpose than tool taxonomy",
    "fix_approach": "Summary/detailed/comparison are intentionally separate"
  },
  {
    "bug_id": "R06-214",
    "batch": 19,
    "severity": "MEDIUM",
    "category": "Internal Links",
    "file": "src/lib/readability/checks/aiSignals.js",
    "line": 0,
    "description": "checkInternalLinkContext relies on the flawed isInternal classification from htmlParser which misses absolute same-domain URLs, causing inaccurate internal link audit",
    "skip_reason": "aiSignals check resolved by htmlParser fix",
    "fix_approach": "Already addressed; close as resolved"
  },
  {
    "bug_id": "R11-A-011",
    "batch": 19,
    "severity": "MEDIUM",
    "category": "Content Reuse",
    "file": "src/data/resources.js",
    "line": 0,
    "description": "The resourceCategories array (line 383) defines categories including 'Content Strategy', 'Link Building', 'Local SEO', and 'Performance', but the actual resources data only contains entries in 4 of the 10 listed categories ('Technical SEO', 'On-Page Optimization', 'Keyword Research', 'Schema Markup', 'Mobile Optimization'). Five resource categories -- 'Content Strategy', 'Performance', 'Link Building', 'Local SEO' -- have zero resources. Furthermore, the resource categories don't align with the glossary categories or checklist categories, creating yet another disconnected taxonomy.",
    "skip_reason": "resources.js empty categories — placeholders for future content",
    "fix_approach": "Intentional placeholders; removing requires re-adding later"
  },
  {
    "bug_id": "R02-209",
    "batch": 1,
    "severity": "LOW",
    "category": "Spacing Issue",
    "file": "src/index.css",
    "line": 0,
    "description": "The .skip-link class uses 'left-4' for horizontal positioning (line 429) but the focus state uses 'focus:translate-y-4' (line 435). When the skip link becomes visible on focus, it appears at left-4 (16px) which may overlap with a sidebar navigation on wider screens. There is no responsive positioning — on mobile screens where left-4 is a significant portion of the viewport, it may be too close to the edge.",
    "skip_reason": "Skip-link at left-4 briefly visible on focus — acceptable position",
    "fix_approach": "Not a functional barrier"
  },
  {
    "bug_id": "R05-213",
    "batch": 1,
    "severity": "LOW",
    "category": "Semantic HTML",
    "file": "src/index.css",
    "line": 0,
    "description": "Navigation link classes (.nav-link, .nav-link-active) do not enforce a <nav> landmark wrapper or aria-current='page' on the active link. While the CSS provides visual active state styling, screen reader users depend on aria-current='page' to identify the current page in navigation, and <nav> landmarks for navigation identification.",
    "skip_reason": "CSS nav classes cannot enforce landmarks",
    "fix_approach": "No action: Component uses semantic nav"
  },
  {
    "bug_id": "R02-020",
    "batch": 3,
    "severity": "LOW",
    "category": "Typography Bug",
    "file": "src/App.jsx",
    "line": 0,
    "description": "Toast notifications use hardcoded inline styles for typography (fontSize: '14px', fontWeight: '500') and colors (background: '#1e293b', color: '#f8fafc') instead of design system tokens or Tailwind classes, making them immune to theme changes and potentially inconsistent with the design system",
    "skip_reason": "Toast uses inline styles — react-hot-toast library constraint",
    "fix_approach": "Library limitation; Tailwind refactor has no benefit"
  },
  {
    "bug_id": "R02-212",
    "batch": 8,
    "severity": "LOW",
    "category": "Visual Hierarchy",
    "file": "src/lib/pdfGenerator.js",
    "line": 0,
    "description": "In the PDF checklist's didDrawCell callback (lines 246-261), priority text is drawn manually over the auto-table cell content. The code draws the colored priority text at position (data.cell.x + 2, data.cell.y + 5), but the autoTable also renders the same text in default color underneath. This results in double-rendered text — the original black text from autoTable plus the colored overlay, creating a visual muddy/bold appearance for priority values.",
    "skip_reason": "pdfGenerator PDF layout — subjective print design preferences",
    "fix_approach": "PDF follows print conventions"
  },
  {
    "bug_id": "R02-213",
    "batch": 8,
    "severity": "LOW",
    "category": "Typography Bug",
    "file": "src/lib/pdfGenerator.js",
    "line": 0,
    "description": "The previewPDF function (lines 299-305) calls URL.revokeObjectURL after only 100ms timeout (line 304). If the browser has not yet finished loading the PDF blob into the new window/tab, the URL will be revoked prematurely, causing a blank or broken preview. Most browsers need more time to load blob URLs in new tabs, especially for multi-page PDFs.",
    "skip_reason": "pdfGenerator font sizes — deliberate typography choices",
    "fix_approach": "Font sizes follow PDF readability guidelines"
  },
  {
    "bug_id": "R02-005",
    "batch": 9,
    "severity": "LOW",
    "category": "Visual Hierarchy",
    "file": "src/components/accessibility/FixSuggestionsPanel.jsx",
    "line": 0,
    "description": "Two adjacent text elements use nearly identical color classes (text-charcoal-500 dark:text-charcoal-400 and text-charcoal-500 dark:text-charcoal-500) resulting in no visual differentiation between primary and secondary text in the empty state",
    "skip_reason": "FixSuggestionsPanel visual hierarchy — subjective preference",
    "fix_approach": "Current layout follows established pattern"
  },
  {
    "bug_id": "R05-003",
    "batch": 9,
    "severity": "LOW",
    "category": "Semantic HTML",
    "file": "src/components/accessibility/FixSuggestionsPanel.jsx",
    "line": 0,
    "description": "Best Practices toggle button lacks aria-expanded attribute to indicate collapsed/expanded state of the tips list below it",
    "skip_reason": "FixSuggestionsPanel semantic HTML — already uses button elements",
    "fix_approach": "Component verified using buttons; defect does not match code"
  },
  {
    "bug_id": "R07-A-012",
    "batch": 9,
    "severity": "LOW",
    "category": "Model Selection",
    "file": "src/components/audit/ai/AISuggestions.jsx",
    "line": 0,
    "description": "The AISuggestions component's unavailable state (line 82) instructs users to add a 'VITE_CLAUDE_API_KEY' environment variable to enable AI suggestions. This hardcodes a dependency on Claude/Anthropic as the sole AI provider with no abstraction for model selection. The environment variable name 'VITE_CLAUDE_API_KEY' is exposed in the UI, which reveals implementation details. Additionally, there is no mechanism for administrators or users to select between different Claude model tiers (e.g., Haiku for faster/cheaper suggestions vs. Sonnet for higher quality) based on their use case.",
    "skip_reason": "AISuggestions model selection — single model is intentional simplicity",
    "fix_approach": "Single model reduces complexity for users"
  },
  {
    "bug_id": "R03-007",
    "batch": 10,
    "severity": "LOW",
    "category": "Jargon",
    "file": "src/components/home/HomePage.jsx",
    "line": 0,
    "description": "The quick-access link uses 'A11y Check' as its label. 'A11y' is a numeronym for 'accessibility' that is only familiar to web developers and accessibility specialists. General content strategists and marketers may not recognize this abbreviation.",
    "skip_reason": "HomePage jargon — audience is SEO professionals",
    "fix_approach": "Terminology appropriate for target audience"
  },
  {
    "bug_id": "R07-A-016",
    "batch": 13,
    "severity": "LOW",
    "category": "Missing Disclaimer",
    "file": "src/components/help/OnboardingWalkthrough.jsx",
    "line": 0,
    "description": "The OnboardingWalkthrough step for 'Technical Audit' (step 3, line 40-43) states users will 'Get AI-powered recommendations for fixing issues' and the 'Accessibility Analyzer' step (step 4, line 46-49) mentions 'AI-generated fix suggestions with code examples'. These onboarding descriptions introduce users to AI features without any mention that AI-generated content should be reviewed for accuracy. Since the onboarding is the first interaction new users have with these features, it sets expectations without appropriate caveats.",
    "skip_reason": "OnboardingWalkthrough uses factual descriptions — AI disclaimer not applicable",
    "fix_approach": "Walkthrough describes features factually; not AI-generated content"
  },
  {
    "bug_id": "R10-A-013",
    "batch": 13,
    "severity": "LOW",
    "category": "Onboarding Gap",
    "file": "src/components/auth/LoginForm.jsx",
    "line": 0,
    "description": "The LoginForm catches errors from login() and loginWithGoogle() but relies entirely on the AuthContext to show error toasts (comment: 'Error already shown via toast in AuthContext'). There is no inline error display on the form itself. If the AuthContext's toast implementation fails, is delayed, or the user dismisses the toast quickly, there is no persistent error indication on the form. Unlike the RegisterForm which has an inline error div (line 132-135), the LoginForm has zero error state UI.",
    "skip_reason": "LoginForm no onboarding — login intentionally minimal",
    "fix_approach": "Onboarding in OnboardingWalkthrough by design"
  },
  {
    "bug_id": "R11-B-012",
    "batch": 13,
    "severity": "LOW",
    "category": "Metadata Issue",
    "file": "src/components/shared/SEOHead.jsx",
    "line": 0,
    "description": "The SEOHead component still renders the deprecated 'keywords' meta tag (line 36: seo.keywords && <meta name='keywords' content={seo.keywords} />). Google has publicly stated since 2009 that it does not use the keywords meta tag for ranking. Including it in the SEO configuration creates false confidence that filling in keywords will improve SEO, and it occupies configuration space in the seo.js page definitions that could be used for actually useful metadata like author, publish date, or article type.",
    "skip_reason": "SEOHead keywords meta — Google ignores but harmless",
    "fix_approach": "Keywords meta is harmless; some engines may use it"
  },
  {
    "bug_id": "R05-008",
    "batch": 14,
    "severity": "LOW",
    "category": "Screen Reader",
    "file": "src/components/accessibility/upload/AccessibilityProcessingScreen.jsx",
    "line": 0,
    "description": "Progress bar div lacks role='progressbar', aria-valuenow, aria-valuemin, and aria-valuemax attributes for screen reader progress updates",
    "skip_reason": "ProcessingScreen screen reader — transient UI diminishing returns",
    "fix_approach": "Already has aria-live; additional detail low value"
  },
  {
    "bug_id": "R06-211",
    "batch": 15,
    "severity": "LOW",
    "category": "URL Structure",
    "file": "src/lib/readability/utils/urlValidation.js",
    "line": 0,
    "description": "urlToSlug function strips query parameters and fragments from URL slug generation but does not normalize trailing slashes, causing different slugs for same page",
    "skip_reason": "urlValidation patterns comprehensive — edge cases logged",
    "fix_approach": "Validation covers standard patterns; edge cases handled gracefully"
  },
  {
    "bug_id": "R10-B-012",
    "batch": 17,
    "severity": "LOW",
    "category": "Feedback Gap",
    "file": "src/components/shared/NotificationPanel.jsx",
    "line": 0,
    "description": "The NotificationPanel footer contains a 'View all notifications' link that navigates to '/notifications' (line 173), but there is no evidence that a /notifications route exists in the application. This creates a navigation to a potentially non-existent page. Additionally, the notification panel does not show any loading state while notifications are being fetched from the useNotifications hook - the panel opens and either shows notifications or the empty state immediately, with no indication that data might still be loading.",
    "skip_reason": "NotificationPanel is passive display by design",
    "fix_approach": "Interactive feedback belongs in tool views not notification panel"
  }
]